{"news_title": {"1": {"title": "Stock market today: S&P 500 vaults to record high with Nvidia earnings set to provide key test"}, "2": {"title": "Global energy market: India tariff impacts, Goldman's oil call"}, "3": {"title": "Stock Market Today: Dow Rises After Surprise GDP, Jobless Claims; Nvidia Slides On Earnings (Live Coverage)"}, "4": {"title": "Energy & Utilities Roundup: Market Talk"}, "5": {"title": "Exclusive-India’s Russian oil imports set to rise in September in defiance of US"}, "6": {"title": "Appointment of Chief AI Officer Might Change the Case For Investing In lululemon athletica (LULU)"}, "7": {"title": "Oil Drops as US Berates India and Surplus Concerns Flare Again"}, "8": {"title": "Middle Eastern Penny Stocks To Watch In August 2025"}, "9": {"title": "Crude Oil Prices Drop on Expected Weaker Demand as U.S. Summer Driving Season Ends"}, "10": {"title": "Refrigeration Oils Market Review 2020-2025 and Forecast to 2030 - Shift to Low-GWP Refrigerants Accelerate Amid Stricter EPA and EU Regulations"}, "11": {"title": "Exploring National Cement Company (Public Shareholding) And Two Other Undiscovered Gems In The Middle East"}, "12": {"title": "U.S. stock futures edged higher; second-quarter GDP, Nvidia earnings in focus"}, "13": {"title": "Oil falls as end of driving season looms, Druzhba restarts"}, "14": {"title": "TSX seen lower; bank stocks, Nvidia in spotlight"}, "15": {"title": "Exclusive-India’s Russian oil imports set to rise in September in defiance of US"}, "16": {"title": "Nvidia’s results, Tesla’s European sales, Japan trade - what’s moving markets"}, "17": {"title": "Oil prices slip as traders assess India tariff impact, US inventory draw"}, "18": {"title": "S&P 500 posts record close, dollar edges up; Nvidia shares down after the bell"}, "19": {"title": "Oil edges up on US crude stocks drop, impact of US tariffs on India"}, "20": {"title": "Crude Inventory Fell 2.4 Million Barrels Last Week - EIA Data"}, "21": {"title": "Tenaris stock rating reiterated at Outperform by Bernstein SocGen"}, "22": {"title": "Crude Prices Settle Higher as Supplies Tighten"}, "23": {"title": "Nat-Gas Prices Surge on Expectations of Lower-Than-Normal Inventory Build"}, "24": {"title": "Crude Prices Recover as Weekly EIA Crude Inventories Fall More than Expected"}, "25": {"title": "WTI Futures Trade Higher Following Overnight Weakness"}, "26": {"title": "Dollar Weakness Spurs Short Covering in Nat-Gas Futures"}, "27": {"title": "Crude Prices Fall Sharply as Global Oil Supply Concerns Ease"}, "28": {"title": "Crude Prices Retreat as Global Oil Supply Concerns Ease"}, "29": {"title": "Energy Futures Hold Above Key Resistance After Surprise Upside"}, "30": {"title": "Crude Prices Settle Sharply Higher on Geopolitical Risks and Possible Fed Rate Cut"}, "31": {"title": "Stock Market Today: Nasdaq Up As Pure Storage Rises 30%, Triggers Breakaway Buy; Nvidia Cuts Losses (Live Coverage)"}, "32": {"title": "Exxon Mobil Says World 'Not on Track' to Meet 2050 Emission Targets"}, "33": {"title": "BC-Crude Oil Futures"}, "34": {"title": "Stocks mixed as investors digest US GDP, Nvidia earnings"}, "35": {"title": "Sector Update: Energy Stocks Edge Higher Premarket Thursday"}, "36": {"title": "Q2 Growth Data, Nvidia Earnings in Focus as US Equity Futures Tread Water Pre-Bell"}, "37": {"title": "Oil Steadies as US Berates India, Surplus Concerns Flare Again"}, "38": {"title": "Oil Edges Down as the Market Looks to This Weekend's End to the Summer Driving Season"}, "39": {"title": "Soybeans Steady to Start Thursday Trade"}, "40": {"title": "U.S. stocks edged lower; Q2 GDP rose more than expected, Nvidia disappoints"}, "41": {"title": "Oil ticks lower as end of driving season looms, Druzhba restarts"}, "42": {"title": "Oil prices slip after U.S. inventory draw; U.S. GDP expanded in Q2"}, "43": {"title": "CANADA FX DEBT - Canadian dollar weakens, benchmark yield slips"}, "44": {"title": "Oil Heads for Monthly Loss as Traders Weigh Glut, Geopolitics"}, "45": {"title": "Stock Market Today: Dow Falls After Fed Inflation Data; Nvidia, Palantir Slide (Live Coverage)"}, "46": {"title": "Oil faces uphill struggle as supply glut worries mount: Reuters poll"}, "47": {"title": "UAE Residential Real Estate Market Set to Expand from USD 36.32 Billion (2024) to USD 52.32 Billion by 2030; Apartments Lead Growth as Policy Drives Long-Term Demand: MarkNtel Advisors"}, "48": {"title": "Dividend Growth and Earnings Outlook Might Change the Case for Investing in Coterra Energy (CTRA)"}, "49": {"title": "Crude Oil Prices Caught Between Possible Tighter Sanctions, Higher OPEC Output, Commerzbank Says"}, "50": {"title": "Oil Market Braces for Supply Surplus, But Demand Trends Will Also Be Crucial"}, "51": {"title": "Russian Crude Prices to Drop if India Cuts Back on Purchases: Wiggen"}, "52": {"title": "Gas hasn’t been this cheap on Labor Day since 2020"}, "53": {"title": "Oil Caught Between Demand Concerns and Geopolitical Risks"}, "54": {"title": "Oil prices slip marginally lower; Ukraine peace deal, India tariffs in focus"}, "55": {"title": "U.S. stock futures fall as investors bank profits; PCE data in line"}, "56": {"title": "Shares slip from record highs ahead of US inflation data"}, "57": {"title": "Oil prices fall on expected weaker demand, but set for weekly gain"}, "58": {"title": "Oil faces uphill struggle as supply glut worries mount: Reuters poll"}, "59": {"title": "TSX seen lower ahead of Canadian GDP, U.S. PCE data"}, "60": {"title": "In Spite of Market Fluctuations, Gold Trading Platforms Provide Consistent Returns to Global Investors"}, "61": {"title": "European stocks slip lower; key inflation data in spotlight"}, "62": {"title": "U.S. PCE, European inflation and \"de minimis\" exemption - what’s moving markets"}, "63": {"title": "India boosts US oil purchases on competitive prices, narrows trade deficit"}, "64": {"title": "What Our Top Chart Strategist is Watching on the Natural Gas Futures Charts Now"}, "65": {"title": "Crude Prices Recover on Geopolitical Concerns"}, "66": {"title": "Nat-Gas Prices Rally on a Less-Than-Expected EIA Inventory Build"}, "67": {"title": "Crude Oil Futures Rebound on EIA Report and Technical Support"}, "68": {"title": "Easing Global Supply Concerns Weigh on Crude Prices"}, "69": {"title": "Archer-Daniels-Midland to cease operations at Bushnell plant"}, "70": {"title": "Reliance boss Ambani urges Indian businesses to unite to counter geopolitical challenges"}, "71": {"title": "Imperial Petroleum Inc. Announces the Date for the Release of Second Quarter and Six Months 2025 Financial and Operating Results, Conference Call and Webcast"}, "72": {"title": "Sector Update: Energy Stocks Edge Higher Premarket Friday"}, "73": {"title": "Traders Digest Key Inflation Report as US Equity Futures Decline Pre-Bell"}, "74": {"title": "Oil Prices Aren't Likely To Rise Anytime Soon"}, "75": {"title": "Oil Prices Ease Ahead of the End of U.S. Summer Driving Season and OPEC+ Supply Hike"}, "76": {"title": "Looking for Income? 3 Oil Dividend Plays Yielding Over 4%"}, "77": {"title": "Stocks decline, US Treasury yields rise; US inflation data mostly in line"}, "78": {"title": "US crude oil production reaches record high in June, EIA reports"}, "79": {"title": "U.S. stocks slip lower as investors bank profits; PCE data in line"}, "80": {"title": "US oil production hit record high in June, EIA says"}, "81": {"title": "Oil Futures On Track For Small Weekly Gains"}, "82": {"title": "Buy These 3 Top-Ranked Energy Mutual Funds for Excellent Returns"}, "83": {"title": "US oil production hit record high in June, EIA says"}, "85": {"title": "European stocks fall; key inflation data in spotlight"}, "86": {"title": "Exchange-Traded Funds, US Equities Fall After Midday Friday"}, "87": {"title": "Will Crescent Energy Gain if the Federal Reserve Cuts Rate Next Month?"}, "88": {"title": "TSX runs higher on rate cut expectations"}, "89": {"title": "Oil prices fall with expected weaker demand, possible peace deal"}, "90": {"title": "Crude Prices Fall on Risk-Off Sentiment in Asset Markets"}, "91": {"title": "Crude Oil Rallies as Geopolitical Tensions Rise"}, "92": {"title": "Will Johnson & Johnson's (JNJ) $2 Billion U.S. Manufacturing Move Reshape Its R&D Ambitions?"}, "93": {"title": "Did Conagra Brands' (CAG) 'Future of Snacking' Report Mark a Shift in Its Innovation Strategy?"}, "94": {"title": "Should Softer Results and CFO Retirement Signal a Shift in Brown-Forman's (BF.B) Long-Term Strategy?"}, "95": {"title": "What Chemours (CC)'s Supply Collaboration With SRF Could Mean for Global Growth and Reliability"}, "96": {"title": "Does Recent Oil Price Volatility Signal an Opportunity in TotalEnergies for 2025?"}, "97": {"title": "7 Best Dividend Champions to Buy Now"}, "98": {"title": "Argus Raises Enbridge Inc. (ENB) Price Target, Views Dividend as Safe"}, "99": {"title": "BP (NYSE:BP) Wins Buy Rating as Strategy Shifts Back to Oil and Gas Priorities"}, "100": {"title": "TAG Oil Provides Financial Results and Operating Updates for Q2-2025"}, "101": {"title": "Acceleware Ltd. Announces Additional Extension of Private Placement Financing"}, "102": {"title": "Soybean Bulls Push Back on Friday"}, "103": {"title": "California sets aside penalties for high refinery profits"}, "104": {"title": "Stocks decline with tech shares; dollar weakens as Fed rate cut in view"}, "105": {"title": "Oil prices fall with expected low demand, upcoming supply boost"}, "106": {"title": "Crude Prices Settle Lower on Energy Demand Concerns"}, "107": {"title": "Nat-Gas Prices Underpinned by Shrinking US Inventories"}, "108": {"title": "Nat-Gas Prices Underpinned by Shrinking US Inventories"}, "109": {"title": "Does ConocoPhillips Offer Value After Positive Free Cash Flow Projections for 2025?"}, "110": {"title": "Did Incyte's (INCY) Leadership Shift and Pipeline Milestones Just Reshape Its Investment Narrative?"}, "111": {"title": "Why Align Technology (ALGN) Is Down 5.1% After Missed Guidance and Securities Probe News"}, "112": {"title": "Does Analyst Caution and Digital Investment Signal a Shift in Schlumberger's Strategy Outlook (SLB)?"}, "113": {"title": "How Recent Oil Price Swings Could Affect Cenovus Energy Shares in 2025"}, "114": {"title": "If You'd Invested $1,000 in ExxonMobil Stock 5 Years Ago, Here's How Much You'd Have Today"}, "115": {"title": "Oil rig parts maker to close 80pc of UK arm over Labour ‘cult of carbon’"}, "116": {"title": "Aris Merger and New Processing Train Strengthen Western Midstream (WES) Dividend"}, "117": {"title": "Plains All American (PAA) Flexibility Enhances with NGL Divestiture and Strong Second Quarter"}, "118": {"title": "Enterprise Products Partners (EPD) Outlook Strengthens with Executive Share Purchase and Occidental Acquisition"}, "119": {"title": "Pipeline Expansion Gains Momentum While Executive Share Sale Shapes Kinder Morgan (KMI) Outlook"}, "120": {"title": "Goldman Sachs sees Scandinavian currencies strengthening against dollar"}, "121": {"title": "Not all ETFs will fit your investing diet"}, "122": {"title": "Oil Weakens as Putin and Modi Huddle in China After US Tariff"}, "123": {"title": "Three Undiscovered Gems In The Middle East With Promising Potential"}, "124": {"title": "Middle Eastern Dividend Stocks Featuring Orascom Construction And 2 More"}, "125": {"title": "Alibaba soars but Asia markets dip"}, "126": {"title": "Oil Falls on Higher Supply Outlook"}, "127": {"title": "Oil holds in tight range as rising output offsets Russia supply disruptions"}, "128": {"title": "Wall Street Forecasts Oil in the $50s Next Year"}, "129": {"title": "Asia stocks suffer tech jitters, China plays its own game"}, "130": {"title": "Oil holds in tight range as rising output offsets Russia supply disruptions"}, "131": {"title": "Oil prices extend losses as traders downplay Russia sanction risks"}, "132": {"title": "Goldman Sachs sees Scandinavian currencies strengthening against dollar"}, "133": {"title": "Oil Steadies as Putin and Modi Huddle in China After US Tariff"}}, "news": {"1": {"title": "Stock market today: S&P 500 vaults to record high with Nvidia earnings set to provide key test", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/live/stock-market-today-sp-500-vaults-to-record-high-with-nvidia-earnings-set-to-provide-key-test-200027701.html", "date": "2025-08-27T21:17:03+00:00", "body": "US stocks edged higher on Wednesday as investors counted down to Nvidia's (NVDA) highly anticipated earnings report, seen as a pivotal test for the tech-driven summer rally.The Dow Jones Industrial Average (^DJI) rose almost 0.4%. The S&P 500 (^GSPC) climbed more than 0.2% to notch a record close. The tech-heavy Nasdaq Composite (^IXIC) gained 0.2%.The move higher came on the heels of small gains for stocks on Wall Street on Tuesday.The waiting game is on for Nvidia's quarterly results, slated to arrive after the bell. Investor hopes for the world's most valuable company are sky-high, with the AI chip giant expected to post record-high revenue and adjusted profit for the second quarter.But investors are watching for the fallout from President Trump's curbs on China chip sales, which Nvidia forecast will deliver an $8 billion hit to its quarterly bottom line. More widely, the Big Tech bellwether's earnings are a big test for the broader AI trade that has driven the bull market in stocks. Traders are pricing in a swing of roughly 6% — or about $260 billion — in Nvidia shares after its report, options showed.Read more: Live coverage of corporate earningsWhile stock markets largely shrugged off Trump's move to fire Federal Reserve governor Lisa Cook on allegations of mortgage fraud, some small signs of stress are showing in bonds. Two-year Treasury yields were up just two points after sliding to 3.65% — their lowest since May — even as 30-year yields (^TYX) stay atop 4.9%.On the trade front, the European Union is looking to fast-track the removal of tariffs on all US industrial goods, Bloomberg reported, clearing the way for an easing of duties on EU auto imports in return. Meanwhile, Trump's hefty 50% tariffs on Indian products kicked in on Wednesday, in reprisal for India's purchases of Russian oil. Crude prices oil (CL=F, BZ=F) edged higher after a 2% slide the prior session.Meanwhile, Cracker Barrel (CBRL) stock continued to rise after the company bowed to calls from Trump and the public that it should never have scrapped its old logo.Nvidia (NVDA) stock slid more than 2% in after-hours trading after the company beat on earnings but missed on data center revenue for its second quarter, revenue forecast omits H20 shipments to China.The AI giant posted adjusted earnings of $1.05 per share versus expectations of $1.01.Data center revenue was $41.1 billion, slightly below Wall Street consensus estimates of $41.23 billion, according to Bloomberg data.Additionally, the company's revenue forecast for the third quarter of $54 billion, plus or minus 2%, does not assume any H20 shipments to China. The omission underscores the uncertainty hanging over US chipmakers amid Washington's trade tensions with Beijing.The US has allowed Nvidia to send China its H20 chips, which are less powerful next-generation Blackwell technology, in exchange for a cut of the company's revenue. However, China's government has advised domestic companies to use alternative chipmakers.Nvidia stock has rallied roughly 35% year to date to lead the AI tech trade.Going into Nvidia’s (NVDA) earnings after the bell, Wall Street will be closely watching the chipmaker’s performance in one of its key markets: China.Nvidia was hit with a surprise export ban on sales of its H20 chips to China in April — a move that was set to cost the chipmaker $8 billion in lost sales in its second quarter. In yet another unexpected move, the Trump administration said in July it would grant Nvidia export licenses for its H20 chips in exchange for 15% of the revenue from those sales — an agreement likely to face legal challenges due to the US Constitution’s ban on export taxes.The reversal of the ban could help Nvidia recoup as much as $15 billion in revenue from China in the second half of the year to hit around $20 billion from the region for its 2026 fiscal year, which ends next January. That would be an uptick from its roughly $17 billion in sales from China in 2025.But analysts have moderated their optimism over any uplift from Nvidia’s sales to China headed into Wednesday’s report, with Stifel analyst Ruben Roy noting their could be “near-term speed bumps” related to Nvidia’s position in that market.That’s because Nvidia has reportedly asked its suppliers to halt production of components for its H20 chips. The news came after conflicting reports over whether China is ordering companies to stop buying Nvidia’s H20 chips. The Information reported earlier this month that China’s internet regulator, the Cyberspace Administration of China, issued a directive to tech companies to suspend their purchases of Nvidia’s chips. But the same day, a Reuters report said authorities were questioning Chinese companies over their orders of H20 chips, not ordering them to stop those purchases.More will be revealed in short order.Nvidia (NVDA) stock was steady with less than one hour of trading before the close as investors awaited the AI chip giant's highly anticipated earnings.Nvidia has been the poster child of the artificial intelligence trade. The stock has rallied roughly 35% year-to-date to lead this year's market rally.Yahoo Finance plans to interview Nvidia CEO Jensen Huang at 6:30 p.m. ET on Wednesday, following the company's earnings call.Cryptocurrencies were rallying on Wednesday, with ethereum (ETH-USD) continuing to lead the charge, rising more than 2.5%, among the major cryptocurrencies, while bitcoin (BTC-USD) and Ripple's XRP (XRP-USD) also rose.Ether, the native token of the Ethereum blockchain, has staged a stunning comeback this year, surging more than 200% from April lows compared to a 45% rise in bitcoin during the same period.Ether briefly hit a new all-time high Sunday, topping $4,900, as a dovish speech from Fed Chair Jerome Powell late last week lifted broader markets, with crypto continuing this rally into the weekend.Bitcoin, meanwhile, is still down about 10% from its mid-August all-time high north of $124,000.Read more here. Yahoo Finance's Francisco Velasquez reports:Abbott Laboratories (ABT) is bracing for the impact of higher tariffs, including a 50% US levy on its Indian imports.\"Our impact between the whole network is just under $200 million,\" CEO Robert Ford said on Yahoo Finance's Opening Bid (video above). \"But I think the key thing here, one thing that we have learned, is once tariffs come into place, whether in the United States or in another country, they do not go away.\"Ford added the healthcare company is finding ways to mitigate the tariffs, including making long-term investments in manufacturing and supply chains.Read more here. Shares of Royal Bank of Canada (RY.TO) climbed 6% on Wednesday after the bank reported strong results across all three of its business segments.RBC's diluted earnings per share of $3.75 and revenue of $16.99 billion topped Wall Street estimates.The Canadian Press reports:The bank's personal banking segment reported net income of $1.9 billion, up $352 million or 22 per cent from a year earlier. Its commercial banking division reported a net income of $836 million, up $19 million or two per cent from the same quarter last year.RBC Wealth Management reported a net income of $1.1 billion, up $147 million or 15 per cent from last year. Capital Markets profit was $1.3 billion, up $156 million or 13 per cent from last year.RBC Insurance had a net income of $247 million, up $77 million or 45 per cent from a year ago.Read more here.Thinking about visiting a Cracker Barrel (CBRL) now that you've heard so much about it? You might not be alone, Yahoo Finance's Brooke DiPalma writes.The stock was up more than 8% in afternoon trading on Wednesday.Brooke reports on Wall Street's reaction to the logo reversal:In a client note published Wednesday, Citi's Jon Tower said the \"late August hubbub\" over the brand could actually benefit the business in the near term.\"While the lasting impact on the business is unclear, this late August hubbub has drawn attention ... growing attention does not always translate into consistent visits nor solve the brand's longer-term issues around relevancy to younger consumers, but could spark curiosity and visits near-term as consumers determine what all the ballyhoo was all about,\" he wrote in a note to clients.Tower said that searches for \"Cracker Barrel\" hit a record high on Google over the past week.Read more here.IonQ (IONQ) shares jumped nearly 3% after B Riley Securities analyst Craig Ellis initiated coverage of the stock with a Buy rating.Ellis said he believes \"quantum computing will increasingly solve problems once considered classically intractable in the next five to 10 year\" and that \"IONQ could be a leader, likely accruing significant value as its capabilities mature.\"He noted that IonQ has sold quantum computers since 2021, has brought online 10 quantum computing systems, and was the first quantum computing system available on all three major cloud providers — Amazon (AMZN), Google (GOOG), and Microsoft (MSFT).IonQ stock has surged 474% over the past 12 months but has had a volatile 2025, up just 0.4% year to date, as skepticism over quantum technologies and mounting losses in its most recent quarter put pressure on shares.UnitedHealth Group shares rose 1% Wednesday, holding steady despite a Bloomberg report that the US Department of Justice's criminal probe into the insurer is wider than previously thought.Bloomberg reported that the DOJ's criminal division is investigating UnitedHealth's prescription management segment, Optum Rx, in addition to potential Medicare fraud. News of the initial investigation was first reported by the Wall Street Journal in May.Shares of UNH are still down 40% for the year amid regulatory scrutiny, a shake-up among top executives, and broader industry pressures.American Eagle (AEO) shares jumped as much as 5% after announcing a collaboration with Kansas City Chiefs star Travis Kelce, a day after the football player announced his engagement to Taylor Swift.The limited edition collaboration featuring lifestyle and sportswear is called \"AE x Tru Kolors by Travis Kelce.\" Kelce also stars in the ad campaign for the new line.Even with Wednesday's gain, American Eagle stock is down 23% in 2025 as the apparel maker has reported declines in revenue and earnings per share in its last three quarterly earnings reports.Meanwhile, shares of rival Abercrombie & Fitch (ANF) traded flat on Wednesday after the company reported earnings that topped expectations but showed a decline in net sales in its Abercrombie brand.US stocks traded mixed at the open of Wednesday's trading session as investors awaited Nvidia's (NVDA) highly anticipated earnings report after the bell.The Dow Jones Industrial Average (^DJI) inched up nearly 0.1%, while the S&P 500 (^GSPC) fell below the flat line and the tech-heavy Nasdaq Composite (^IXIC) dipped 0.15%.The mixed open comes on the heels of small gains for stocks on Wall Street on Tuesday.Bond yields continued to push higher on Wednesday following President Trump's move to oust Fed governor Lisa Cook, which was marked by a relatively tame market reaction.While short-term yields slipped lower, concerns about eroding Fed independence and tariffs pushed long-run yields higher as fears grew that the pressure on the Fed could lead to inflation running hotter over time.The 10-year yield (^TNX) moved up 3 basis points to 4.28%, while the 30-year yield (^TYX) rose 4 basis points to hold above 4.95%.The Treasury yield curve also steepened to the highest level since April. The spread between the 2-year and 10-year yield now stands at 62 basis points.Nvidia (NVDA) stock gained 0.5% in premarket trading ahead of its earnings release after the closing bell on Wednesday. The AI chipmaker will round out Big Tech earnings after a quarter of back-and-forth with the Trump administration.Yahoo Finance's Daniel Howley notes that investors will be on the lookout for continued shipment scaling of Nvidia's GB200 super chip, the ramp of its upcoming Blackwell Ultra chip, AI spending, and commentary on China sales during the company's earnings call on Wednesday.Options traders expect Nvidia's market value to swing about $260 billion after its second quarter earnings, suggesting investors feel more certain about the company's performance.Read Dan's full preview of Nvidia earnings here.Goldman Sachs expects the price of Brent (BZ=F) crude futures contracts to fall to the low $50s a barrel by late 2026, its analysts said in a note to clients.An increase in the oil surplus next year will drive the decline from current levels, Goldman said, amid reduced demand in leading economies.Oil prices steadied after Tuesday's steep drop as traders assessed the start of 50% US tariffs on Indian goods, a reprisal for its imports of Russian crude.Indian government estimates suggest global crude prices could more than triple to around $200 a barrel if the country stops buying oil from Russia, Reuters reported.Kohl's (KSS) raised its full-year profit forecast on Wednesday, in a sign that the department store chain's turnaround push is paying off.Shares surged over 15% in premarket trading as investors welcomed the retailer's earnings report, which eased worries over Kohl's warning on Tuesday that it was seeking more time to pay vendors.Kohl's has downsized its jewelry business among other moves to rein in costs, while it has also stepped up efforts to draw in shoppers during the key holiday season.Reuters reports:Kohl's expects annual earnings per share of 50 cents to 80 cents, compared with its earlier wide range of 10 cents to 60 cents.\"We were able to expand our gross margins, reduce our inventory, and lower our expenses, leading to solid second-quarter earnings,\" said interim-CEO Michael Bender.Kohl's second-quarter adjusted earnings per share of 56 cents handily beat estimates of 29 cents, according to data compiled by LSEG.For the quarter ended August 2, comparable sales fell 4.2%, smaller than estimates of a 5% decline.Economic data: MBA Mortgage Applications (week ending Aug. 22)Earnings: Nvidia (NVDA), Abercrombie & Fitch (ANF), CrowdStrike (CRWD), Five Below (FIVE), HP (HP), Kohl's (KSS), Pure Storage (PSTG), Snowflake (SNOW), The J.M. Smucker Company (SJM), Urban Outfitters (URBN), Williams-Sonoma (WSM)Here are some of the biggest stories you may have missed overnight and early this morning:Why stocks shrugged off Trump's boldest Fed move yetNvidia earnings on deck: High hopes, China risksEU eyes fast-tracking the removal of all its US tariffsCanada Goose stock pops on report of go-private bidsGoldman: Oil to fall to low $50s by late next yearCracker Barrel stock jumps as company reverts to old logoChina seeks to triple output of AI chips in race with the USKohl's stock soars after raising annual profit targetShares of Cracker Barrel (CBRL) are popping after the restaurant operator said it will revert to its old logo, after a redesign drew public backlash and a call for a rethink from President Trump.Shares of the restaurant operator rose over 5% in premarket trading on Wednesday, having closed over 6% higher the prior session.Cracker Barrel stock fell more than 14% last week after the company announced the fifth evolution of its logo to a more minimalist look, removing the image of Uncle Herschel.Read more here.It's a curious thing that the most aggressive move yet to influence the world's most important central bank resulted not in a raucous reaction in the market but a whimper, reports Yahoo Finance's Hamza Shaban.He reports in today's Morning Brief:Stocks on Tuesday barely budged. The 10-year (^TNX) meandered down a hair. And longer-dated US bond prices rose only slightly, even as concerns mounted that Trump's moves against the Federal Reserve's independence could stoke inflation and instability.The reaction was nothing like the post-\"Liberation Day\" sell-off. Back then, the bond market strong-armed the president into backing away from his most punishing tariff policies.But this time, as the president attempts to fire a Federal Reserve governor, Wall Street appears largely unbothered. What changed?Part of the answer has to do with timing. Right now, in the short term, the interests of the three main players — the Fed, the president, and the market — are all very much aligned.As economists Stephen Brown and Thomas Ryan from Capital Economics put it in a note on Tuesday, \"It remains unclear whether Trump’s letter firing Cook, posted on social media [Monday], will have any practical effect on policy setting in the near term.\" ...But even when markets tolerate a legally dubious but aligned maneuver, what happens in the longer run should the Fed see itself remade as a political entity?Read more here.Shares of MongoDB (MDB) surged over 30% in premarket trading following surprising momentum in the database software provider's subscription revenue.The company posted strong quarterly results on Tuesday, driven by accelerating revenue growth in its Atlas cloud database service and new customer acquisition.In the second quarter, overall revenue rose 24% year over year to $591.4 million. MongoDB reported a loss per share of $0.58. Both metrics surpassed Wall Street's estimates for revenue of $553 million and a loss of $0.85 per share, according to S&P Global Market Intelligence.\"Many of our recently added customers are building AI applications, underscoring how our value proposition is resonating in the AI era and why MongoDB is emerging as a key component of the AI infrastructure stack,\" MongoDB CEO Dev Ittycheria said.Here's a look at some of the top stocks trending in premarket trading:Cracker Barrel (CBRL) stock rose 6% before the bell on Wednesday after the company reverted back to its old logo due to consumer backlash and pressure from President Trump.“We thank our guests for sharing your voices and love for Cracker Barrel. We said we would listen, and we have. Our new logo is going away and our ‘old timer’ will remain,” the company said in a statement.Okta (OKTA) stock rose more than 5% premarket after beating earnings estimates for its fourth-quarter earnings and lifting its full-year revenue outlook.Snowflake (SNOW) shares rose 4% before the bell ahead of its earnings release on Wednesday. Analysts are expecting Snowflake's revenue to grow 25.4% year on year to $1.09 billion, slowing from the 28.9% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $0.27 per share.MongoDB, Inc (MDB) stock soared by 30% before the bell on Wednesday, following the software company's strong earnings release on Tuesday. The group posted strong quarterly results on Tuesday, driven by accelerating revenue growth in the company's Atlas cloud database service and new customer acquisition.", "analysis": 1}, "2": {"title": "Global energy market: India tariff impacts, Goldman's oil call", "source": "finance.yahoo", "link": "https://finance.yahoo.com/video/global-energy-market-india-tariff-183000258.html", "date": "2025-08-27T18:30:00+00:00", "body": "President Trump announced 50% tariffs on imports from India. The levies come in response to India buying Russian oil, despite the ongoing war in Ukraine. Yahoo Finance Senior Reporter Ines Ferré examines what the tariffs mean for oil prices (CL=F, BZ=F) and the global energy market, and how Goldman Sachs's recent Brent crude oil (BZ=F) price projection ties in.To watch more expert insights and analysis on the latest market action, check out more Market Catalysts.Ines, India has benefited for years when it comes to cheap Russian oil. So, given that the US has now doubled those tariffs on India, what are the implications for the global energy market?Yeah, Ali, so as you mentioned, India has been very much benefiting from purchasing Russian oil. Uh China as well. So as the war in Ukraine has continued, China and India have been big buyers of Russian oil, which the EU has placed uh sanctions on as well, uh on oil caps uh for Russian oil. So, you really have or price caps, I should say. You have the situation where President Trump is utilizing energy, oil to negotiate and imposing these secondary tariffs because he's saying if you are purchasing Russian oil, then you are essentially helping fund the war in Ukraine. So this is a way for India to stop buying Russian oil for Russia to have less funds to fund the war in Ukraine and it is also a sort of negotiating tactic that analysts see for India to come to the negotiating table as well. So, one analyst is saying that while India would come to the negotiating table with these 25% additional tariffs that are placed, he's saying that the in the near term, the crude market is sort of shrugging this off. We have seen oil going a bit higher in some of these sessions and that is because some uh oil targets, energy targets, Russian energy targets uh have been hit by uh by Ukraine. So that is why we have seen some of the volatility that we've seen with oil, but if you take a look at uh oil year to date, you are still seeing that oil is down 13% uh for WTI, Brent crude down uh more than 11% and what would really send oil prices lower is of course, if you uh also saw the uh war uh end as well. So, this is right now the market is sort of shrugging off uh these tariffs and doesn't expect the war to end anytime soon.Yeah, and Ines, we're looking at Brent crude trading at just around 66 bucks a barrel, but Goldman Sachs out with a new note this morning saying that it expects the price of Brent to decline to about $50 a barrel. That's by late 2026. So what's behind the call there?Yeah, so what they're saying is is that this is all being driven by oil surplus, that you are going to have much more oil in the market than needed, that global inventories are going to rise to, they're expecting 800 million barrels by the end of 2026. There is an upward upside risk to these prices and that is if China starts to accelerate more of their oil stockpiling, then you could see Brent actually a little bit higher than than that at $62 per barrel for the average for 2026. But if you take a look across the board at where Wall Street is expecting oil to land next year, you are seeing JP Morgan that's expecting Brent to average $58 per barrel in 2026. Then you have the EIA that is expecting $51 per barrel in 2026. OPEC Plus has been increasing its production. We see we're seeing this oil surplus and the expectation is a downward trend for oil from here from the fourth quarter of this year and into 2026. They're expecting to see lower oil prices.", "analysis": 2}, "3": {"title": "Energy & Utilities Roundup: Market Talk", "source": "finance.yahoo", "link": "https://finance.yahoo.com/m/a5e385e9-965b-3c0e-851d-9fc5f526afcf/energy-utilities-roundup-.html", "date": "2025-08-28T10:37:00+00:00", "body": "Find insight on Cnooc, QL Resources, Karoon Energy and more in the latest Market Talks covering energy and utilities.", "analysis": 1}, "4": {"title": "Exclusive-India’s Russian oil imports set to rise in September in defiance of US", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/exclusive-india-russian-oil-imports-103602322.html", "date": "2025-08-28T10:36:02+00:00", "body": "MOSCOW/LONDON (Reuters) -Russian oil exports to India are set to rise in September, traders said, as producers cut prices to sell more crude because they cannot process as much in refineries that were damaged by Ukrainian drone attacks on energy infrastructure.India has become the biggest buyer of Russian oil supplies that were displaced by Western sanctions after Moscow invaded Ukraine in 2022. This has allowed Indian refiners to benefit from cheaper crude.But the purchases have drawn condemnation from the government of U.S. President Donald Trump, which increased U.S. tariffs on Indian imports to 50% on Wednesday.New Delhi says it is relying on talks to try to resolve Trump's additional tariffs, but Prime Minister Narendra Modi has also embarked on a tour to develop diplomatic ties elsewhere, including meeting Russian President Vladimir Putin.U.S. officials have accused India of profiteering from discounted Russian oil, while Indian officials have accused the West of double standards because the European Union and the U.S. still buy Russian goods worth billions of dollars.The Indian oil ministry did not immediately respond to a request for comment on Thursday.Without India, Russia would struggle to maintain exports at existing levels, and that would cut the oil export revenues that finance the Kremlin's budget and Russia's continued war in Ukraine.Three trading sources involved in oil sales to India said Indian refiners would increase Russian oil purchases in September by 10-20% from August levels, or by 150,000-300,000 barrels per day. The sources, who cited preliminary purchases data, could not be named because they were not authorised to speak publicly on the issue.The two biggest buyers of Russian oil for India, Reliance and Nayara Energy, which is majority Russian-owned, did not immediately respond to a request for comment.Russia has more oil to export next month because planned and unplanned refinery outages have cut its capacity to process crude into fuels. Ukraine has attacked 10 Russian refineries in recent days, taking offline as much as 17% of the country's refining capacity.In the first 20 days of August, India imported 1.5 million barrels per day of Russian crude, unchanged from July but slightly below the average of 1.6 million bpd in January-June, according to data from Vortexa analysts.The volumes are equal to around 1.5% of global supply, making India the largest buyer of seaborne Russian crude, which covers some 40% of India's oil needs. China and Turkey are also big buyers of Russian oil.", "analysis": 2}, "5": {"title": "Oil Drops as US Berates India and Surplus Concerns Flare Again", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/oil-drops-even-us-raises-004638753.html", "date": "2025-08-28T09:38:00+00:00", "body": "(Bloomberg) -- Oil fell within its recent narrow band as traders continue to monitor a looming oversupply and US efforts to force India to desist from buying Russian barrels.Brent dropped below $68 a barrel, having traded between $65 and $70 for virtually all of August. White House trade adviser Peter Navarro stepped up the pressure on New Delhi to halt purchases of Russian oil after Washington doubled a levy on imports from the country to 50%. The US has singled out India over Russian crude imports as part of its efforts to end the war in Ukraine.Most Read from BloombergTo Boost Housing, Chicago Kills Parking MinimumsCentral Glasgow Could Be Poised for a RevivalChicago Schools’ Late Pension Payment Magnifies Fiscal MessNY Penn Station’s Long-Awaited Revamp to Start Work in 2027Trump Administration to Take Control of DC’s Union StationAt the same time, Ukraine has ramped up drone attacks on Russia’s oil infrastructure, hitting two more refineries after a run of recent strikes. Moscow’s crude exports slipped last week, tanker-tracking data compiled by Bloomberg showed, after Ukraine intensified its attacks.“Tariffs and sanctions related to Russia, as well as attacks on Russian oil facilities have kept oil prices resilient in the high $60s, despite the looming oversupply that should lower prices,” Citigroup analysts including Anthony Yuen said in a note.While a surplus is widely expected toward the end of the year as supplies swell from both inside and outside the OPEC+ alliance, its impact on the market remains uncertain. Bank of America Corp. said on Wednesday that the availability of about a billion barrels of spare tank space means it’s possible that the extra supplies could be absorbed fairly comfortably.Against that backdrop, there’s been some weakness in the Brent market over recent days, after a run of cargo offers in the key North Sea pricing window. Vital swaps contracts are at the weakest level since May and the global benchmark is at the softest since March relative to the Middle Eastern Dubai marker.--With assistance from Jake Lloyd-Smith.Most Read from Bloomberg BusinessweekAs Bushmeat Consumption Grows, Nigerian Doctors Fear OutbreaksMonchhichi Makes a Comeback Amid Labubu CrazeYoung European Backpackers Are Being Lured to Australia for Mining JobsHow Bombas Built a Fancy Socks Empire With $500 Million in SalesYosemite Workers Vote to Unionize©2025 Bloomberg L.P.", "analysis": 2}, "6": {"title": "Middle Eastern Penny Stocks To Watch In August 2025", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/middle-eastern-penny-stocks-watch-090650667.html", "date": "2025-08-28T09:06:50+00:00", "body": "The Middle Eastern stock markets have recently shown mixed performance, with Gulf bourses reacting to global economic developments such as concerns over U.S. Federal Reserve independence and fluctuating oil prices. In this context, penny stocks—though a somewhat outdated term—remain an intriguing investment area for those interested in smaller or newer companies that may offer growth opportunities. By focusing on penny stocks with strong financial health, investors can potentially uncover valuable opportunities amidst the current market dynamics.NameShare PriceMarket CapFinancial Health RatingMaharah for Human Resources (SASE:1831)SAR4.84SAR2.18B★★★★☆☆Thob Al Aseel (SASE:4012)SAR3.80SAR1.52B★★★★★★E7 Group PJSC (ADX:E7)AED1.54AED3.06B★★★★★★Al Wathba National Insurance Company PJSC (ADX:AWNIC)AED3.30AED683.1M★★★★★★Dubai National Insurance & Reinsurance (P.S.C.) (DFM:DNIR)AED2.97AED392.7M★★★★★★Dubai Investments PJSC (DFM:DIC)AED2.88AED12.25B★★★★☆☆Al Dhafra Insurance Company P.S.C (ADX:DHAFRA)AED4.86AED486M★★★★★★Union Properties (DFM:UPP)AED0.866AED3.72B★★★★★☆Sharjah Cement and Industrial Development (PJSC) (ADX:SCIDC)AED0.87AED529.18M★★★★★★Tgi Infrastructures (TASE:TGI)₪2.891₪214.92M★★★★★★Click here to see the full list of 78 stocks from our Middle Eastern Penny Stocks screener.Underneath we present a selection of stocks filtered out by our screen.Simply Wall St Financial Health Rating: ★★★★☆☆Overview: Commercial Bank International P.S.C., along with its subsidiaries, offers a range of banking products and services to individuals and businesses in the United Arab Emirates and internationally, with a market cap of AED1.74 billion.Operations: The company's revenue is primarily derived from its Real Estate segment at AED264.95 million, followed by Wholesale Banking at AED229.94 million, Treasury at AED54.20 million, and Retail Banking at AED54.02 million.Market Cap: AED1.74BCommercial Bank International P.S.C. has shown steady earnings growth, with a five-year average of 34.2% annually, though recent growth at 13.1% lags behind the banking industry. The bank's net interest income for the second quarter increased to AED94.53 million from AED86.5 million year-over-year, but net income slightly decreased to AED42.6 million from AED44.55 million due to lower profit margins and a high level of bad loans at 15.7%. Despite this, CBI maintains an appropriate Loans to Deposits ratio of 84%, supported by primarily low-risk funding sources like customer deposits, indicating financial stability amidst share price volatility.", "analysis": 1}, "7": {"title": "U.S. stock futures edged higher; second-quarter GDP, Nvidia earnings in focus", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-dip-as-nvidia-earnings-spark-little-cheer-4213662", "date": "2025-08-28T12:47:14+00:00", "body": "Investing.com-- U.S. stock index futures edged higher Thursday, with investors digesting new U.S. growth data as well as results from artificial intelligence major Nvidia  (NASDAQ:NVDA). At 08:45 ET (12:45 GMT), Dow Jones Futures rose 85 points, or 0.2% and S&P 500 Futures gained 7 points, or 0.1%, and Nasdaq 100 Futures climbed 20 points, or 0.1%. The major indices enjoyed a winning session Wednesday, with the broad-based S&P 500 hitting a record close.They are on pace to record monthly gains, as the S&P 500 and the NASDAQ Composite are each up more than 2%, while the 30-stock Dow Jones Industrial Average is up more than 3% in the period.Nvidia reported a beat to analysts’ quarterly estimates late Wednesday and the chip designer and AI bellwether forecasted third-quarter revenue that was higher than Wall Street estimates. However, a miss on data centre revenue and questions over China forecasts caused investors to question the company’s elevated valuation, resulting in its shares sliding in after-hours trading.Notably, Nvidia said there were no sales of H20 chips to China during the quarter, nor did the company assume any shipments in its guidance. Chip stocks came under a bit of pressure in sympathy, with AMD (NASDAQ:AMD), TSMC (NYSE:TSM) and Broadcom (NASDAQ:AVGO) all retreating.Among other tech movers, cybersecurity firm CrowdStrike Holdings (NASDAQ:CRWD) fell premarket as its current quarter guidance missed expectations, while data cloud company Snowflake (NYSE:SNOW) soared after it hiked its annual product revenue guidance.  U.S. stocks had rallied on a mostly positive second-quarter earnings season and increasing bets on a September interest rate cut by the Federal Reserve.But this rally was seen cooling through late-August, amid emerging doubts over the Fed’s plans, as well as a sharp drop in technology shares.That said, expectations of a Fed interest rate cut in September rose after Fed Governor John Williams said in an interview with CNBC on Wednesday that \"every meeting is, from my perspective, live.\"\"Risks are more in balance,\" he said. \"We are going to just have to see how the data play out.\"Data released earlier Thursday showed that the U.S. economy expanded by more than initially reported in the second quarter, with gross domestic product growing by 3.3% during the April to June period, according to the second estimate from the Commerce Department’s Bureau of Economic Analysis.The initial estimate had suggested that the U.S. economy grew by 3.0% in the first quarter, after contracting by 0.5% in the first quarter.The focus will also be on the PCE price index on Friday - the Fed’s preferred inflation measure - and the monthly payrolls report a week later.Oil prices fell on expectations for lower U.S. fuel demand as the summer driving season draws near, even after a sharp drop in U.S. crude inventories.At 08:45 ET, Brent futures slipped 0.3% to $67.22 a barrel, and U.S. West Texas Intermediate crude futures fell 0.3% to $63.94 a barrel.Both contracts climbed in the prior session after the Energy Information Administration reported that U.S. crude inventories fell by 2.4 million barrels in the week ended August 22, a larger draw than the 1.9 million barrels forecast by analysts.The drop signaled strong demand ahead of the upcoming U.S. Labor Day long weekend. However, this typically marks the unofficial end of the summer driving season and the onset of lower U.S. demand.Ambar Warrick contributed to this article   Futures retreated after a mildly positive session on Wall Street, where the S&P 500 hit a record high on some gains in technology shares.But tech stocks drifted lower in aftermarket trade, led chiefly by NVIDIA Corporation (NASDAQ:NVDA) as the chipmaker’s data center revenue missed expectations amid heightened uncertainty over China. Most investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.      But that doesn't mean you can't use smart shortcuts. If you're considering NVDA, try chatting with WarrenAI, our powerful AI financial assistant.    It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.      Even if you end up going with your gut feeling, at least you'll know why.", "analysis": 2}, "8": {"title": "Oil falls as end of driving season looms, Druzhba restarts", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-slips-as-market-weighs-end-of-us-summer-driving-and-india-supply-dilemma-4213674", "date": "2025-08-28T12:12:48+00:00", "body": "By Alex LawlerLONDON (Reuters) -Oil fell on Thursday after rising in the previous session, pressured by expectations of lower U.S. fuel demand at the end of the summer travel season and by the restart of Russian supply to Hungary and Slovakia through the Druzhba pipeline.Crude had risen on Wednesday after official data showed U.S. crude inventories fell by 2.4 million barrels in the week ended August 22, compared with analysts’ expectations in a Reuters poll for a 1.9-million-barrel draw, a sign of strong demand.However, oil market participants see the upcoming U.S. Labor Day long weekend as the unofficial end of the summer driving season, and the onset of lower U.S. demand for gasoline.Brent crude futures dropped 8 cents, or 0.1%, to $67.97 at 1156 GMT, and West Texas Intermediate (WTI) crude futures was down 4 cents at $64.11.\"This weekend’s U.S. bank holiday marks the end of the driving season and gasoline has hardly been the panacea hoped for in terms of demand,\" said John Evans of oil broker PVM.\"Any short-term reasons to be friendly towards oil prices are diminishing,\" he added, citing the Druzhba resumption.Russian crude supplies to Hungary and Slovakia through the Druzhba pipeline have restarted after an outage caused by a Ukrainian attack in Russia last week, Hungarian oil company MOL and Slovakia’s economy minister said on Thursday.Traders are also watching out for how New Delhi responds to pressure from Washington to stop buying Russian oil, after U.S. President Donald Trump doubled tariffs on imports from India to as much as 50% on Wednesday.\"India is expected to continue purchasing crude oil from Russia at least in the short term, which should limit the impact of the new tariffs on global supply,\" IG market analyst Tony Sycamore said.Lending some support to prices, Russia and Ukraine have stepped up attacks on each other’s energy infrastructure.Russia launched a massive drone attack on energy and gas transport infrastructure across six Ukrainian regions overnight, leaving more than 100,000 people without power, Ukrainian officials said on Wednesday.The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 2}, "9": {"title": "TSX seen lower; bank stocks, Nvidia in spotlight", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/tsx-seen-lower-bank-stocks-nvidia-in-spotlight-4214574", "date": "2025-08-28T11:59:15+00:00", "body": "Investing.com - Canada’s main stock exchange futures edged marginally lower Thursday, slipping back from record highs with bank earnings in the spotlight. Toronto Stock Exchange’s S&P/TSX composite index closed Wednesday 0.3%, or 93 points, higher at 28,433.00, at a record closing high, and the S&P/TSX 60 index standard futures contract fell slightly Thursday. Toronto Dominion Bank  (NYSE:TD) and Canadian Imperial Bank Of Commerce (NYSE:CM) became the latest domestic lenders on Thursday to report a rise in third-quarter profit. Royal Bank of Canada  (BMV:RYN), Canada’s largest bank, released blockbuster earnings on Wednesday, and earlier this week, the country’s fourth- and fifth-biggest lenders, Bank of Montreal (NYSE:BMO) and  Bank of Nova Scotia  (NYSE:BNS), also posted upbeat quarterly earnings.On Wall Street, the spotlight will be on Nvidia (NASDAQ:NVDA) after the chip designer and AI bellwether forecasted third-quarter revenue that was higher than Wall Street estimates. However, a miss on data centre revenue and questions over China forecasts caused investors to question the company’s elevated valuation, resulting in its shares sliding in after-hours trading.Additionally, the economic data calendar includes the release of weekly jobless claims as well as quarterly gross domestic product, ahead of the PCE price index on Friday - the Fed’s preferred inflation measure - and the monthly payrolls report a week later.Oil prices fell on expectations for lower U.S. fuel demand as the summer driving season draws near, even after a sharp drop in U.S. crude inventories.At 07:55 ET, Brent futures slipped 0.1% to $67.36 a barrel, and U.S. West Texas Intermediate crude futures fell 0.1% to $64.08 a barrel.Both contracts climbed in the prior session after the Energy Information Administration reported that U.S. crude inventories fell by 2.4 million barrels in the week ended August 22, a larger draw than the 1.9 million barrels forecast by analysts.The drop signaled strong demand ahead of the upcoming U.S. Labor Day long weekend. However, this typically marks the unofficial end of the summer driving season and the onset of lower U.S. demand.Gold prices steadied near a two-week high, underpinned by bets on a September interest rate cut by the Federal Reserve. Spot prices rose back above $3,400 an ounce, with heightened uncertainty over the Fed’s independence was a major driver of gold this week, after Trump attempted to fire Governor Lisa Cook. Spot gold gained 0.2% to $3,405.70/oz, while gold futures for October rose 0.4% to $3,463.50/oz.   With NVDA making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging.   InvestingPro's advanced AI algorithms have analyzed NVDA alongside thousands of other stocks to uncover hidden gems.   These undervalued stocks, potentially including NVDA, could offer substantial returns as the market corrects. In 2025 alone, our AI identified several undervalued stocks that later surged by 50 or more.      Is NVDA poised for similar growth? Don't miss the opportunity to find out.", "analysis": 1}, "10": {"title": "Exclusive-India’s Russian oil imports set to rise in September in defiance of US", "source": "investing", "link": "https://www.investing.com/news/commodities-news/exclusiveindias-russian-oil-imports-set-to-rise-in-september-in-defiance-of-us-4214347", "date": "2025-08-28T11:00:55+00:00", "body": "MOSCOW/LONDON (Reuters) -Russian oil exports to India are set to rise in September, traders said, as producers cut prices to sell more crude because they cannot process as much in refineries that were damaged by Ukrainian drone attacks on energy infrastructure.India has become the biggest buyer of Russian oil supplies that were displaced by Western sanctions after Moscow invaded Ukraine in 2022. This has allowed Indian refiners to benefit from cheaper crude. But the purchases have drawn condemnation from the government of U.S. President Donald Trump, which increased U.S. tariffs on Indian imports to 50% on Wednesday. New Delhi says it is relying on talks to try to resolve Trump’s additional tariffs, but Prime Minister Narendra Modi has also embarked on a tour to develop diplomatic ties elsewhere, including meeting Russian President Vladimir Putin.  U.S. officials have accused India of profiteering from discounted Russian oil, while Indian officials have accused the West of double standards because the European Union and the U.S. still buy Russian goods worth billions of dollars.The Indian oil ministry did not immediately respond to a request for comment on Thursday.Without India, Russia would struggle to maintain exports at existing levels, and that would cut the oil export revenues that finance the Kremlin’s budget and Russia’s continued war in Ukraine.Three trading sources involved in oil sales to India said Indian refiners would increase Russian oil purchases in September by 10-20% from August levels, or by 150,000-300,000 barrels per day. The sources, who cited preliminary purchases data, could not be named because they were not authorised to speak publicly on the issue.The two biggest buyers of Russian oil for India, Reliance and Nayara Energy, which is majority Russian-owned, did not immediately respond to a request for comment.Russia has more oil to export next month because planned and unplanned refinery outages have cut its capacity to process crude into fuels. Ukraine has attacked 10 Russian refineries in recent days, taking offline as much as 17% of the country’s refining capacity.In the first 20 days of August, India imported 1.5 million barrels per day of Russian crude, unchanged from July but slightly below the average of 1.6 million bpd in January-June, according to data from Vortexa analysts.The volumes are equal to around 1.5% of global supply, making India the largest buyer of seaborne Russian crude, which covers some 40% of India’s oil needs. China and Turkey are also big buyers of Russian oil.INDIA SET TO CARRY ON BUYING?India’s increased buying of Russian oil over recent years has been to the detriment of more expensive supplies from the Organization of the Petroleum Exporting Countries. OPEC’s share edged up in 2024 after an eight-year drop.Russian exporters sold Urals crude loading in September at discounts of $2–$3 per barrel to benchmark dated Brent, the three traders said.The levels are cheaper than discounts of $1.50 per barrel in August, which were the narrowest since 2022, the traders said.\"Unless India issues a clear policy directive or trade economics shift significantly, Russian crude will likely remain a core part of its supply mix,\" said Sumit Ritolia from Kpler.Brokerage CLSA in a note also predicted only \"a limited chance of India stopping Russian imports\" unless a global ban is imposed.It also said that if Indian imports of Russian crude were halted, the knock-on impact could be to reduce global supplies by around one million bpd and lead to a short-term spike in global prices to nearly $100 a barrel.Traders said the full impact of sanctions and tariffs may only be visible in cargoes arriving to India in October, which will begin to trade in the next few days.In addition to the U.S. tariffs, the European Union has also tightened its price cap designed to limit Russia’s oil revenues, which will complicate sales later this year.The EU has set the cap at $47.60 per barrel from September 2 - 15% below the Russian crude market price - restricting access to Western services for cargoes sold above the cap.With RELI making headlines, savvy investors are asking: Is it truly valued fairly? In a market full of overpriced darlings, identifying true value can be challenging.   InvestingPro's advanced AI algorithms have analyzed RELI alongside thousands of other stocks to uncover hidden gems.   These undervalued stocks, potentially including RELI, could offer substantial returns as the market corrects. In 2025 alone, our AI identified several undervalued stocks that later surged by 50 or more.      Is RELI poised for similar growth? Don't miss the opportunity to find out.", "analysis": 2}, "11": {"title": "Nvidia’s results, Tesla’s European sales, Japan trade - what’s moving markets", "source": "investing", "link": "https://www.investing.com/news/economy-news/nvidias-results-teslas-european-sales-japan-trade--whats-moving-markets-4213918", "date": "2025-08-28T07:09:27+00:00", "body": "Investing.com - U.S. stock futures traded in a mixed fashion Thursday, with Nvidia’s results weighing on the tech sector. Tesla’s sales in Europe continued to slump in July, while doubts have emerged about the trade deal between Japan and the U.S. after Tokyo’s main negotiator cancels a trip to Washington.Nvidia (NASDAQ:NVDA) delivered strong quarterly results after the market close Wednesday, with the chip designer and AI bellwether reporting a beat to analysts’ estimates and forecasting third-quarter revenue that was higher than Wall Street estimates. However, a miss on data centre revenue and questions over China forecasts caused investors to question the company’s elevated valuation, resulting in its shares sliding in after-hours trading.The stock dip removed around $110 billion from Nvidia’s $4.4 trillion market capitalization. Nvidia’s second-quarter earnings – $1.04 per share– beat expectations of $1.01, as did revenue, at $46.7 billion, while it forecast current quarter revenue of $54 billion, plus or minus 2%, which is higher than expectations of $52.76 billion.But Nvidia’s data center revenue, which is by far its biggest breadwinner, came in at $41.1 billion, missing estimates of $41.34 billion. The miss largely stemmed from Nvidia selling no H20 chips in China during the quarter.CEO Jensen Huang expects permission to restart selling Nvidia’s chips to China after striking a deal with U.S. President Donald Trump to pay commissions to the U.S. government. But with no formal U.S. rules in place and questions about whether Chinese regulators will discourage purchases of Nvidia chips, the AI market bellwether excluded potential China sales from the forecast for the current quarter.Nvidia CFO Colette Kress said the company will ship between $2 billion and $5 billion in H20 revenue in the current quarter, if geopolitical issues were to subside. But the outlook on China still remained highly uncertain. U.S. stock futures traded in a mixed fashion Thursday, with the tech-heavy Nasdaq underperforming after the release of results from AI darling Nvidia. At 02:55 ET (06:55 GMT), the S&P 500 futures traded 2 points, or 0.1%, higher and Dow futures rose 127 points, or 0.3%, while Nasdaq 100 futures dropped 17 points, or 0.1%.The major indices enjoyed a winning session Wednesday, with the broad-based S&P 500 hitting a record close. They are on pace to record monthly gains, as the S&P 500 and the NASDAQ Composite are each up more than 2%, while the 30-stock Dow Jones Industrial Average is up more than 3% in the period.Aside from Nvidia’s results, investors will also digest numbers from the likes of Snowflake (NYSE:SNOW) and NetApp (NASDAQ:NTAP), while the economic data calendar includes the release of weekly initial jobless claims and gross domestic product growth for the second quarter.Tesla’s (NASDAQ:TSLA) sales and market share in Europe fell sharply in July, data from the European Automobile Manufacturers’ Association showed on Thursday, even as broader electric vehicle sales in the region continued to increase.Tesla’s sales lagged those of Chinese rival BYD, which was included in the monthly sales data for the first time. The latter also seized a greater market share than Tesla. Tesla’s total new car registrations in the European Union, the Europe Free Trade Association, and in the U.K., slid just over 40% year-on-year, ACEA data showed. The ACEA is a group of 15 European automakers that acts as the main lobbying and standards group for the bloc’s automobile industry. Tesla’s market share in the region shrank further to 0.8% from 1.4% year-on-year, while its January-July sales declined by 33.6% from the same period last year. The drop came even as total battery EV sales in Europe surged 33.6% in July. The sector now represents about 15.6% of the European car market, behind the 28.3% share held by petrol vehicles and 34.7% share held by hybrid EVs. Tesla’s updated Model Y, released earlier this year, has made little impact on its sales, while rival offerings from European automakers, who have jumped on the EV bandwagon in recent years, also provided increased competition. Tesla’s brand image has taken a hit in Europe, hurt by CEO Elon Musk’s endorsement of U.S. President Donald Trump, as well as his associations with a German far right party. Japan’s top trade negotiator, Ryosei Akazawa, has cancelled a visit to the United States at the last minute, delaying talks designed to finalise a $550 billion investment package offered by Tokyo in exchange for relief on punishing tariffs.\"It was found that there are points that need to be discussed at the administrative level during coordination with the American side. Therefore, the trip has been cancelled,\" Japan’s government spokesperson Yoshimasa Hayashi told reporters on Thursday.Washington and Tokyo agreed in July to set a reduced 15% tariff on imports from Japan in exchange for the package of U.S.-bound investment through government-backed loans and guarantees, but details of its contents remain unclear.While Trump has touted the package as \"our money to invest\" and said the U.S. would retain 90% of the profits earned, Japanese officials have stressed that the investments will be determined based on whether they will also benefit Japan.Oil prices fell on expectations for lower U.S. fuel demand as the summer driving season draws near, even after a sharp drop in U.S. crude inventories.At 02:55 ET, Brent futures slipped 0.5% to $66.91 a barrel, and U.S. West Texas Intermediate crude futures fell 0.9% to $63.59 a barrel.Both contracts climbed in the prior session after the Energy Information Administration reported that U.S. crude inventories fell by 2.4 million barrels in the week ended August 22, a larger draw than the 1.9 million barrels forecast by analysts.The drop signaled strong demand ahead of the upcoming U.S. Labor Day long weekend. However, this typically marks the unofficial end of the summer driving season and the onset of lower U.S. demand.(Reuters contributed reporting.) The fastest way to find out is with our Fair Value calculator. We use a mix of 17 proven industry valuation models for maximum accuracy.    Get the bottom line for NTAP plus thousands of other stocks and find your next hidden gem with massive upside.", "analysis": 1}, "12": {"title": "Oil prices slip as traders assess India tariff impact, US inventory draw", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-prices-slip-as-traders-assess-india-tariff-impact-us-inventory-draw-4213676", "date": "2025-08-28T01:41:55+00:00", "body": "Investing.com-- Oil prices fell in Asian trading on Thursday after U.S. data showed a slightly sharper-than-expected drop in crude inventories, while investors weighed the impact of additional U.S. tariffs against India, which came into effect a day earlier.As of 21:34 ET (01:34 GMT), Brent Oil Futures expiring in October fell 0.5% to $67.71 per barrel, while West Texas Intermediate (WTI) crude futures declined 0.6% to $63.80 per barrel.U.S. crude oil inventories fell by 2.4 million barrels in the week to Aug. 22, a larger draw than the 1.9 million barrels forecast by analysts, according to data from the Energy Information Administration.Gasoline inventories declined by 1.2 million barrels, and distillate stocks dropped by 1.8 million barrels, while implied gasoline demand rose to 9.24 million barrels per day from 8.84 million bpd a week earlier, pointing to solid seasonal consumption. The figures indicated strong end-of-summer driving activity but also raised concerns that, once the seasonal peak passes, demand could weaken, leaving refiners with slimmer margins and the crude market vulnerable to softer consumption. While tighter inventories would normally support prices, oil futures eased as investors weighed the risk that the end of the summer travel season could cap demand going forward, tempering the bullish impact of the stock draw.In a move tied to India’s aggression in buying Russian crude, an additional 25% U.S. tariff on Indian imports took effect on Wednesday, doubling the total duty to 50% starting August 27. This step is part of broader pressure aimed at curbing India’s ties with Russia amid the Ukraine war.Indian refiners briefly paused Russian oil purchases after secondary tariffs were imposed, but have since resumed buying, with the measures proving insufficient to curb flows.Analysts believe the market will be cautiously watching Russian oil flows to India closely going forward to gauge the impact.The conflict in Ukraine also remains one of the main drivers of market sentiment. U.S. President Donald Trump has sought to position himself as a mediator, but last week warned he would impose fresh sanctions on Moscow if no progress was made toward a peace deal within two weeks.AI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.      Year to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).      Which stock will be the next to soar?", "analysis": 2}, "13": {"title": "S&P 500 posts record close, dollar edges up; Nvidia shares down after the bell", "source": "investing", "link": "https://www.investing.com/news/economy-news/asia-stocks-steady-ahead-of-nvidia-investors-wary-over-fed-independence-4211826", "date": "2025-08-27T21:48:45+00:00", "body": "By Caroline ValetkevitchNEW YORK (Reuters) -Major stock indexes rose and the S&P 500 posted a record closing high on Wednesday ahead of quarterly results from artificial intelligence leader Nvidia, while the dollar recovered slightly from the previous session’s drop despite ongoing concerns about the U.S. Federal Reserve’s independence.A lawyer for Fed Governor Lisa Cook said she would file a lawsuit against U.S. President Donald Trump after he said he would fire her. Trump’s statement left some investors worried about the independence of the U.S. central bank.Interest-rate sensitive two-year U.S. Treasury yields fell to an almost four-month low and the yield curve steepened as traders weighed the chance that Trump may be able to make more dovish appointments to the Fed.Even so, the dollar traded flat to slightly higher after it dropped in the previous session. The dollar index was last up 0.02% at 98.227, while the euro touched its weakest level since August 6 and was last down 0.09% at $1.1631The three major U.S. stock indexes ended higher.After the closing bell, Nvidia’s shares were down about 3% even as the company forecast third-quarter revenue above Wall Street estimates.This year, strong gains for a number of technology-related stocks exposed to AI have helped power major equity indexes to record highs and the results were seen as a test of the AI optimism that has propelled markets.“My takeaway is that these (Nvidia) numbers are not unexpected, nor is this reaction,\" said Nick Frasse, product manager at Vaneck Associates in New York.\"The market has begun to factor in that Nvidia can continue to beat most expectations in spite of headwinds and questions like what they will have to pay to continue selling to China,\" he added.The company recently agreed to pay the U.S. federal government 15% of the sales it made in China in exchange for undefined export licenses.Technology shares, including several AI leaders, have wobbled this month with investors pointing to some signs of caution emerging in the sector.The Dow Jones Industrial Average rose 147.16 points, or 0.32%, to 45,565.23, the S&P 500 added 15.46 points, or 0.24%, to 6,481.40 and the Nasdaq Composite gained 45.87 points, or 0.21%, to 21,590.14.European stocks rebounded slightly from the previous day’s decline, with investors monitoring political risks in France. Concerns over a potential collapse of French Prime Minister Francois Bayrou’s government next month sparked a selloff of French assets on Tuesday.MSCI’s gauge of stocks across the globe gained 0.32 points, or 0.03%, to 953.04. The pan-European STOXX 600 index rose 0.1%.Market watchers interpreted Fed Chair Jerome Powell’s comments at the Fed’s annual Jackson Hole symposium last week as indicating interest rate cuts could be on the way. Fed funds futures traders are pricing in 84% odds of a cut in September, according to the CME Group’s FedWatch Tool.But the outlook for U.S. interest rates will still likely depend on labor market strength and inflation trends. The two-year note yield was last at 3.625%, down around 5 basis points on the day. The benchmark 10-year note yield fell to 4.236%, the lowest since August 14.The yield curve between two-year and 10-year notes was last at 61.3 basis points after reaching 63.5 basis points, the steepest since April 22.Oil gained on a larger-than-expected drop in U.S. crude inventories. U.S. crude futures rose 90 cents to settle at $64.15 a barrel and Brent futures gained 83 cents to settle at $68.05.Spot gold rose 0.12% to $3,396.34 an ounce.Most investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.      But that doesn't mean you can't use smart shortcuts. If you're considering NVDA, try chatting with WarrenAI, our powerful AI financial assistant.    It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.      Even if you end up going with your gut feeling, at least you'll know why.", "analysis": 1}, "14": {"title": "Oil edges up on US crude stocks drop, impact of US tariffs on India", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-prices-little-changed-as-market-awaits-impact-of-us-tariffs-on-india-4211816", "date": "2025-08-27T19:24:28+00:00", "body": "By Arathy SomasekharHOUSTON (Reuters) -Oil prices settled higher on Wednesday after data showed a larger-than-expected drop in U.S. crude inventories and as investors weighed the potential impact from new U.S. tariffs on India. Brent crude futures were up 83 cents, or 1.2%, at $68.05 a barrel. West Texas Intermediate crude futures gained 90 cents, or 1.4%, to $64.15. Both contracts fell by more than 2% on Tuesday.U.S. crude inventories dropped by 2.4 million barrels to 418.3 million barrels last week, the Energy Information Administration said, compared with analysts’ expectations in a Reuters poll for a 1.9-million-barrel draw.U.S. gasoline stocks fell by 1.2 million barrels compared with expectations for a 2.2 million-barrel draw. Distillate stockpiles, which include diesel and heating oil, fell by 1.8 million barrels versus expectations for an 885,000-barrel rise, the EIA data showed.\"The gasoline demand number is supportive and shows people are getting ready to travel over the Labor Day weekend. This is the crescendo of the summer driving season, also the last big hurrah for the summertime gasoline blend,\" said Phil Flynn, senior analyst with Price Futures Group.U.S. President Donald Trump’s doubling of tariffs on imports from India to as much as 50% was also in focus. The tariffs in response to India’s purchases of Russian oil took effect on Wednesday.There was no sign of supply disruption so far, but uncertainty over whether the U.S. will target the oil flows is deterring some traders from taking new positions, said UBS analyst Giovanni Staunovo.While the immediate impact of U.S. tariffs on Indian exports appears limited, the ripple effects on the economy pose challenges that must be addressed, India’s Finance Ministry said in its July monthly economic review, released on Wednesday.Russia and Ukraine have also stepped up attacks on each other’s energy infrastructure, worrying traders about supply disruptions.Russia launched a massive drone attack on energy and gas transport infrastructure across six Ukrainian regions overnight, Ukrainian officials said on Wednesday. Ukraine struck Russian oil refineries and exporting infrastructure in recent days.U.S. special envoy Steve Witkoff said on Tuesday he will meet Ukrainian representatives in New York this week and that Washington is also in talks with Russia in an effort to end the war.Russia has made an upward revision to its crude oil export plan from western ports by 200,000 barrels per day in August from the initial schedule after attacks on its refineries last week, three people close to the matter said on Tuesday.New York Federal Reserve Bank President John Williams said on Wednesday that interest rates will likely fall at some point but policymakers will need to see what upcoming data indicate about the economy before deciding whether it is appropriate to make a cut at the September 16-17 meeting.Lower interest rates can reduce consumer borrowing costs and boost economic growth and demand for oil.AI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.      Year to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).      Which stock will be the next to soar?", "analysis": 2}, "15": {"title": "Crude Inventory Fell 2.4 Million Barrels Last Week - EIA Data", "source": "investing", "link": "https://www.investing.com/news/assorted/crude-inventory-fell-24-million-barrels-last-week--eia-data-432SI-4212996", "date": "2025-08-27T14:31:08+00:00", "body": "Summary of Weekly Petroleum Data for the week ending August 22, 2025U.S. crude oil refinery inputs averaged 16.9 million barrels per day during the week ending August 22, 2025, which was 328 thousand barrels per day less than the previous week’s average. Refineries operated at 94.6% of their operable capacity last week. Gasoline production increased last week, averaging 10 million barrels per day. Distillate fuel production decreased by 112 thousand barrels per day last week, averaging 5.2 million barrels per day.U.S. crude oil imports averaged 6.2 million barrels per day last week, decreased by 263 thousand barrels per day from the previous week. Over the past four weeks, crude oil imports averaged about 6.4 million barrels per day, 0.4% less than the same four-week period last year. Total motor gasoline imports (including both finished gasoline and gasoline blending components) last week averaged 767 thousand barrels per day, and distillate fuel imports averaged 141 thousand barrels per day.U.S. commercial crude oil inventories (excluding those in the Strategic Petroleum Reserve) decreased by 2.4 million barrels from the previous week. At 418.3 million barrels, U.S. crude oil inventories are about 6% below the five year average for this time of year. Total motor gasoline inventories decreased by 1.2 million barrels from last week and are at the five year average for this time of year. Finished gasoline inventories increased and blending components inventories decreased last week. Distillate fuel inventories decreased by 1.8 million barrels last week and are about 15% below the five year average for this time of year. Propane/propylene inventories increased by 1.7 million barrels from last week and are 13% above the five year average for this time of year. Total commercial petroleum inventories decreased by 4.4 million barrels last week.Total products supplied over the last four-week period averaged 21.2 million barrels a day, up by 2.5% from the same period last year. Over the past four weeks, motor gasoline product supplied averaged 9 million barrels a day, down by 1.1% from the same period last year. Distillate fuel product supplied averaged 3.9 million barrels a day over the past four weeks, up by 7.7% from the same period last year. Jet fuel product supplied was up 1.7% compared with the same fourweek period last year.AI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.      Year to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).      Which stock will be the next to soar?", "analysis": 2}, "16": {"title": "Tenaris stock rating reiterated at Outperform by Bernstein SocGen", "source": "investing", "link": "https://www.investing.com/news/analyst-ratings/tenaris-stock-rating-reiterated-at-outperform-by-bernstein-socgen-93CH-4212862", "date": "2025-08-27T13:22:11+00:00", "body": "Investing.com - Bernstein SocGen Group has reiterated an Outperform rating on Tenaris S.A. (NYSE:TS) with a price target of $49.00, citing improved macroeconomic visibility for 2026. The target represents a significant upside from the current price of $36.11, with InvestingPro data showing the stock trading at an attractive P/E ratio of 9.8x and offering a robust 6.2% dividend yield.The research firm noted a shift in tone from Tenaris’s management, observing that the company’s second-quarter 2025 conference call on July 30 conveyed more optimism compared to the cautious stance during first-quarter discussions.Bernstein SocGen highlighted several potential positive catalysts for 2026, including PEMEX securing financing and launching a restructuring process, which suggests drilling activity could gradually recover next year.The firm also pointed to International Energy Agency expectations that Vaca Muerta production could increase by 60,000 barrels in 2026 from approximately 470,000 barrels in 2025, indicating a recovery in fracking activity.Tenaris now anticipates a firm pick-up in offshore activity in 2026, supported by potential offshore Final Investment Decisions in West Africa, East Mediterranean, Latin America, and Asia, according to the research note.In other recent news, Piper Sandler has taken a cautious stance on the Oilfield Services sector, highlighting TechnipFMC as a top pick among its peers. The firm identified TechnipFMC, Tenaris, and Baker Hughes as stocks expected to outperform, despite recent challenges in the oil markets. This analysis comes amid a downturn in oil prices, which has resulted in downward earnings revisions across the industry. The decline in oil prices is partly attributed to increased production by OPEC+ and other macroeconomic factors. Piper Sandler’s outlook is based on their oil price shock playbook, which has been employed to navigate recent market volatility. The firm notes that TechnipFMC has emerged as a relative outperformer, experiencing a smaller decline compared to its peers. The cautious approach reflects the broader challenges faced by the Oilfield Services sector in the current economic climate.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.ProPicks AI evaluates TENR alongside thousands of other companies every month using 100+ financial metrics.      Using powerful AI to generate exciting stock ideas, it looks beyond popularity to assess fundamentals, momentum, and valuation. The AI has no bias—it simply identifies which stocks offer the best risk-reward based on current data with notable past winners that include Super Micro Computer (+185%) and AppLovin (+157%).      Want to know if TENR is currently featured in any ProPicks AI strategies, or if there are better opportunities in the same space?", "analysis": 1}, "17": {"title": "Crude Prices Settle Higher as Supplies Tighten", "source": "barchart", "link": "https://www.barchart.com/story/news/34430711/crude-prices-settle-higher-as-supplies-tighten", "date": "2025-08-27T14:21:00+00:00", "body": "October WTI crude oil (CLV25) on Wednesday closed up +0.90 (+1.42%), and October RBOB gasoline (RBV25) closed up +0.0135 (+0.69%).Crude oil and gasoline prices recovered from early losses on Wednesday and settled higher as short covering emerged after the weekly EIA report showed that weekly crude inventories and oil supplies at Cushing fell.  Crude oil prices initially moved lower on Wednesday due to a stronger dollar.Global crude supply concerns eased after Russia announced on Tuesday that its Volgograd refinery, which can process 300,000 bpd of crude oil, will resume operations a week earlier than planned, as repairs to the refinery were made following drone attacks by Ukraine.An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported Monday that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Crude prices also have support on concern that the Russian-Ukrainian war will continue, which could keep restrictions on Russian crude exports in place, and even secondary restrictions could be added.  Russian Foreign Minister Lavrov said Sunday that there was no meeting planned between the leaders of Russia and Ukraine and that there \"needs to be an agenda first\" for a meeting to take place.  \"This agenda is not ready at all.\"  Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.Wednesday's weekly EIA report was mixed for crude and products.  On the bullish side, EIA crude inventories fell -2.39 million bbl, a larger draw than expectations of -2.0 million bbl.  Also, EIA distillate inventories unexpectedly fell -1.8 million bbl versus expectations of a +500,000 bbl build.  In addition, crude supplies at Cushing, the delivery point of WTI futures, fell by -838,000 bbl.  On the negative side, EIA gasoline stockpiles fell -1.2 million bbl, a smaller decline than expectations of -1.6 million bbl.Wednesday's weekly EIA report showed that (1) US crude oil inventories as of August 22 were -5.2% below the seasonal 5-year average, (2) gasoline inventories were -0.3% below the seasonal 5-year average, and (3) distillate inventories were -14.8% below the 5-year seasonal average.  US crude oil production in the week ending August 22 rose by +0.4% w/w to 13.439 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "18": {"title": "Crude Prices Recover as Weekly EIA Crude Inventories Fall More than Expected", "source": "barchart", "link": "https://www.barchart.com/story/news/34426407/crude-prices-recover-as-weekly-eia-crude-inventories-fall-more-than-expected", "date": "2025-08-27T10:40:00+00:00", "body": "October WTI crude oil (CLV25) today is up +0.31 (+0.49%), and October RBOB gasoline (RBV25) is up +0.0037 (+0.19%).Crude oil and gasoline prices recovered from early losses today and are posting moderate gains as short covering pushed prices higher after the weekly EIA report showed declines in crude inventories and supplies at Cushing.  Crude oil prices initially moved lower today due to a stronger dollar.Global crude supply concerns eased after Russia announced on Tuesday that its Volgograd refinery, which can process 300,000 bpd of crude oil, will resume operations a week earlier than planned, as repairs to the refinery were made following drone attacks by Ukraine.An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported Monday that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Crude prices also have support on concern that the Russian-Ukrainian war will continue, which could keep restrictions on Russian crude exports in place, and even secondary restrictions could be added.  Russian Foreign Minister Lavrov said Sunday that there was no meeting planned between the leaders of Russia and Ukraine and that there \"needs to be an agenda first\" for a meeting to take place.  \"This agenda is not ready at all.\"  Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.Today's weekly EIA report was mixed for crude and products.  On the bullish side, EIA crude inventories fell -2.39 million bbl, a larger draw than expectations of -2.0 million bbl.  Also, EIA distillate inventories unexpectedly fell -1.8 million bbl versus expectations of a +500,000 bbl build.  In addition, crude supplies at Cushing, the delivery point of WTI futures, fell by -838,000 bbl.  On the negative side, EIA gasoline stockpiles fell -1.2 million bbl, a smaller decline than expectations of -1.6 million bbl.Today's weekly EIA report showed that (1) US crude oil inventories as of August 22 were -5.2% below the seasonal 5-year average, (2) gasoline inventories were -0.3% below the seasonal 5-year average, and (3) distillate inventories were -14.8% below the 5-year seasonal average.  US crude oil production in the week ending August 22 rose by +0.4% w/w to 13.439 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "19": {"title": "WTI Futures Trade Higher Following Overnight Weakness", "source": "barchart", "link": "https://www.barchart.com/story/news/34425777/wti-futures-trade-higher-following-overnight-weakness", "date": "2025-08-27T09:59:00+00:00", "body": "WTI Crude oil futures fell yesterday as markets eyed the tariff deadline for India’s purchase of Russian crude. President Trump has threatened India with doubled tariff levels if their buying of Russian crude continues. Markets assumed today that the President would back off the threat, sending Crude lower. Worries over a “sell America” trade persisted through yesterday’s overnight session, with US equities and the Dollar starting the day trading lower. Despite this, a risk-on tone rallied equities back to unchanged, and the Dollar was well off the lows through the US session. Positive US economic data and traders’ focus on NVDA earnings were the primary drivers of the risk-on reversal. Today, crude oil futures are higher by +0.14 [+0.22%] as the India tariffs go into effect with no action out of President Trump. Estimates for today’s EIA report are as follows [thousand barrels]:Crude Oil: -2,000 estimateGasoline: -1,600 estimateDistillate: +500 estimateRefinery Utilization: -0.40%Last night’s API report showed draws of -974 k bbls. Technical Analysis: If prices can gain some footing above 63.40*** through the US session, we’d view this level as a decent buying opportunity. Futures failed at key resistance near the 65.15*** level and busted through two key support levels at 64.20*** and 63.40***. While this came on limited volume, the lack of willing buyers was notable. The false move into July’s trading range was odd, coming on a day with limited news flow or additional new catalysts. These markets are becoming increasingly random and risk-management / position sizing should take precedent for traders. Subscribe to our daily Energy Update for essential insights into Crude Oil and more. Get expert technical analysis, proprietary trading levels, and actionable market biases delivered straight to your inbox. Sign up now for free futures market research from Blue Line Futures!SIGN UP FOR 2-WEEKS OF FREE RESEARCH Futures trading involves substantial risk of loss and may not be suitable for all investors. Therefore, carefully consider whether such trading is suitable for you in light of your financial condition. Trading advice is based on information taken from trade and statistical services and other sources Blue Line Futures, LLC believes are reliable. We do not guarantee that such information is accurate or complete and it should not be relied upon as such. Trading advice reflects our good faith judgment at a specific time and is subject to change without notice. There is no guarantee that the advice we give will result in profitable trades. All trading decisions will be made by the account holder. Past performance is not necessarily indicative of future results.Blue Line Futures is a member of NFA and is subject to NFA’s regulatory oversight and examinations. However, you should be aware that the NFA does not have regulatory oversight authority over underlying or spot virtual currency products or transactions or virtual currency exchanges, custodians or markets. Therefore, carefully consider whether such trading is suitable for you considering your financial condition.With Cyber-attacks on the rise, attacking firms in the healthcare, financial, energy and other state and global sectors, Blue Line Futures wants you to be safe! Blue Line Futures will never contact you via a third party application. Blue Line Futures employees use only firm authorized email addresses and phone numbers. If you are contacted by any person and want to confirm identity please reach out to us at info@bluelinefutures.com or call us at 312- 278-0500Performance DisclaimerHypothetical performance results have many inherent limitations, some of which are described below. No representation is being made that any account will or is likely to achieve profits or losses similar to those shown. In fact, there are frequently sharp differences between hypothetical performance results and the actual results subsequently achieved by any particular trading program.One of the limitations of hypothetical performance results is that they are generally prepared with the benefit of hindsight. In addition, hypothetical trading does not involve financial risk, and no hypothetical trading record can completely account for the impact of financial risk in actual trading. For example, the ability to withstand losses or to adhere to a particular trading program in spite of trading losses are material points which can also adversely affect actual trading results. There are numerous other factors related to the markets in general or to the implementation of any specific trading program which cannot be fully accounted for in the preparation of hypothetical performance results and all of which can adversely affect actual trading results. ", "analysis": 1}, "20": {"title": "Crude Prices Fall Sharply as Global Oil Supply Concerns Ease", "source": "barchart", "link": "https://www.barchart.com/story/news/34402207/crude-prices-fall-sharply-as-global-oil-supply-concerns-ease", "date": "2025-08-26T14:25:00+00:00", "body": "October WTI crude oil (CLV25) on Tuesday closed down -1.55 (-2.39%), and October RBOB gasoline (RBV25) closed down -0.0370 (-1.86%).Crude oil and gasoline prices retreated on Tuesday as global crude supply concerns eased after Russia said one of its largest refineries will soon restart after repairs were made following a Ukrainian drone attack.  Gasoline prices were also under pressure as supply concerns eased with the restart of the BP refinery in Whiting, Indiana, the largest inland refinery in the US.  The 115,000 bpd Pipestill unit, which had been shuttered since August 19 due to storms and flooding, has now resumed operations.Tuesday's weaker dollar and better-than-expected US economic news were supportive for crude prices.  July US capital goods new orders nondefense ex-aircraft and parts, a proxy for capital spending, rose +1.1% m/m, stronger than expectations of +0.2% m/m.  Also, the Conference Board US Aug consumer confidence index fell -1.3 to 97.4, stronger than expectations of 96.5.  In addition, the Aug Richmond Fed manufacturing survey rose +13 to a 5-month high of -7, stronger than expectations of -11.Global crude supply concerns eased after Russia announced that its Volgograd refinery, which can process 300,000 bpd of crude oil, will resume operations a week earlier than planned, as repairs to the refinery were made following drone attacks by Ukraine.Weakness in the crude crack spread is bearish for oil prices as the crack spread fell to a 2.25-month low on Tuesday.  The weaker spread discourages refiners from purchasing crude oil and refining it into gasoline and distillates.An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported Monday that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Crude prices also have support on concern that the Russian-Ukrainian war will continue, which could keep restrictions on Russian crude exports in place, and even secondary restrictions could be added.  Russian Foreign Minister Lavrov said Sunday that there was no meeting planned between the leaders of Russia and Ukraine and that there \"needs to be an agenda first\" for a meeting to take place.  \"This agenda is not ready at all.\"  Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.The consensus is that Wednesday's weekly EIA crude inventories fell by -2.0 million barrels, and gasoline supplies declined by -1.6 million barrels.Last Wednesday's weekly EIA report showed that (1) US crude oil inventories as of August 15 were -5.6% below the seasonal 5-year average, (2) gasoline inventories were -0.7% below the seasonal 5-year average, and (3) distillate inventories were -13.0% below the 5-year seasonal average.  US crude oil production in the week ending August 15 rose by +0.4% w/w to 13.382 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "21": {"title": "Crude Prices Retreat as Global Oil Supply Concerns Ease", "source": "barchart", "link": "https://www.barchart.com/story/news/34397562/crude-prices-retreat-as-global-oil-supply-concerns-ease", "date": "2025-08-26T10:40:00+00:00", "body": "October WTI crude oil (CLV25) today is down -1.20 (-1.85%), and October RBOB gasoline (RBV25) is down -0.0330 (-1.65%).Crude oil and gasoline prices today are moving lower as global crude supply concerns eased after Russia said one of its largest refineries will soon restart after repairs were made following a Ukrainian drone attack.   Gasoline prices are also under pressure as supply concerns eased when the BP refinery in Whiting, Indiana, the largest inland refinery in the US, restarted its 115,000 bpd Pipestill unit that had been shuttered since August 19 due to storms and flooding.  Today's weaker dollar and better-than-expected US economic news are supportive for crude prices.Global crude supply concerns eased after Russia said its Volgograd refinery, which can process 300,000 bpd of crude oil, will resume operations a week earlier than planned, as repairs to the refinery were made following drone attacks by Ukraine.Weakness in the crude crack spread is bearish for oil prices as the crack spread fell to a 2-month low today.  The weaker spread discourages refiners from purchasing crude oil and refining it into gasoline and distillates.An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported Monday that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Strength in today's US economic reports is positive for energy demand and crude prices.  July capital goods new orders nondefense ex-aircraft and parts, a proxy for capital spending, rose +1.1% m/m, stronger than expectations of +0.2% m/m.  Also, the Conference Board US Aug consumer confidence index fell -1.3 to 97.4, stronger than expectations of 96.5.  In addition, the Aug Richmond Fed manufacturing survey rose +13 to a 5-month high of -7, stronger than expectations of -11.Crude prices also have support on concern that the Russian-Ukrainian war will continue, which could keep restrictions on Russian crude exports in place, and even secondary restrictions could be added.  Russian Foreign Minister Lavrov said Sunday that there was no meeting planned between the leaders of Russia and Ukraine and that there \"needs to be an agenda first\" for a meeting to take place.  \"This agenda is not ready at all.\"  Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.Last Wednesday's weekly EIA report showed that (1) US crude oil inventories as of August 15 were -5.6% below the seasonal 5-year average, (2) gasoline inventories were -0.7% below the seasonal 5-year average, and (3) distillate inventories were -13.0% below the 5-year seasonal average.  US crude oil production in the week ending August 15 rose by +0.4% w/w to 13.382 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "22": {"title": "Energy Futures Hold Above Key Resistance After Surprise Upside", "source": "barchart", "link": "https://www.barchart.com/story/news/34396297/energy-futures-hold-above-key-resistance-after-surprise-upside", "date": "2025-08-26T09:41:00+00:00", "body": "WTI Crude Oil futures surprised with upside strength yesterday. Driven by strong technical momentum and a large speculator short position reported on Friday, the limited news flow for the day provided a clean runway for a rally.There were reports that Ukraine had damaged Russian export facilities in the Baltic region, which also contributed to the rally.Overnight, Trump fired the Fed’s Cook. The firing was largely expected to come from Powell, and the fact that Trump broke the news is eroding some US dollar credibility. This type of “sell America” trade, which we saw in April, is something to keep an eye on. Crude Oil is lower this morning on a risk-off move tied to this firing.Technical Analysis:Futures punched above the 64.20*** key resistance level with ease yesterday and have reestablished themselves within the trading range seen throughout July between 64.30*** and 66.33***. The next resistance point within reach lies between 65.15-65.30***, which marks a key settlement on the move downward spurred by Russian talks as well as multiple settlements throughout July. Subscribe to our daily Energy Update for essential insights into Crude Oil and more. Get expert technical analysis, proprietary trading levels, and actionable market biases delivered straight to your inbox. Sign up now for free futures market research from Blue Line Futures!SIGN UP FOR 2-WEEKS OF FREE RESEARCH Futures trading involves substantial risk of loss and may not be suitable for all investors. Therefore, carefully consider whether such trading is suitable for you in light of your financial condition. Trading advice is based on information taken from trade and statistical services and other sources Blue Line Futures, LLC believes are reliable. We do not guarantee that such information is accurate or complete and it should not be relied upon as such. Trading advice reflects our good faith judgment at a specific time and is subject to change without notice. There is no guarantee that the advice we give will result in profitable trades. All trading decisions will be made by the account holder. Past performance is not necessarily indicative of future results.Blue Line Futures is a member of NFA and is subject to NFA’s regulatory oversight and examinations. However, you should be aware that the NFA does not have regulatory oversight authority over underlying or spot virtual currency products or transactions or virtual currency exchanges, custodians or markets. Therefore, carefully consider whether such trading is suitable for you considering your financial condition.With Cyber-attacks on the rise, attacking firms in the healthcare, financial, energy and other state and global sectors, Blue Line Futures wants you to be safe! Blue Line Futures will never contact you via a third party application. Blue Line Futures employees use only firm authorized email addresses and phone numbers. If you are contacted by any person and want to confirm identity please reach out to us at info@bluelinefutures.com or call us at 312- 278-0500Performance DisclaimerHypothetical performance results have many inherent limitations, some of which are described below. No representation is being made that any account will or is likely to achieve profits or losses similar to those shown. In fact, there are frequently sharp differences between hypothetical performance results and the actual results subsequently achieved by any particular trading program.One of the limitations of hypothetical performance results is that they are generally prepared with the benefit of hindsight. In addition, hypothetical trading does not involve financial risk, and no hypothetical trading record can completely account for the impact of financial risk in actual trading. For example, the ability to withstand losses or to adhere to a particular trading program in spite of trading losses are material points which can also adversely affect actual trading results. There are numerous other factors related to the markets in general or to the implementation of any specific trading program which cannot be fully accounted for in the preparation of hypothetical performance results and all of which can adversely affect actual trading results. ", "analysis": 2}, "23": {"title": "Crude Prices Settle Sharply Higher on Geopolitical Risks and Possible Fed Rate Cut", "source": "barchart", "link": "https://www.barchart.com/story/news/34374795/crude-prices-settle-sharply-higher-on-geopolitical-risks-and-possible-fed-rate-cut", "date": "2025-08-25T14:20:00+00:00", "body": "October WTI crude oil (CLV25) on Monday closed up +1.14 (+1.79%), and October RBOB gasoline (RBV25) closed down -0.0021 (-0.11%).Crude oil and gasoline prices on Monday settled mixed, with crude posting a 2.5-week high.  Crude oil prices have support from doubts about negotiations for an end to the Russian-Ukrainian war.   Crude is also climbing on expectations for the Fed to cut interest rates at next month's FOMC meeting, which could boost economic growth and energy demand.  Gains in crude accelerated Monday after prices rose above the 100-day moving average, which triggered some buying from algorithmic-based traders.  Monday's stronger dollar limited gains in crude.  Gasoline prices fell from a 3-week high and turned slightly lower Monday as supply concerns eased after the BP refinery in Whiting, Indiana, the largest inland refinery in the US, restarted its 115,000 bpd Pipestill unit that had been shuttered since August 19 due to storms and flooding.  Crude prices also have support on concern that the Russian-Ukrainian war will continue, which could keep restrictions on Russian crude exports in place, and even secondary restrictions could be added.  Russian Foreign Minister Lavrov said there was no meeting planned between the leaders of Russia and Ukraine and that there \"needs to be an agenda first\" for a meeting to take place.  \"This agenda is not ready at all.\"  Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported today that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Last Wednesday's weekly EIA report showed that (1) US crude oil inventories as of August 15 were -5.6% below the seasonal 5-year average, (2) gasoline inventories were -0.7% below the seasonal 5-year average, and (3) distillate inventories were -13.0% below the 5-year seasonal average.  US crude oil production in the week ending August 15 rose by +0.4% w/w to 13.382 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "24": {"title": "BC-Crude Oil Futures", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/bc-crude-oil-futures-140016972.html", "date": "2025-08-28T14:00:16+00:00", "body": "NEW YORK (AP) — Prices as of 10:00:00 AM Thursday, August 28.Light Sweet Crude (NYMX)1,000 bbl.- dollars per bbl.ContractOpenHighLowLastChangeToday's VolumeWednesday's VolumeOct 2563.8764.1863.4863.83-.3264980178363Nov 2563.3763.6062.9863.29-.303817899117Dec 2563.0063.1362.5462.83-.303694294838Jan 2662.5962.8262.2762.58-.261202947233Feb 2662.4262.6262.1562.39-.26649823047Mar 2662.3062.5162.0562.31-.23859024341Apr 2662.1262.4462.0262.30-.1713978662May 2662.0562.3662.0562.20-.2111969963Jun 2662.1562.3661.9262.16-.19733928362Jul 2662.0062.2561.8762.16-.113622432Aug 2661.9162.1961.8462.10-.112881949Sep 2661.9662.1961.8062.19+.0316469329Dec 2661.9762.1961.7462.02-.11662818122Jun 2761.9962.0261.9561.98-.2013943616Dec 2762.3362.5162.2162.51+.0713142811Dec 2862.7262.8462.7262.84-.09118940Est vol 189,431Wed.'s vol 557,570Open int 1,946,412Open Interest Change -12141", "analysis": 2}, "25": {"title": "Stocks mixed as investors digest US GDP, Nvidia earnings", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/asian-markets-mixed-nvidia-earnings-074120802.html", "date": "2025-08-28T13:47:47+00:00", "body": "Stock markets fluctuated on Thursday as investors digested stronger-than-estimated US economic growth and record earnings at AI chip giant Nvidia.The broad-base S&P 500 index and the tech-heavy Nasdaq opened higher but the Dow was flat.Shares in Nvidia were down around one percent despite posting a profit of $26.4 billion on record revenue of $46.7 billion in the second quarter.Investors had keenly awaited the earnings update late Wednesday from the California-based firm, whose robust growth has largely driven strong gains for tech stocks in recent months.Its shares fell, however, as important data centre revenue declined.The earnings report comes amid market worries over a spending bubble in the artificial intelligence sector that could burst and hurt the chip giant's fortunes.\"The market seems to be asking whether Nvidia can keep up this pace as competition intensifies and AI enthusiasm starts to look a little overbought,\" said Joshua Mahony, chief market analyst at traders Scope Markets.Investors were also reacting to US data showing that the world's biggest economy grew 3.3 percent in the second quarter, up from an initial estimate of 3.0 percent in July.\"After the initial release, there were concerns that the domestic economy was slowing quite sharply,\" said Richard Flax, chief investment officer at Moneyfarm.\"But these latest data suggest that the economy is a bit stronger than initially feared,\" he said.The upward revision mainly reflected improvements in investment and consumer spending, the Commerce Department said.But overall, growth in the second quarter was also bolstered by a fall in US imports, which are subtracted from the GDP.This drop came as businesses pulled back on shipments after rushing to stock up ahead of US President Donald Trump's tariff hikes.The data could offer insight into the outlook for US interest rates, with the Federal Reserve eyeing further cuts to borrowing costs in a bid to boost the US economy.\"Overall, this release probably doesn't change Federal Reserve thinking too much,\" Flax said, adding that the central bank was still expected to cut rates by 25 basis points at its September meeting.\"But a stronger than expected result from domestic demand suggests that there might not be that much scope to cut rates over the next 12 months.\"In Europe, the Paris stock market extended its recovery, having tumbled early in the week on fears that France's minority government could be toppled.This was after Prime Minister Francois Bayrou proposed a confidence vote over his proposed budget cuts.", "analysis": 1}, "26": {"title": "Oil Steadies as US Berates India, Surplus Concerns Flare Again", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/oil-drops-even-us-raises-004638753.html", "date": "2025-08-28T12:45:12+00:00", "body": "(Bloomberg) -- Oil was little changed within its recent narrow band as traders continue to monitor a looming oversupply and US efforts to force India to desist from buying Russian barrels.Brent nudged below $68 a barrel, having traded between $65 and $70 for virtually all of August. White House trade adviser Peter Navarro stepped up the pressure on New Delhi to halt purchases of Russian oil after Washington doubled a levy on imports from the country to 50%. The US has singled out India over Russian crude imports as part of its efforts to end the war in Ukraine.Most Read from BloombergTo Boost Housing, Chicago Kills Parking MinimumsCentral Glasgow Could Be Poised for a RevivalChicago Schools’ Late Pension Payment Magnifies Fiscal MessNY Penn Station’s Long-Awaited Revamp to Start Work in 2027Trump Administration to Take Control of DC’s Union StationAt the same time, Ukraine has ramped up drone attacks on Russia’s oil infrastructure, hitting two more refineries after a run of recent strikes. Moscow’s crude exports slipped last week, tanker-tracking data compiled by Bloomberg showed, after Ukraine intensified its attacks.Oil markets are widely expected to move into a surplus toward the end of the year, as higher output from the OPEC+ alliance and outside of the grouping overwhelms demand. The producer group is next due to meet on Sept. 7 but no talks have been held yet about its next moves, according to a senior OPEC delegate.“Tariffs and sanctions related to Russia, as well as attacks on Russian oil facilities have kept oil prices resilient in the high $60s, despite the looming oversupply that should lower prices,” Citigroup analysts including Anthony Yuen said in a note.While a surplus is widely expected toward the end of the year, its impact on the market remains uncertain. Bank of America Corp. said on Wednesday that the availability of about a billion barrels of spare tank space means it’s possible that the extra supplies could be absorbed fairly comfortably.Against that backdrop, there’s been some weakness in the Brent market over recent days, after a run of cargo offers in the key North Sea pricing window. Vital swaps contracts are at the weakest level since May and the global benchmark is at the softest since March relative to the Middle Eastern Dubai marker.--With assistance from Jake Lloyd-Smith and Sarah Chen.Most Read from Bloomberg BusinessweekAs Bushmeat Consumption Grows, Nigerian Doctors Fear OutbreaksMonchhichi Makes a Comeback Amid Labubu CrazeYoung European Backpackers Are Being Lured to Australia for Mining JobsHow Bombas Built a Fancy Socks Empire With $500 Million in SalesYosemite Workers Vote to Unionize©2025 Bloomberg L.P.", "analysis": 2}, "27": {"title": "U.S. stocks edged lower; Q2 GDP rose more than expected, Nvidia disappoints", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-dip-as-nvidia-earnings-spark-little-cheer-4213662", "date": "2025-08-28T13:59:12+00:00", "body": "Investing.com-- U.S. stocks edged lower Thursday, trading either side of the flatline, as investors digested new U.S. growth data as well as results from artificial intelligence major Nvidia  (NASDAQ:NVDA). At 09:55 ET (13:55 GMT), the Dow Jones Industrial Average traded 75 points, or 0.2%, lower, the S&P 500 index dropped 10 points, or 0.2%, and NASDAQ Composite slipped 45 points, or 0.2%. The major indices on pace to record monthly gains, as the S&P 500 and the NASDAQ Composite were each up more than 2% before Thursday’s action, while the 30-stock Dow Jones Industrial Average gained up more than 3% in the period.Nvidia reported a beat to analysts’ quarterly estimates late Wednesday and the chip designer and AI bellwether forecasted third-quarter revenue that was higher than Wall Street estimates. However, a miss on data centre revenue and questions over China forecasts caused investors to question the company’s elevated valuation, resulting in its shares sliding lower.Notably, Nvidia said there were no sales of H20 chips to China during the quarter, nor did the company assume any shipments in its guidance. Chip stocks came under a bit of pressure in sympathy, with AMD (NASDAQ:AMD), TSMC (NYSE:TSM) and Broadcom (NASDAQ:AVGO) all retreating.Among other tech movers, cybersecurity firm CrowdStrike Holdings (NASDAQ:CRWD) fell as its current quarter guidance missed expectations, while data cloud company Snowflake (NYSE:SNOW) soared after it hiked its annual product revenue guidance.  Jack Daniel’s maker Brown Forman (NYSE:BFb) beat estimates for first-quarter sales, on the back of steady demand for its ready-to-drink beverages and spirits.Bath & Body Works (NYSE:BBWI) missed estimates for second-quarter profit, hurt by higher costs at a time when the retailer grapples with uncertain discretionary consumer spending.Dollar General (NYSE:DG) raised its annual sales and profit forecasts, banking on steady demand from cost-conscious consumers across income brackets in the United States amid tariff and inflation concerns.U.S. stocks had rallied on a mostly positive second-quarter earnings season and increasing bets on a September interest rate cut by the Federal Reserve.But this rally was seen cooling through late-August, amid emerging doubts over the Fed’s plans, as well as a sharp drop in technology shares.That said, expectations of a Fed interest rate cut in September rose after Fed Governor John Williams said in an interview with CNBC on Wednesday that \"every meeting is, from my perspective, live.\"\"Risks are more in balance,\" he said. \"We are going to just have to see how the data play out.\"Data released earlier Thursday showed that the U.S. economy expanded by more than initially reported in the second quarter, with gross domestic product growing by 3.3% during the April to June period, according to the second estimate from the Commerce Department’s Bureau of Economic Analysis.The initial estimate had suggested that the U.S. economy grew by 3.0% in the first quarter, after contracting by 0.5% in the first quarter.The focus will also be on the PCE price index on Friday - the Fed’s preferred inflation measure - and the monthly payrolls report a week later.Oil prices fell on expectations for lower U.S. fuel demand as the summer driving season draws near, even after a sharp drop in U.S. crude inventories.At 09:55 ET, Brent futures slipped 0.4% to $67.14 a barrel, and U.S. West Texas Intermediate crude futures fell 0.5% to $63.81 a barrel.Both contracts climbed in the prior session after the Energy Information Administration reported that U.S. crude inventories fell by 2.4 million barrels in the week ended August 22, a larger draw than the 1.9 million barrels forecast by analysts.The drop signaled strong demand ahead of the upcoming U.S. Labor Day long weekend. However, this typically marks the unofficial end of the summer driving season and the onset of lower U.S. demand.Ambar Warrick contributed to this article   Futures retreated after a mildly positive session on Wall Street, where the S&P 500 hit a record high on some gains in technology shares.But tech stocks drifted lower in aftermarket trade, led chiefly by NVIDIA Corporation (NASDAQ:NVDA) as the chipmaker’s data center revenue missed expectations amid heightened uncertainty over China. Most investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.      But that doesn't mean you can't use smart shortcuts. If you're considering NVDA, try chatting with WarrenAI, our powerful AI financial assistant.    It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.      Even if you end up going with your gut feeling, at least you'll know why.", "analysis": 1}, "28": {"title": "Oil ticks lower as end of driving season looms, Druzhba restarts", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-slips-as-market-weighs-end-of-us-summer-driving-and-india-supply-dilemma-4213674", "date": "2025-08-28T13:25:33+00:00", "body": "By Alex LawlerLONDON (Reuters) -Oil prices edged lower on Thursday after rising in the previous session, pressured by expectations of lower U.S. fuel demand at the end of the summer travel season and by the restart of Russian supply to Hungary and Slovakia through the Druzhba pipeline.Crude had risen on Wednesday after official data showed U.S. crude inventories fell by 2.4 million barrels in the week ended August 22, compared with analysts’ expectations in a Reuters poll for a 1.9-million-barrel draw, a sign of strong demand.However, oil market participants see the upcoming U.S. Labor Day long weekend as the unofficial end of the summer driving season, and the onset of lower U.S. demand for gasoline.Brent crude futures were down 11 cents, or nearly 0.2%, to $67.94 at 1312 GMT, and West Texas Intermediate (WTI) crude futures were down 7 cents at $64.08.\"This weekend’s U.S. bank holiday marks the end of the driving season and gasoline has hardly been the panacea hoped for in terms of demand,\" said John Evans of oil broker PVM.\"Any short-term reasons to be friendly towards oil prices are diminishing,\" he added, citing the Druzhba resumption.Russian crude supplies to Hungary and Slovakia through the Druzhba pipeline have restarted after an outage caused by a Ukrainian attack in Russia last week, Hungarian oil company MOL and Slovakia’s economy minister said on Thursday.Traders are also watching out for how New Delhi responds to pressure from Washington to stop buying Russian oil, after U.S. President Donald Trump doubled tariffs on imports from India to as much as 50% on Wednesday.\"India is expected to continue purchasing crude oil from Russia at least in the short term, which should limit the impact of the new tariffs on global supply,\" IG market analyst Tony Sycamore said.Lending some support to prices, Russia and Ukraine have stepped up attacks on each other’s energy infrastructure.Russia launched a massive drone attack on energy and gas transport infrastructure across six Ukrainian regions overnight to Wednesday, leaving more than 100,000 people without power, Ukrainian officials said.AI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.      Year to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).      Which stock will be the next to soar?", "analysis": 2}, "29": {"title": "Oil prices slip after U.S. inventory draw; U.S. GDP expanded in Q2", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-prices-slip-as-traders-assess-india-tariff-impact-us-inventory-draw-4213676", "date": "2025-08-28T13:22:01+00:00", "body": "Investing.com-- Oil prices slipped lower Thursday after traders digested a drop in U.S. crude inventories as well as the impact of additional U.S. tariffs against India, which came into effect a day earlier.At 09:20 ET (13:20 GMT), Brent Oil Futures expiring in October fell 0.2% to $67.28 per barrel, while West Texas Intermediate (WTI) crude futures declined 0.3% to $63.99 per barrel.U.S. crude oil inventories fell by 2.4 million barrels in the week to Aug. 22, a larger draw than the 1.9 million barrels forecast by analysts, according to data from the Energy Information Administration.Gasoline inventories declined by 1.2 million barrels, and distillate stocks dropped by 1.8 million barrels, while implied gasoline demand rose to 9.24 million barrels per day from 8.84 million bpd a week earlier, pointing to solid seasonal consumption. The figures indicated strong end-of-summer driving activity but also raised concerns that, once the seasonal peak passes, demand could weaken, leaving refiners with slimmer margins and the crude market vulnerable to softer consumption. While tighter inventories would normally support prices, oil futures eased as investors weighed the risk that the end of the summer travel season could cap demand going forward, tempering the bullish impact of the stock draw.In a move tied to India’s aggression in buying Russian crude, an additional 25% U.S. tariff on Indian imports took effect on Wednesday, doubling the total duty to 50% starting August 27. This step is part of broader pressure aimed at curbing India’s ties with Russia amid the Ukraine war.Indian refiners briefly paused Russian oil purchases after secondary tariffs were imposed, but have since resumed buying, with the measures proving insufficient to curb flows.Analysts believe the market will be cautiously watching Russian oil flows to India closely going forward to gauge the impact.The conflict in Ukraine also remains one of the main drivers of market sentiment. U.S. President Donald Trump has sought to position himself as a mediator, but last week warned he would impose fresh sanctions on Moscow if no progress was made toward a peace deal within two weeks.The U.S. economy expanded by more than initially reported in the second quarter, as the gross domestic product, an indicator of growth in the world’s biggest economy, grew by 3.3% during the April to June period, according to the second estimate from the Commerce Department’s Bureau of Economic Analysis on Thursday.The initial estimate had suggested that the U.S. economy grew by 3.0% in the first quarter, after contracting by 0.5% in the first quarter.The Federal Reserve will digest this growth data, although it is backward looking, along with Friday’s PCE price index - the U.S. central bank’s preferred inflation measure - and next week’s monthly payrolls report ahead of September’s policy meeting.Expectations of a Fed interest rate cut next month rose after Fed Governor John Williams said in an interview with CNBC on Wednesday that \"every meeting is, from my perspective, live.\"\"Risks are more in balance,\" he said. \"We are going to just have to see how the data play out.\"Ayushman Ojha contributed to his articleThe best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 2}, "30": {"title": "CANADA FX DEBT - Canadian dollar weakens, benchmark yield slips", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/canada-fx-debt-canadian-dollar-130237135.html", "date": "2025-08-29T13:02:37+00:00", "body": "The Canadian dollar weakened against the greenback on Friday, and the yield on benchmark government debt slipped.The loonie was trading 0.2% lower at C$1.377 to the greenback, or 72.62 U.S. cents, after trading in a range of 1.3738 to 1.3779.Canadian government 10-year bond yields fell 2 basis points to 3.408%. The yield on similar U.S. government benchmark debt rose to 4.2323%.U.S. October crude futures fell 11 cents to $64.49 a barrel on Friday.", "analysis": 1}, "31": {"title": "Oil Heads for Monthly Loss as Traders Weigh Glut, Geopolitics", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/oil-heads-monthly-loss-glut-053525893.html", "date": "2025-08-29T12:50:28+00:00", "body": "(Bloomberg) -- Oil edged lower on course for a monthly loss, with trading dominated by concerns about a looming glut and geopolitical issues, including US-led efforts to end the war in Ukraine.Brent for November delivery traded below $68 a barrel, with the global benchmark about 5% lower this month. West Texas Intermediate fell toward $64. Oil has lost ground in August on worries that global supplies will run ahead of demand in the coming quarters, boosting stockpiles.Most Read from BloombergAmtrak Debuts New High-Speed Acela Trains After Years of DelaysTo Boost Housing, Chicago Kills Parking MinimumsCentral Glasgow Could Be Poised for a RevivalNY Penn Station’s Long-Awaited Revamp to Start Work in 2027Chicago Schools’ Late Pension Payment Magnifies Fiscal MessInvestors are also focused on Ukraine, and potential shifts in crude flows from Russia. US President Donald Trump was “not happy” about Moscow’s recent strikes on Ukraine, White House Press Secretary Karoline Leavitt said. Washington has imposed a 50% levy on most Indian imports to punish the South Asian nation for buying Russian crude.Moscow unleashed a wave of drone and missile strikes on Kyiv earlier this week, in defiance of US calls for an end to the fighting, killing 18 people, Ukrainian authorities said.A meeting between Ukrainian President Volodymyr Zelenskiy and Russia’s Vladimir Putin was unlikely, according to German Chancellor Friedrich Merz. Trump has threatened “very big consequences” if Moscow doesn’t come to the negotiating table.Oil’s decline in August is the first monthly drop since April, when most commodities were hurt by a sharp escalation in Trump’s trade war and concerns that energy consumption would suffer. The worries about a surplus — with the International Energy Agency forecasting a record glut — follow a campaign by OPEC+ to restore idled capacity.“More OPEC+ oil is coming to the market amid worries over US economic growth, which keeps the market well-supplied,” said Jens Naervig Pedersen, a strategist at Danske Bank AS. “At the same time, the US looks ready to ramp up sanctions on Russian crude buyers.”--With assistance from John Deane and Sarah Chen.Most Read from Bloomberg BusinessweekMonchhichi Makes a Comeback Amid Labubu CrazeAs Bushmeat Consumption Grows, Nigerian Doctors Fear OutbreaksYoung European Backpackers Are Being Lured to Australia for Mining JobsHow Bombas Built a Fancy Socks Empire With $500 Million in SalesYosemite Workers Vote to Unionize©2025 Bloomberg L.P.", "analysis": 2}, "32": {"title": "Oil faces uphill struggle as supply glut worries mount: Reuters poll", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/oil-faces-uphill-struggle-supply-110240928.html", "date": "2025-08-29T11:02:40+00:00", "body": "By Brijesh Patel(Reuters) -Oil prices are unlikely to gain much traction from current levels this year as rising output from top producers adds to the risk of a surplus and U.S. tariff threats curb demand growth, a Reuters poll showed on Friday.A survey of 31 economists and analysts conducted in August forecasts Brent crude will average $67.65 per barrel in 2025, little changed from July's $67.84 forecast. The global benchmark has averaged around $70 so far this year.U.S. crude is seen at $64.65, compared with last month's $64.61 estimate.\"(With) the latest OPEC+ supply increases and the expected lackluster global demand, the prospect is for an even larger market surplus in 2025,\" said Moutaz Altaghlibi, senior energy economist at ABN AMRO.He said the outlook remains clouded by \"deep uncertainty\" concerning any additional U.S. tariffs, especially those associated with geopolitical outcomes such as an Iranian nuclear deal or Russia agreeing to a ceasefire.Earlier this month, the Organization of the Petroleum Exporting Countries and its allies, together known as OPEC+, agreed to raise oil production by 547,000 barrels per day for September.\"OPEC+ probably still has not reached the end of their output hikes. At the moment, market share seems to be more important than a higher level of oil prices,\" said Frank Schallenberger, head of commodity research at LBBW.\"This will lead to a big supply surplus on oil markets in 2025 and 2026 and will keep prices down.\"Washington's attempts to broker peace in Ukraine with Moscow have so far proven unsuccessful. Meanwhile, U.S. President Donald Trump has imposed additional tariffs on India, pressuring New Delhi to stop buying Russian oil.Most of the poll respondents see limited impact on the oil market from Trump's threats on Russian crude buyers, as they expect OPEC+ and alternative suppliers could mitigate supply gaps.However, the geopolitical risk premium is expected to underpin oil prices as a quick Russia-Ukraine ceasefire deal seems highly unlikely, analysts said.Global oil demand is seen growing by between 500,000 and 1.1 million bpd in 2025, the poll showed, compared to the International Energy Agency forecast of 680,000 bpd.Meanwhile, OPEC raised its global oil demand forecast for next year and trimmed its estimate for growth in supply from the U.S. and other producers outside the wider OPEC+ group.\"U.S. production is an interesting one as President Trump would like to push for more production, but OPEC+ may be right in their projections. The reason around this is price,\" said Zain Vawda, analyst at MarketPulse by OANDA.(Reporting by Brijesh Patel in Bengaluru; Editing by Jan Harvey)", "analysis": 2}, "33": {"title": "Dividend Growth and Earnings Outlook Might Change the Case for Investing in Coterra Energy (CTRA)", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/dividend-growth-earnings-outlook-might-101039033.html", "date": "2025-08-29T10:10:39+00:00", "body": "Earlier this week, Coterra Energy was highlighted for its strong dividend profile, with a current yield well above industry averages, five dividend increases in five years, and forecasts of a nearly 53% year-over-year earnings rise for fiscal 2025.This dividend growth, coupled with a sustainable payout ratio and consistently rising earnings, points to Coterra’s ability to deliver both reliable income and long-term growth potential for shareholders.We'll examine how Coterra's record of dividend growth and robust earnings outlook reshape its investment narrative and outlook for income-focused investors.Trump has pledged to \"unleash\" American oil and gas and these 22 US stocks have developments that are poised to benefit.To stand behind Coterra Energy as a shareholder, you need confidence in the company's ability to maintain strong free cash flow, support its above-average dividend yield, and manage production growth sustainably, while facing potential pressure from volatile natural gas prices. This week's robust earnings outlook and dividend hike affirm the company’s near-term ability to deliver income, but the potential for continued natural gas oversupply remains the most important catalyst and risk; the latest news does not fundamentally alter this central dynamic.Among recent announcements, Coterra’s August 2025 decision to raise full-year production guidance stands out, bolstering optimism around both revenue growth and earnings momentum. However, this production increase is closely linked to prevailing commodity prices, and any sustained softness in natural gas could offset the positive impact for income-focused investors.By contrast, the durability of Coterra’s dividends and earnings may ultimately depend on how it manages exposure to persistently low gas prices, a risk all shareholders should recognize as...Read the full narrative on Coterra Energy (it's free!)Coterra Energy's outlook forecasts $9.6 billion in revenue and $1.9 billion in earnings by 2028. This implies a 15.6% annual revenue growth rate and a $0.3 billion increase in earnings from the current $1.6 billion.Uncover how Coterra Energy's forecasts yield a $33.48 fair value, a 37% upside to its current price.Fair value estimates from four Simply Wall St Community members range from US$25.55 to US$63.67 per share. With this breadth of outlooks, you should also consider the risk that ongoing market oversupply could affect revenue and margins, so exploring a variety of viewpoints may help clarify your position.", "analysis": 1}, "34": {"title": "Oil Market Braces for Supply Surplus, But Demand Trends Will Also Be Crucial", "source": "finance.yahoo", "link": "https://finance.yahoo.com/m/a398b11b-3d6f-3f53-9527-a27681d92578/oil-market-braces-for-supply.html", "date": "2025-08-29T09:57:00+00:00", "body": "A looming supply surplus hangs over the oil market, but its extent largely depends on the evolution of the demand outlook, Commerzbank said.", "analysis": 2}, "35": {"title": "Russian Crude Prices to Drop if India Cuts Back on Purchases: Wiggen", "source": "finance.yahoo", "link": "https://finance.yahoo.com/video/russian-crude-prices-drop-india-090101251.html", "date": "2025-08-29T09:01:01+00:00", "body": "Nadia Martin Wiggen, Director of Svelland Capital, expects Russian crude prices to drop if India is pressured to cut back on purchases by the Trump administration. It comes as Russian President Vladimir Putin prepares to meet with his two most important energy partners, China's Xi Jinping and India's Narendra Modi, at this weekend's Shanghai Cooperation Organization summit in Tianjin, China. Wiggen spoke with Bloomberg's Tom Mackenzie.", "analysis": 2}, "36": {"title": "Gas hasn’t been this cheap on Labor Day since 2020", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/gas-hasn-t-cheap-labor-090005448.html", "date": "2025-08-29T09:00:05+00:00", "body": "Americans soaking up the end of summer this holiday weekend will catch a break at the gas pump.Labor Day gas prices are expected to average $3.15 per gallon this year— the cheapest since 2020 during the Covid-19 pandemic, according to GasBuddy. That’s down modestly from $3.29 last Labor Day.Drivers in some parts of the country will find sub-$3 gas. As of Thursday, the average price is below $3 per gallon in 15 states, including Georgia, Texas, North Carolina and Iowa, according to AAA, the automotive and trip-planning group.The relatively low fuel costs offer a bright spot to consumers still struggling with a higher cost of living at the grocery store, in their utility bills and elsewhere. Although gas prices have edged higher in recent days, they remain well below last summer — and it’s largely due to the fact that oil prices remain low.“Americans are spending less and less of their paychecks filling up their tanks,” Patrick De Haan, vice president of petroleum analysis at GasBuddy, told CNN in a phone interview.Gas prices crashed in 2020 as the health crisis caused many Americans to stay off the roads. The national average that Labor Day plunged to just $2.22 a gallon.Then gas prices reached a Labor Day record high of $3.79 in 2022, the same year gas surged to $5 a gallon for the first time after Russia’s invasion of Ukraine spiked oil prices.“Lowering the cost of energy is very important. It translates to an immediate increase in household cashflow and helps middle and lower-income Americans who are often living paycheck to paycheck,” Joe LaVorgna, counselor to the US treasury secretary, told CNN in a phone interview.US oil fell below $64 a barrel on Thursday, down from $77.38 a barrel on President Joe Biden’s final full day in office.The White House took a victory lap for the lower fuel costs, crediting Trump with “fully unleashing American energy dominance” in a statement on Thursday. LaVorgna said oil prices are “largely a result of the president’s policies” and his efforts to get US “allies and partners overseas” to pump more oil.Although it’s true that US oil production remains near all-time highs, output is little changed since Trump took office, promising to slash red tape and end President Joe Biden’s alleged war on energy.In fact, US oil output stood at 13.4 million barrels per day during the week ending on August 22, down slightly from 13.5 million during President Joe Biden’s last full week in office, according to federal data.Still, LaVorgna argued the oil industry is feeling better about investing in future production because of Trump’s deregulatory stance.", "analysis": 1}, "37": {"title": "Oil Caught Between Demand Concerns and Geopolitical Risks", "source": "finance.yahoo", "link": "https://finance.yahoo.com/m/63d38cb7-d150-3124-b49a-e4ca0a2f8acf/oil-caught-between-demand.html", "date": "2025-08-29T08:57:56+00:00", "body": "Oil prices were slipping in early trading but remained on track for a modest weekly gain, as traders balance concerns over softer demand heading into the fall and risks of disruption to Russian supplies.", "analysis": 2}, "38": {"title": "Oil prices slip marginally lower; Ukraine peace deal, India tariffs in focus", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-prices-retreat-amid-waning-hopes-for-russiaukraine-peace-deal-4215767", "date": "2025-08-29T13:02:52+00:00", "body": "Investing.com-- Oil prices slipped marginally lower Friday after rallying the previous session, as markets grappled with dimming prospects of a Russia-Ukraine peace deal and evaluated the impact of additional U.S. tariffs on India.At 09:00 ET (13:00 GMT), Brent Oil Futures expiring in October dropped 0.2% to $67.82 per barrel and West Texas Intermediate WTI crude futures declined 0.2% to $64.50 per barrel.Oil prices settled nearly 1% higher on Thursday, shrugging off early losses as U.S. data showed a smaller-than-expected decline in crude stockpiles.However, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries (OPEC).Peace hopes have dimmed after U.S. President Donald Trump last week urged Ukrainian President Volodymyr Zelensky and Russian President Vladimir Putin to hold direct talks before considering a trilateral summit hosted by Washington. While Trump offered U.S. security guarantees short of troop deployment, no date or venue for a meeting has been set, and analysts see little progress in the near term.Meanwhile, Russia carried out a fresh wave of deadly attacks on Kyiv, damaging buildings housing the EU mission and the British Council.“The lack of progress towards a peace deal means risks of sanctions and secondary tariffs continue to hang over the oil market,” ING analysts said in a note.In a move tied to India’s aggression in buying Russian crude, an additional 25% U.S. tariff on Indian imports took effect on Wednesday, doubling the total duty to 50% starting August 27. This step is part of broader pressure aimed at curbing India’s ties with Russia amid the Ukraine war.Indian refiners boosted U.S. crude oil purchases this month, drawn by competitive prices, Reuters reported, a move that could help narrow the country’s trade deficit with the United States amid tensions between the two nations.The country’s top refiner, Indian Oil Corp, has bought 5 million barrels of U.S. West Texas Intermediate crude for delivery in October and November via a tender, trade sources said.This came after another state refiner Bharat Petroleum Corp purchased 2 million barrels of U.S. WTI crude while private refiner Reliance Industries has bought 2 million barrels of WTI crude from Vitol, other sources said.Indian refiners, along with others in Asia, stepped up purchases after the arbitrage window for U.S. crude to Asia opened. India is also under pressure to buy more U.S. oil after the United States doubled its tariffs on Indian imports to 50%, citing New Delhi’s buying of Russian oil.The market will be cautiously watching Russian oil flows to India closely going forward to gauge the impact.Aysuhman Ojha contributed to this articleMost investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.      But that doesn't mean you can't use smart shortcuts. If you're considering BPCL, try chatting with WarrenAI, our powerful AI financial assistant.    It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.      Even if you end up going with your gut feeling, at least you'll know why.", "analysis": 2}, "39": {"title": "U.S. stock futures fall as investors bank profits; PCE data in line", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-edge-lower-after-sp-500-hits-record-high-pce-data-in-focus-4215753", "date": "2025-08-29T12:49:23+00:00", "body": "Investing.com-- U.S. stock index futures fell Friday, falling back from record levels as investors bank profits after a solid month amid few signs of excessive inflationary pressures. At 08:45 ET (12:45 GMT), Dow Jones Futures fell 115 points, or 0.3%, S&P 500 Futures dropped 15 points, or 0.2%, and Nasdaq 100 Futures slipped 98 points, or 0.4%.The major indices enjoyed a winning session on Thursday, with the S&P 500 closing up 0.3% at an all-time high. The NASDAQ Composite added 0.5%, while the Dow Jones Industrial Average ended the day up about 0.2%, also a new record.They are also all on track for solid monthly gains, with the 30-stock Dow having logged a 3.4% advance so far in August. The S&P 500 is up 2.6% so far this month, and the tech-heavy Nasdaq has gained 2.8%.Data released earlier Friday showed that the core PCE price index, the Federal Reserve’s preferred gauge of inflation, rose 0.3% on a monthly basis, putting the annual rate at 2.9%, its highest level in five months.This was in line with expectations, suggesting that U.S. President Donald Trump’s sweeping tariffs were not filtering excessively into consumer prices, despite a recent upside surprise in producer inflation.The Fed lowered its policy rate by a full percentage point last year, but has held rates steady this year, citing worries that Trump’s higher tariffs could reignite inflation that is still running above the Fed’s 2% goal.Signs of sticky inflation could hurt expectations of more interest rate cuts by the Fed, given that the central bank has cited cooling inflation as its biggest consideration for cutting interest rates. Bets on a September cut grew sharply after Fed Chair Jerome Powell acknowledged such a possibility, citing some recent cooling in the labor market. But Powell still remained largely non-committal towards future rate cuts, citing uncertainty over the inflation impact of President Donald Trump’s trade tariffs. Inflation and labor readings for August are expected to reflect the impact of Trump’s tariffs, given that a bulk of his levies took effect this month. In the corporate sector, among major aftermarket movers on Thursday, Dell Technologies Inc (NYSE:DELL) fell as weak current-quarter guidance largely overshadowed strong earnings.Amazon.com chip partner Marvell Technology Inc (NASDAQ:MRVL) dropped sharply after posting disappointing guidance for the current quarter.On the other hand, Autodesk (NASDAQ:ADSK) soared 10% after the software developer clocked strong quarterly earnings. Ulta Beauty (NASDAQ:ULTA), Ambarella (NASDAQ:AMBA) and Affirm (NASDAQ:AFRM) also gained strongly.Oil prices slipped lower, but are set for a weekly gain, as traders weigh uncertainty over Russian supply as well as the proximity to the end of the important U.S. summer driving season.At 08:45 ET, Brent futures slipped 0.2% to $67.83 a barrel, and U.S. West Texas Intermediate crude futures fell 0.3% to $64.44 a barrel.Both contracts are on course for weekly gains of just under 1%, with prices gaining after Ukrainian attacks on Russian oil export terminals raised doubts about Russian supply, while the lack of a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky raised doubts about the peace process.However, the end of the U.S. summer driving demand period with the Labor Day holiday on Monday have weighed on prices.On a broader scale, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries.Ambar Warrick contributed to this articleMost investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.      But that doesn't mean you can't use smart shortcuts. If you're considering DELL, try chatting with WarrenAI, our powerful AI financial assistant.    It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.      Even if you end up going with your gut feeling, at least you'll know why.", "analysis": 1}, "40": {"title": "Shares slip from record highs ahead of US inflation data", "source": "investing", "link": "https://www.investing.com/news/economy-news/asia-upbeat-on-wall-st-boost-as-markets-await-us-inflation-data-4215770", "date": "2025-08-29T12:24:29+00:00", "body": "By Marc JonesLONDON (Reuters) - World stocks inched back from their latest tech-led record highs on Friday ahead of U.S. inflation data that will feed the Federal Reserve’s crucial - and increasingly politicised - interest rate plans.Traders were squaring up after another bullish month for global equities that has come despite brewing bond market worries over U.S. President Donald Trump’s move to fire Fed policymaker Lisa Cook, and renewed political strife in France.Both Europe’s STOXX 600 share index and the euro were down on the day and heading for their first weekly losses in four, while 0.4% dips on France’s CAC 40 and Germany’s DAX left them set for trend-defying monthly drops.State Street’s head of global macro strategy Michael Metcalfe said it was the first time in a long while that political risk was on the rise after a period where international investors have been pouring money into the region.\"The question is do you take the fiscal risk in the euro or the Fed independence risk in the dollar,\" Metcalfe said. \"This week, it looks like it’s a score draw.\"Wall Street looked set for a groggy start after two record highs for the S&P 500 on the bounce. [.N]European 30-year bond yields are set to suffer their biggest monthly jumps since March though. The largest has come in France, where Prime Minister Francois Bayrou has called a confidence vote for September 8 that many expect him to lose.The closely-watched spread France pays over Germany for 10-year debt held at 78 basis points on Friday, having soared over the last fortnight.. Investors were also digesting moderately higher inflation numbers from France and from key parts of Germany.A UK bank share index fell 4.4% meanwhile after an influential think tank suggested the cash-strapped government there could begin taxing banks based on their Bank of England reserves.Asia had been mixed overnight with Chinese shares clocking up their best month in almost a year with a more than 10% gain on hopes that its economy, especially the tech sector, is picking up.Japan’s heavyweight Nikkei ended down on the day, although it too has jumped 4% in August and both it and MSCI’s broadest index of Asia-Pacific shares outside of Japan are on an unbroken 5-month run of gains.One blip in China, where the yuan has also been on the charge, was a 1.7% pull back on the tech-focused STAR 50 Index after its near 30% boom this month.It came as shares in chip firm Cambricon Technologies dropped more than 6% as it issued an official risk alert over the more than doubling of its stock price since late July.\"Certainly, when you see such a very, very large move, and then some warning coming from the company, you could think that there has been a little bit of overshooting,\" said Frank Benzimra, head of Asia equity strategy at Societe Generale.Stocks in Bangkok also fell 1.5% and the Thai baht eased 0.3% after the country’s Prime Minister Paetongtarn Shinawatra was sacked for an ethics breach - a telephone call, during which she appeared to kowtow to Cambodia’s powerful former leader Hun Sen.WAITING ON PCEThe broader market focus is now on the soon-to-be-released U.S. PCE price index data - the Fed’s preferred measure of inflation.Economists polled by Reuters expect the index to stay steady at 2.6% in July from the month before. Excluding volatile items like food and energy, however, the index is expected to rise 2.9%, up from 2.8% in June.Khoon Goh, head of Asia research at ANZ, said analysts would be looking to see whether the impact of trade tariff increases is starting to show.\"There are three important pieces of data ahead of the September FOMC. So there’s the PCE, then there’s the payrolls number next week, and then the CPI reading.\"Traders are currently pricing in an 85% chance of a rate cut in September, up from 63% a month earlier, according to the CME FedWatch tool.Fed Governor Christopher Waller on Thursday said he wants to start cutting interest rates next month and \"fully expects\" more rate cuts to follow, to bring the Fed’s policy rate closer to a neutral setting.The heightened expectations of imminent Fed rate cuts left the dollar on course for a monthly fall of 2% against a basket of currencies on Friday.The euro was last down 0.2% at $1.1661, pressured in part by the political and fiscal worries in France, while sterling eased 0.4% to $1.3458, though was set for a monthly gain of more than 2%.The dollar was also battling headwinds from worries about Fed independence as Trump steps up his campaign to exert more influence over monetary policy, including his latest attempt to fire Fed Governor Cook.Cook filed a lawsuit on Thursday claiming Trump has no power to remove her from office.Elsewhere, oil markets saw Brent crude futures drop 0.6% to $68.20 a barrel and U.S. crude dip to $64.21. [O/R] Safe-haven gold was down 0.2% at $3,408.78 an ounce, while bitcoin fell 2% to just under 110,000 per dollar. [GOL/]Get an up-to-the-minute summary from WarrenAI, our powerful AI financial researcher. It's just like ChatGPT for investors, but with access to 1,200+ premium metrics spanning 10 years of data to instantly screen fundamentals, summarize breaking news, and reveal what Wall Street analysts are really saying about 688256.      Ask questions in your own language and get insider answers in seconds. Think of it as your experienced investment partner—always ready to help you think through every angle of 688256.", "analysis": 1}, "41": {"title": "Oil prices fall on expected weaker demand, but set for weekly gain", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-prices-fall-on-demand-concerns-but-headed-for-weekly-gain-4215765", "date": "2025-08-29T12:12:28+00:00", "body": "By Seher Dareen(Reuters) -Oil prices fell on Friday, but were set for a weekly gain, tugged between uncertainty about Russian supply and expectations of lower demand as the summer driving season in the United States, the world’s biggest fuel consumer, nears its close. Brent crude futures for October delivery, which will expire on Friday, fell 40 cents, or 0.6%, to $68.22 by 1200 GMT, while the more active contract for November was down 19 cents, or 0.3%, to $67.79. West Texas Intermediate crude futures were down 20 cents, or around 0.3%, at $64.4.Brent was up 0.7% so far for the week, while WTI was up around 1.2%.The market was in part shifting its focus towards next week’s OPEC+ meeting, said Tamas Varga, analyst at PVM Oil Associates.Crude output has increased from the Organization of the Petroleum Exporting Countries and its allies, known as OPEC+, as the group has accelerated output hikes to regain market share, raising the supply outlook and weighing on global oil prices.Prices rose earlier in the week due to Ukrainian attacks on Russian oil export terminals.U.S. crude inventories for the week ending August 22 showed higher-than-expected draws, implying late-summer demand was still firm, particularly in industrial and freight-related sectors, analyst Ole Hvalbye at SEB bank said in a note. [EIA/S]However, the end of U.S. summer driving demand with the Labor Day holiday on Monday, and more supply from major OPEC+ producers becoming available, have weighed on prices.Commonwealth Bank of Australia commodities analyst Vivek Dhar in a note forecast Brent oil futures falling to $63 a barrel in the fourth quarter of 2025.Investors are also watching for India’s response to pressure from the U.S. to stop buying Russian oil, after U.S. President Donald Trump doubled tariffs on imports from India to as much as 50% on Wednesday.So far, India has defied the U.S., and Russian oil exports to India are set to rise in September, traders said.\"The prevalent view is that Russian sanctions are not forthcoming, and India will ignore U.S. sanction threats and continue buying Russian crude oil at heavily discounted prices,\" PVM’s Varga added.AI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.      Year to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).      Which stock will be the next to soar?", "analysis": 2}, "42": {"title": "Oil faces uphill struggle as supply glut worries mount: Reuters poll", "source": "investing", "link": "https://www.investing.com/news/commodities-news/oil-faces-uphill-struggle-as-supply-glut-worries-mount-reuters-poll-4216366", "date": "2025-08-29T11:06:37+00:00", "body": "By Brijesh Patel(Reuters) -Oil prices are unlikely to gain much traction from current levels this year as rising output from top producers adds to the risk of a surplus and U.S. tariff threats curb demand growth, a Reuters poll showed on Friday.A survey of 31 economists and analysts conducted in August forecasts Brent crude will average $67.65 per barrel in 2025, little changed from July’s $67.84 forecast. The global benchmark has averaged around $70 so far this year.U.S. crude is seen at $64.65, compared with last month’s $64.61 estimate.\"(With) the latest OPEC+ supply increases and the expected lackluster global demand, the prospect is for an even larger market surplus in 2025,\" said Moutaz Altaghlibi, senior energy economist at ABN AMRO.He said the outlook remains clouded by \"deep uncertainty\" concerning any additional U.S. tariffs, especially those associated with geopolitical outcomes such as an Iranian nuclear deal or Russia agreeing to a ceasefire.Earlier this month, the Organization of the Petroleum Exporting Countries and its allies, together known as OPEC+, agreed to raise oil production by 547,000 barrels per day for September.\"OPEC+ probably still has not reached the end of their output hikes. At the moment, market share seems to be more important than a higher level of oil prices,\" said Frank Schallenberger, head of commodity research at LBBW.\"This will lead to a big supply surplus on oil markets in 2025 and 2026 and will keep prices down.\"Washington’s attempts to broker peace in Ukraine with Moscow have so far proven unsuccessful. Meanwhile, U.S. President Donald Trump has imposed additional tariffs on India, pressuring New Delhi to stop buying Russian oil.Most of the poll respondents see limited impact on the oil market from Trump’s threats on Russian crude buyers, as they expect OPEC+ and alternative suppliers could mitigate supply gaps.However, the geopolitical risk premium is expected to underpin oil prices as a quick Russia-Ukraine ceasefire deal seems highly unlikely, analysts said.Global oil demand is seen growing by between 500,000 and 1.1 million bpd in 2025, the poll showed, compared to the International Energy Agency forecast of 680,000 bpd.Meanwhile, OPEC raised its global oil demand forecast for next year and trimmed its estimate for growth in supply from the U.S. and other producers outside the wider OPEC+ group.\"U.S. production is an interesting one as President Trump would like to push for more production, but OPEC+ may be right in their projections. The reason around this is price,\" said Zain Vawda, analyst at MarketPulse by OANDA.The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 2}, "43": {"title": "TSX seen lower ahead of Canadian GDP, U.S. PCE data", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/tsx-seen-lower-ahead-of-canadian-gdp-us-pce-data-4216321", "date": "2025-08-29T11:00:25+00:00", "body": "Investing.com - Canada’s main stock exchange futures edged lower Friday, as investors focused on growth data as well as important U.S. inflation numbers. Toronto Stock Exchange’s S&P/TSX composite index closed Thursday under 2 points, higher at 28,434.80, at a record closing high, and the S&P/TSX 60 index standard futures contract fell Friday.Canadian stocks have climbed to record highs this week, boosted by solid earnings from the country’s main banks.Attention now turns to economic data, with Canada’s gross domestic product report expected to show a sharp cooling in the second quarter from the annualized 2.2% gain in the first three months this year.Statistics Canada’s advance estimates of monthly output through June pointed to a hefty drop in output, given spring saw a surge in U.S. tariffs that rattled business and consumer confidence.In the U.S., the spotlight will be on the release of the U.S. personal consumption expenditures (PCE) price index, the Federal Reserve’s preferred inflation gauge, later in the session, as they seek more clarity on the path for interest rates for the rest of the year.Expectations are for the core PCE price index to have stayed steady at 0.3% on a monthly basis, putting the annual rate at 2.9%, reaching its highest level in five months.However, there is the risk the data may reveal more evidence of U.S. President Donald Trump’s sweeping tariffs filtering into consumer prices, following a recent upside surprise in producer inflation.Oil prices slipped lower, but are set for a weekly gain, as traders weigh uncertainty over Russian supply as well as the proximity to the end of the important U.S. summer driving season.At 06:55 ET, Brent futures slipped 0.5% to $67.62 a barrel, and U.S. West Texas Intermediate crude futures fell 0.5% to $64.26 a barrel.Both contracts are on course for weekly gains of just under 1%, with the lack of a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky raising doubts about the peace process.On a broader scale, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries.Gold prices fell slightly on Friday, but were sitting on strong gains in August amid increasing bets on a September interest rate cut by the Federal Reserve.Spot gold fell 0.4% to $3,404.89 an ounce, while gold futures for October fell 0.3% to $3,463.65/oz. Spot gold was trading up 3.7% in August, and was now less than $100 away from its April record high. The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 1}, "44": {"title": "European stocks slip lower; key inflation data in spotlight", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/european-stocks-slip-lower-key-inflation-data-in-spotlight-4215988", "date": "2025-08-29T08:15:15+00:00", "body": "Investing.com - European stocks fell Friday, as investors digested consumer price increases from some of the region’s biggest economies ahead of the release of the Federal Reserve’s preferred inflation gauge. At 04:10 ET (08:10 GMT), the DAX index in Germany dropped 0.6%, the CAC 40 in France slipped 0.7% and the FTSE 100 in the U.K. fell 0.4%. European, U.S. inflation in spotlight Data released earlier Friday showed that French consumer prices rose slightly less than anticipated in August, with the country’s harmonised inflation rate coming in at +0.8% year-on-year in August, down from a +0.9% rise in July.Spain’s European Union-harmonised 12-month inflation rate remained at 2.7% in August, from the period through July, and the equivalent German data is scheduled for later in the session, ahead of the flash August reading for the euro area next Tuesday.The European Central Bank left its key rate at 2% at its July meeting, and data since then has confirmed the eurozone economy was holding up while inflation hovered at the ECB’s 2% target.ECB policymakers are widely expected to hold rates unchanged again in September, but the minutes from the July meeting showed that they were divided on whether inflation was more likely to come in higher or lower moving forward.The U.S. personal consumption expenditures report, the Fed’s preferred inflation gauge, will take centre-stage later in the day, and could shed light on how recent U.S. tariffs have affected prices. In the European corporate sector, Remy Cointreau (EPA:RCOP) raised the lower end of its annual guidance after the United States and European Union agreed to cut planned tariffs on European wines and spirits in half, easing pressure on the French cognac maker’s earnings.The revised trade agreement, effective August 1, set tariffs at 15%, down from the initially proposed 30%. Norwegian construction company  Af Gruppen  (OL:AFGA) reported a sharp rise in profit for the second quarter of 2025, and Swedish property company  Sagax  (ST:SAGAa) acquired a 10.8% stake in Belgium-based  Retail Estates  (EBR:RETE).Oil prices slipped lower, but are set for a weekly gain, as traders weigh uncertainty over Russian supply as well as the proximity to the end of the important U.S. summer driving season.At 04:10 ET, Brent futures slipped 0.5% to $67.66 a barrel, and U.S. West Texas Intermediate crude futures fell 0.5% to $64.30 a barrel.Both contracts are on course for weekly gains of just under 1%, with prices gaining after Ukrainian attacks on Russian oil export terminals raised doubts about Russian supply, while the lack of a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky raised doubts about the peace process.However, the end of the U.S. summer driving demand period with the Labor Day holiday on Monday have weighed on prices.On a broader scale, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries.  Most investors will find it hard to answer that question with total confidence. Short of a guarantee, which no one can give you, the most successful traders stick to proven best practices without letting hype or hyper-vigilance take over their better judgment.      But that doesn't mean you can't use smart shortcuts. If you're considering RCOP, try chatting with WarrenAI, our powerful AI financial assistant.    It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.      Even if you end up going with your gut feeling, at least you'll know why.", "analysis": 1}, "45": {"title": "U.S. PCE, European inflation and \"de minimis\" exemption - what’s moving markets", "source": "investing", "link": "https://www.investing.com/news/economy/us-pce-european-inflation-and-de-minimis-exemption--whats-moving-markets-4215935", "date": "2025-08-29T07:30:59+00:00", "body": "Investing.com - U.S. stock futures slipped slightly lower Friday ahead of the release of the Federal Reserve’s most-watched inflation gauge. There are also inflation numbers in Europe to digest, while the Trump administration has ended its \"de minimis\" exemption.Investors will focus on the release of the U.S. personal consumption expenditures (PCE) price index, the Federal Reserve’s preferred inflation gauge, later in the session, as they seek more clarity on the path for interest rates for the rest of the year.Expectations are for the core PCE to have stayed steady at 0.3% on a monthly basis, putting the annual rate at 2.9%.However, there is the risk the data may reveal more evidence of U.S. President Donald Trump’s sweeping tariffs filtering into consumer prices, following a recent upside surprise in producer inflation.The Fed lowered its policy rate by a full percentage point last year, but has held rates steady this year, citing worries that Trump’s higher tariffs could reignite inflation that is still running above the Fed’s 2% goal.Expectations are rife this stance is set to end in September with a 25-basis-point cut, though what happens after that remains uncertain.Fed Governor Christopher Waller said on Thursday he wants to start cutting rates next month and \"fully expects\" more rate cuts to follow to bring the Fed’s policy rate closer to a neutral setting.Waller and Fed Governor Michelle Bowman both dissented from the Fed’s decision to keep short-term borrowing costs unchanged in July. Both were appointed by Trump and are said to be under consideration as possible successors to Fed Chair Jerome Powell, amid market concerns of the politicisation of the central bank.Trump earlier this week announced he was firing Fed Governor Lisa Cook over what he said was possible mortgage fraud, a move Cook says is illegal and is suing to stop.U.S. stock futures slipped marginally lower, but remained on course for healthy monthly gains ahead of the release of important inflation data. At 03:20 ET (07:20 GMT), the S&P 500 futures traded 5 points, or 0.1%, lower Nasdaq 100 futures dropped 35 points, or 0.1%, and Dow futures fell 80 points, or 0.2%.The major indices enjoyed a winning session on Thursday, with the S&P 500 closing up 0.3% at an all-time high. The NASDAQ Composite added 0.5%, while the Dow Jones Industrial Average ended the day up about 0.2%, also a new record.They are also all on track for solid monthly gains, with the 30-stock Dow having logged a 3.4% advance so far in August. The S&P 500 is up 2.6% so far this month, and the tech-heavy Nasdaq has gained 2.8%.Investors will focus on key inflation data later in the session, with the release of the July personal consumption expenditures index [see above]. Investors will also digest results from the likes of Ulta Beauty (NASDAQ:ULTA), Ambarella (NASDAQ:AMBA) and  Affirm Holdings  (NASDAQ:AFRM).The Trump administration on Friday ended U.S. duty-free imports of packages worth less than $800, the so-called \"de minimis\" exemption that has fueled a surge in shipments from global sellers to U.S. consumers.President Donald Trump announced on July 30 the repeal of duty-free treatment of parcels from every country effective a month later, saying the exemption has enabled traffickers to easily send parcels containing fentanyl into the country. However, the de minimis exemption enabled a cross-border ecommerce surge, with 1.36 billion shipments arriving under de minimis with a declared value of $64.6 billion in fiscal 2024.According to U.S. government data, about 73% of de minimis packages entering the U.S. originated from China in 2024.U.S. consumers are now likely to face higher prices, with the tariffs makng shipments to the U.S. from overseas retailers more expensive, unless the sellers absorb the tariff costs.There are also important inflation numbers due in Europe during the session, with preliminary French, Spanish and German consumer prices in the spotlight.The European Central Bank left its key rate at 2% at its July meeting, and data since then has confirmed the eurozone economy was holding up while inflation hovered at the ECB’s 2% target.ECB policymakers are widely expected to hold rates unchanged again in September, but the minutes from the July meeting showed that they were divided on whether inflation was more likely to come in higher or lower moving forward, a foretaste of a debate set to come to a head in the coming months.A key element generating uncertainty is the impact of the U.S. tariffs on the European economies, after the Trump administration announced the imposition of 15% duties on EU goods imports.The ECB policymakers acknowledged this uncertainty \"would remain a key feature of the global and euro area economic outlook for some time to come\", but they disagreed on how big its impact would be on the economy.Oil prices slipped lower, but are set for a weekly gain, as traders weigh uncertainty over Russian supply as well as the proximity to the end of the important U.S. summer driving season.At 03:20 ET, Brent futures slipped 0.7% to $67.54 a barrel, and U.S. West Texas Intermediate crude futures fell 0.7% to $64.12 a barrel.Both contracts are on course for weekly gains of just under 1%, with prices gaining after Ukrainian attacks on Russian oil export terminals raised doubts about Russian supply, while the lack of a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky raised doubts about the peace process.However, the end of the U.S. summer driving demand period with the Labor Day holiday on Monday have weighed on prices.On a broader scale, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries.(Reuters contributed reporting.) ProPicks AI evaluates ULTA alongside thousands of other companies every month using 100+ financial metrics.      Using powerful AI to generate exciting stock ideas, it looks beyond popularity to assess fundamentals, momentum, and valuation. The AI has no bias—it simply identifies which stocks offer the best risk-reward based on current data with notable past winners that include Super Micro Computer (+185%) and AppLovin (+157%).      Want to know if ULTA is currently featured in any ProPicks AI strategies, or if there are better opportunities in the same space?", "analysis": 1}, "46": {"title": "India boosts US oil purchases on competitive prices, narrows trade deficit", "source": "investing", "link": "https://www.investing.com/news/commodities-news/india-boosts-us-oil-purchases-on-competitive-prices-narrows-trade-deficit-4215831", "date": "2025-08-29T05:48:54+00:00", "body": "By Nidhi Verma and Florence TanNEW DELHI/SINGAPORE (Reuters) -Indian refiners boosted U.S. crude oil purchases this month, drawn by competitive prices, trade sources said, a move that could help narrow the country’s trade deficit with the United States amid tensions between the two nations.The country’s top refiner, Indian Oil Corp, has bought 5 million barrels of U.S. West Texas Intermediate crude for delivery in October and November via a tender, trade sources said.This came after another state refiner Bharat Petroleum Corp purchased 2 million barrels of U.S. WTI crude while private refiner Reliance Industries has bought 2 million barrels of WTI crude from Vitol, other sources said.Indian refiners, along with others in Asia, stepped up purchases after the arbitrage window for U.S. crude to Asia opened. India is also under pressure to buy more U.S. oil after the United States doubled its tariffs on Indian imports to 50%, citing New Delhi’s buying of Russian oil.European traders Gunvor and Equinor sold 2 million barrels each, while Mercuria sold 1 million barrels to IOC, the sources said.Meanwhile, BPCL has also made its first purchase of Nigerian Utapate oil as it expands its crude diet to include new grades, they added.Ask WarrenAI, our powerful AI financial research assistant. It's just like ChatGPT for investors, but with access to 10 years of company data, a built-in screener, Wall Street analysts' reports, and earnings call transcripts for real-time, vetted insights.    Get answers about BPCL and thousands of other assets within seconds.", "analysis": 2}, "47": {"title": "Crude Prices Recover on Geopolitical Concerns", "source": "barchart", "link": "https://www.barchart.com/story/news/34460911/crude-prices-recover-on-geopolitical-concerns", "date": "2025-08-28T14:20:00+00:00", "body": "October WTI crude oil (CLV25) on Thursday closed up +0.45 (+0.70%), and October RBOB gasoline (RBV25) closed up +0.0220 (+1.12%).Crude oil and gasoline prices recovered from early losses on Thursday and settled higher as short covering emerged following German Chancellor Merz's statement that a meeting between Russian President Putin and Ukrainian President Zelensky is unlikely to materialize.  Thursday's weaker dollar was also supportive of crude prices, as was a rally in the S&P 500 to a new record high, which shows confidence in the economic outlook that is bullish for energy demand.  Crude prices rallied on Thursday after German Chancellor Merz said a meeting between Russian President Putin and Ukrainian President Zelensky was unlikely to happen, which could prompt President Trump to ramp up secondary sanctions on Russian energy exports, thereby tightening global supplies.  On Tuesday, President Trump warned of \"an economic war\" on Russia if it does not seek to end the war.An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported Monday that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC+ will meet again on September 7.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.Wednesday's weekly EIA report showed that (1) US crude oil inventories as of August 22 were -5.2% below the seasonal 5-year average, (2) gasoline inventories were -0.3% below the seasonal 5-year average, and (3) distillate inventories were -14.8% below the 5-year seasonal average.  US crude oil production in the week ending August 22 rose by +0.4% w/w to 13.439 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "48": {"title": "Crude Oil Futures Rebound on EIA Report and Technical Support", "source": "barchart", "link": "https://www.barchart.com/story/news/34457289/crude-oil-futures-rebound-on-eia-report-and-technical-support", "date": "2025-08-28T11:09:00+00:00", "body": "WTI Crude Oil futures posted a solid rally yesterday, regaining about half of Tuesday’s move lower. The bullish price action can be attributed to technical support, a bullish EIA Yesterday’s EIA report tilted bullish. The EIA figures were as follows [thousand barrels]:Crude Oil: -2,392 vs -2,000 estimateGasoline: -1,236 vs -1,600 estimateDistillate: -1,786 vs +500 estimateRefinery Utilization:-2.00% vs -0.40% estimateDraws across all three categories gave the report a bullish tilt while Diesel demand continued to outperform. Overnight, the Russian-Ukrainian conflict heated up with Ukraine striking a major Russian refinery and Russia striking Ukraine. As we talked about last week after the peace summits, the West’s plans for security guarantees and troops in Ukraine would be a non-starter for Putin. With the India pressure still in the works, the EU is now considering similar secondary sanctions on third-party buyers of Russian oil. Catalysts are stacking up bullish again. Technical Analysis: Our key yesterday was a settlement and scaled buying above 63.40***. With that coming to fruition, our lean is increasingly bullish. Fundamentals and technicals are starting to support the odds of a run higher in crude. Subscribe to our daily Energy Update for essential insights into Crude Oil and more. Get expert technical analysis, proprietary trading levels, and actionable market biases delivered straight to your inbox. Sign up now for free futures market research from Blue Line Futures!SIGN UP FOR 2-WEEKS OF FREE RESEARCH", "analysis": 2}, "49": {"title": "Easing Global Supply Concerns Weigh on Crude Prices", "source": "barchart", "link": "https://www.barchart.com/story/news/34456226/easing-global-supply-concerns-weigh-on-crude-prices", "date": "2025-08-28T10:32:00+00:00", "body": "October WTI crude oil (CLV25) today is down -0.33 (-0.51%), and October RBOB gasoline (RBV25) is down -0.0122 (-0.62%).Crude oil and gasoline prices are under pressure today, with gasoline falling to a 1-week low.  Global crude supply concerns have eased and are weighing on prices after Russia announced that its Volgograd refinery, which can process 300,000 bpd of crude oil, will resume operations a week earlier than planned, as repairs to the refinery were made following drone attacks by Ukraine.  Today's weaker dollar is limiting losses in crude.Weakness in the crude crack spread is also weighing on oil prices.  The crack spread fell to a 2.5-month low today, discouraging refiners from purchasing crude oil and refining it into gasoline and distillates.  An increase in crude oil held worldwide on tankers is bearish for oil prices.  Vortexa reported Monday that crude oil stored on tankers that have been stationary for at least seven days rose by +11% w/w to 96.77 million bbl in the week ended August 22.Concerns about higher OPEC production are negative for crude prices after OPEC+ on August 2 endorsed an additional 547,000 bpd increase in its crude production for September 1.  OPEC+ is boosting output to reverse the 2-year-long production cut, gradually restoring a total of 2.2 million bpd of production by September 2026.  OPEC+ has 1.66 million bpd of supplies that are currently due to remain offline until late 2026.  OPEC+ will meet again on September 7.  OPEC July crude production fell by -20,000 bpd to 28.31 million bpd.Crude prices have support on concerns that the Russian-Ukrainian war will continue, which could keep restrictions on Russian crude exports in place, and even secondary restrictions could be added.  Russian Foreign Minister Lavrov stated on Sunday that no meeting is planned between the leaders of Russia and Ukraine, as \"there needs to be an agenda first\" for a meeting to take place.  \"This agenda is not ready at all.\"  Wednesday's weekly EIA report showed that (1) US crude oil inventories as of August 22 were -5.2% below the seasonal 5-year average, (2) gasoline inventories were -0.3% below the seasonal 5-year average, and (3) distillate inventories were -14.8% below the 5-year seasonal average.  US crude oil production in the week ending August 22 rose by +0.4% w/w to 13.439 million bpd, modestly below the record high of 13.631 million bpd posted in the week of 12/6/2024.Baker Hughes reported last Friday that the number of active US oil rigs in the week ending August 22 fell by -1 to 411 rigs, just above the 3.75-year low of 410 rigs from August 1.  Over the past 2.5 years, the number of US oil rigs has fallen sharply from the 5.25-year high of 627 rigs reported in December 2022. ", "analysis": 2}, "50": {"title": "Reliance boss Ambani urges Indian businesses to unite to counter geopolitical challenges", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/reliance-boss-ambani-urges-indian-133818570.html", "date": "2025-08-29T13:38:18+00:00", "body": "NEW DELHI (Reuters) -Mukesh Ambani, the chairman of Reliance Industries, India's most valuable company, said on Friday that Indian firms need to work together to shield the South Asian nation from external shocks and geopolitical risks. WHY IT'S IMPORTANT Reliance, which operates the world's biggest refining complex in the western state of Gujarat, is also India's top buyer of Russian oil.As a penalty for buying Russian oil, the United States on Wednesday doubled its tariffs on Indian goods to as high as 50%, among the highest imposed by Washington and roughly on par with those on Brazilian products, in a move economists say could badly hurt sectors such as textiles, leather goods and chemicals. BY THE NUMBERSReliance, which has significant exposure to the U.S., has a crude oil import deal of 500,000 barrels per day with Russian oil major Rosneft, the largest oil deal between India and Russia. CONTEXT \"The magnitude of the challenge is so large that all Indian businesses must work together with unity as a grand coalition - in the spirit of cooperation, mutual learning, and mutual support,\" Ambani said, without referring to any specific geopolitical challenges.\"India must become self-reliant to the maximum extent in key technologies, critical industries, and other vital sectors of the global economy,\" billionaire Ambani said in a speech at the company's annual general meeting.Ambani's comments came after Prime Minister Narendra Modi earlier this month urged Indians to move towards self-reliance and called on industries to manufacture everything from fertiliser and jet engines to electric vehicle batteries.(Reporting by Nidhi Verma and Sethuraman N R; Editing by Mayank Bhardwaj, Kirsten Donovan)", "analysis": 1}, "51": {"title": "Imperial Petroleum Inc. Announces the Date for the Release of Second Quarter and Six Months 2025 Financial and Operating Results, Conference Call and Webcast", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/imperial-petroleum-inc-announces-date-132000463.html", "date": "2025-08-29T13:20:00+00:00", "body": "ATHENS, Greece, Aug. 29, 2025 (GLOBE NEWSWIRE) -- Imperial Petroleum Inc. is a ship-owning company providing petroleum products, crude oil and drybulk seaborne transportation services, announced today that it will release its second quarter and six months financial and operating results for the period ended June 30, 2025 before the market opens in New York on September 5, 2025.On September 5, 2025 at 10:00 am ET, the company’s management will host a conference call to discuss the results and the company’s operations and outlook.Conference Call details:Conference call participants should pre-register using the below link to receive the dial-in numbers and a personal PIN, which are required to access the conference call.Online Registration: https://register-conf.media-server.com/register/BI304534da4780408a9b0922b734574b98Slides and audio webcast:There will also be a live and then archived webcast of the conference call, through the IMPERIAL PETROLEUM INC. website (www.imperialpetro.com). Participants to the live webcast should register on the website approximately 10 minutes prior to the start of the webcast.ABOUT IMPERIAL PETROLEUM INC.IMPERIAL PETROLEUM INC. is a ship-owning company providing petroleum products, crude oil and drybulk seaborne transportation services. The Company owns a total of nineteen vessels on the water - seven M.R. product tankers, two suezmax tankers, three handysize drybulk carriers, five supramax drybulk carriers and two kamsarmax drybulk vessels - with a total capacity of 1,195,000 deadweight tons (dwt) and has contracted to acquire an additional two handysize drybulk carriers and a post panamax drybulk carrier of 164,400 dwt aggregate capacity. Following these deliveries, the Company’s fleet will count a total of 22 vessels with an aggregate capacity of 1.4 million dwt. IMPERIAL PETROLEUM INC.’s shares of common stock and 8.75% Series A Cumulative Redeemable Perpetual Preferred Stock are listed on the Nasdaq Capital Market and trade under the symbols “IMPP” and “IMPPP,” respectively.Company Contact:Fenia SakellarisIMPERIAL PETROLEUM INC.info@imperialpetro.com", "analysis": 2}, "52": {"title": "Oil Prices Aren't Likely To Rise Anytime Soon", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/oil-prices-likely-rise-anytime-130000003.html", "date": "2025-08-29T13:00:00+00:00", "body": "Rising supply from both OPEC+ and non-OPEC+ producers, slowing demand growth after the peak summer consumption, and uncertainties about demand amid inconsistent U.S. trade and tariff policies are set to keep oil prices subdued around current levels, analysts said in the monthly Reuters poll released on Friday.The price of Brent Crude, the international benchmark, is expected to average $67.65 per barrel this year, according to nearly three dozen economists and analysts surveyed by Reuters. The forecast in the August poll is slightly lower compared to $67.84 expected in July.So far this year, Brent crude oil prices have averaged around $70 per barrel, while they traded in the $67-$68 range on Friday.The analysts polled by Reuters expect the U.S. benchmark, WTI Crude, to average $64.65 per barrel this year, compared to $64.61 a barrel projected in the July survey.Early on Friday, WTI prices were in the $64 per barrel handle, as is the forecast in the Reuters poll.Both benchmarks were trading down on Friday morning ET, but they were on track to extend a weekly gain from last week.Analysts in the Reuters poll cited the OPEC+ supply hikes, the end of the peak demand season, and the uncertainty about demand stemming from the often unpredictable U.S. trade policies as key bearish drivers for prices.“Crude prices remain range-bound, with geopolitical tensions being more than offset by expectations for an oversupplied market into the final quarter and beyond, as eight OPEC+ producers take aim at their raised production targets,” analysts at Saxo Bank wrote in a note on Friday.Major investment banks expect Brent and WTI prices to slide in the fourth quarter of 2025 and the first quarter of 2026 amid a growing market oversupply. Banks including Goldman Sachs, Morgan Stanley, and JPMorgan see Brent prices averaging $63.57 per barrel in the fourth quarter, a survey compiled by The Wall Street Journal showed this week. The banks expect the WTI price to average just above $60 per barrel, at $60.30, in the fourth quarter.By Michael Kern for Oilprice.comMore Top Reads From Oilprice.comEurope Jet Fuel Imports From Asia Hit Record HighGuyana's Oil Boom Fuels Contentious Reelection BidCitgo Auction Heats Up as Bidder Sweetens OfferRead this article on OilPrice.com", "analysis": 2}, "53": {"title": "Looking for Income? 3 Oil Dividend Plays Yielding Over 4%", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/looking-income-3-oil-dividend-123200291.html", "date": "2025-08-29T12:32:00+00:00", "body": "Oil prices have remained volatile, though they are still on track to extend last week’s gains. Brent crude was recently trading in the high $60s per barrel, while U.S. West Texas Intermediate hovered at around $65 per barrel. The move reflects seasonal factors such as the end of the U.S. summer driving season, alongside the ongoing uncertainty around tariffs on Indian exports and sanctions on Russian crude. These crosscurrents continue to inject unpredictability into the energy market.For investors, such volatility makes picking stable energy plays even more critical. High-yielding, large-cap energy stocks — defined as companies with a market capitalization of $10 billion or more — often provide a cushion against turbulent markets, as their scale and cash generation can support dividends through cycles. In particular, companies like Canadian Natural Resources Limited CNQ, Chevron CVX, and Kinder Morgan KMI stand out for maintaining yields above 4%. These payouts not only reward patient investors but also signal balance sheet strength and operational resilience.Well-established energy giants bring financial resilience, global recognition and strong analyst coverage to the table. Their steady dividend payouts add to the appeal, particularly for investors focused on reliable income. For anyone seeking consistency and a long-term track record of performance, these large-cap names remain a compelling choice.While they may not deliver the explosive growth that smaller firms occasionally achieve, large-cap stocks provide a cushion against volatility. This balance of stability and dependable returns makes them especially suited for investors looking to avoid the sharp swings often seen in commodity-driven markets.Image Source: Zacks Investment ResearchCanadian Natural Resources: It is one of Canada’s largest independent energy companies, with a broad portfolio spanning crude oil, natural gas, and natural gas liquids. Its operations extend across Western Canada, the U.K. sector of the North Sea, and offshore West Africa. The company has built scale over decades, balancing growth with disciplined financial management and a strong commitment to safe, efficient operations.With a long-life, low-decline asset base, Canadian Natural generates steady cash flows while maintaining flexibility in capital allocation. Its diverse mix of light and heavy oil, bitumen, synthetic crude, and natural gas supports resilience across commodity cycles. A strong balance sheet and operational efficiency underpin sustainable shareholder returns, while investments in oil sands, thermal projects, and enhanced recovery techniques reinforce its position as a top-tier global independent energy producer.The Calgary-based CNQ beat the Zacks Consensus Estimate for earnings in three of the last four quarters and missed in the other, the average being 7.1%. Canadian Natural has a market capitalization of roughly $65.4 billion.A major incentive for holding the CNQ stock is the dividend. With a quarterly payout of 58.75 Canadian cents, CNQ shares currently yield 5.4% annually, well above the Zacks Oil/Energy sector average of 3.8%. Reflecting a shareholder-friendly nature, the Zacks Rank #1 (Strong Buy) company recently hiked its payout by 4% earlier this year.You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.Chevron: Chevron is one of the world’s largest integrated energy companies, with operations spanning exploration, production, refining and chemicals. With roots dating back to 1879, the company has built a diversified global footprint across the United States, Asia-Pacific, Africa, the Middle East, and South America. Its upstream portfolio remains the primary growth engine, while downstream and chemical operations provide balance and additional value.The company emphasizes disciplined capital allocation, efficiency and strong shareholder returns, targeting steady production growth alongside a lower carbon future. By leveraging its scale, advantaged assets, and partnerships, Chevron continues to deliver long-term value through sustainable free cash flow, portfolio resilience, and a balanced mix of oil, gas, and chemical businesses. Its strategy reflects a clear focus on maintaining competitiveness while navigating both today’s energy needs and the broader energy transition.Chevron beat the Zacks Consensus Estimate for earnings in three of the last four quarters. The Zacks Rank #3 (Hold) company has a market capitalization of more than $275 billion.With a quarterly payout of $1.71 per share, the CVX stock has a 4.3% dividend yield, above the generous sector average and significantly over the S&P 500’s 1.1% average.Kinder Morgan: It is one of North America’s largest energy infrastructure companies, with operations spanning pipelines, storage, terminals and CO2 transportation. Founded in 1997 and headquartered in Houston, TX, Kinder Morgan manages a vast network, including roughly 79,000 miles of pipelines and significant natural gas storage capacity. Its infrastructure transports natural gas, crude oil, refined products, and other essential commodities that fuel the economy.Beyond transportation, Kinder Morgan operates terminals that handle petroleum products, chemicals, coal and bulk materials. It is also a major player in enhanced oil recovery through its CO2 segment. The company’s extensive take-or-pay contract mix provides stability in cash flows, while its exposure to natural gas and the expanding LNG trade positions it for long-term growth. Financial flexibility and scale allow Kinder Morgan to remain a cornerstone of U.S. midstream energy infrastructure.Kinder Morgan, carrying a Zacks Rank of 3, is valued at some $60 billion. The energy infrastructure provider‘s 2025 earnings per share indicate 10.4% year-over-year growth.KMI pays out a quarterly dividend of 29.25 cents, which gives it a 4.3% yield at the current stock price.", "analysis": 1}, "54": {"title": "Stocks decline, US Treasury yields rise; US inflation data mostly in line", "source": "investing", "link": "https://www.investing.com/news/economy-news/asia-upbeat-on-wall-st-boost-as-markets-await-us-inflation-data-4215770", "date": "2025-08-29T14:54:25+00:00", "body": "By Caroline ValetkevitchLONDON (Reuters) -Major stock indexes eased while U.S. Treasury yields rose on Friday, with U.S. inflation data largely in line with economists’ views and keeping expectations of a September interest rate cut intact.U.S. stock index futures trimmed losses after the data, while the U.S. dollar index pared gains a little. But the S&P 500 was last down 0.7%, with technology shares leading the way lower. Shares of Dell Technologies were down more than 9% following its results and guidance.The U.S. Commerce Department said on Friday its Personal Consumption Expenditures Price Index (PCE) rose 0.2% in July, versus an unrevised 0.3% increase in June and matching the estimate of economists polled by Reuters.In the 12 months through July, PCE inflation increased 2.6% after climbing 2.6% in June. Stripping out the volatile food and energy components, the so-called core PCE Price Index increased 0.3% last month. That followed a 0.3% rise in the core inflation in June.\"You have to love it when a plan comes together. Today’s numbers on both the personal consumption, expenditure, and income, and spending, were right down the middle of the fairway,\" Art Hogan, chief markets strategist for B. Riley Wealth in Boston, said via email.\"This leaves the door wide open for the Fed to cut rates in September and likely again in October and in December.\"Fed funds futures traders are now pricing in 89% odds of a cut next month, up from 84% before the data.Traders had increased bets on more cuts after Fed Chair Jerome Powell last Friday adopted an unexpectedly dovish tone.The Dow Jones Industrial Average fell 205.66 points, or 0.45%, to 45,431.24, the S&P 500 fell 44.52 points, or 0.68%, to 6,457.34 and the Nasdaq Composite fell 232.19 points, or 1.07%, to 21,472.97.MSCI’s gauge of stocks across the globe fell 5.43 points, or 0.57%, to 950.91.The pan-European STOXX 600 index fell 0.53%.Earlier, shares in China notched up their best month in almost a year with a more than 10% gain on hopes that its economy, especially the tech sector, is picking up. The euro was last down 0.19% at $1.166. Against the Japanese yen, the dollar strengthened 0.2% to 147.22. The dollar index, which measures the greenback against a basket of currencies, was up slightly at 98.06.While U.S. Treasury yields rose on the day, interest rate sensitive two-year yields were on track for their largest monthly drop in a year, with major U.S. financial markets closed for the Labor Day holiday on Monday.The 2-year note  yield was last up 0.2 basis points on the day at 3.637%. It has fallen 32 basis points this month, the most since last August.The yield on benchmark U.S. 10-year notes  rose 2.3 basis points to 4.23%.Germany’s 30-year yield (DE30YT=RR), which touched its highest since 2011 earlier in August, has risen 12 basis points this month, putting it on track for its biggest monthly jump since March, when a historic move towards looser fiscal policy sent bond yields surging. Bond yields move inversely with prices.Fed Governor Christopher Waller on Thursday said he wanted to start cutting interest rates next month and \"fully expects\" more rate cuts to follow, to bring the Fed’s policy rate closer to a neutral setting.Oil prices were lower but set for a weekly gain. U.S. crude fell 0.33% to $64.39 a barrel and Brent fell to $68.24 per barrel, down 0.55% on the day.", "analysis": 1}, "55": {"title": "US crude oil production reaches record high in June, EIA reports", "source": "investing", "link": "https://www.investing.com/news/commodities-news/us-crude-oil-production-reaches-record-high-in-june-eia-reports-93CH-4216919", "date": "2025-08-29T14:52:33+00:00", "body": "Investing.com -- U.S. crude oil production reached a record high in June, according to data released Friday by the Energy Information Administration (EIA).Oil output rose by 133,000 barrels per day (bpd) to reach 13.58 million bpd during the month, marking a new production milestone for the country.The EIA also reported that U.S. product supplied of crude oil and petroleum products, which serves as a proxy for demand, increased in June to its highest level since October 2024.Gasoline demand showed strength as well, with product supplied rising to levels not seen since July 2024.Jet fuel demand posted an even more notable recovery, with product supplied in June climbing to its highest point since August 2018, indicating robust activity in the aviation sector.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 2}, "56": {"title": "U.S. stocks slip lower as investors bank profits; PCE data in line", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/us-stock-futures-edge-lower-after-sp-500-hits-record-high-pce-data-in-focus-4215753", "date": "2025-08-29T12:49:23+00:00", "body": "Investing.com-- U.S. stocks fell Friday, falling back from record levels as investors bank profits after a solid month amid few signs of excessive inflationary pressures. At 09:35 ET (13:35 GMT), the Dow Jones Industrial Average fell 70 points, or 0.2%, the S&P 500 index dropped 16 points, or 0.3%, and the NASDAQ Composite slipped 98 points, or 0.5%.The major indices were all on track for solid monthly gains, with the 30-stock Dow having logged a 3.4% advance so far in August, reaching a record high. The S&P 500 is up 2.6% so far this month, also at a new all-time high, and the tech-heavy Nasdaq has gained 2.8%.Data released earlier Friday showed that the core PCE price index, the Federal Reserve’s preferred gauge of inflation, rose 0.3% on a monthly basis, putting the annual rate at 2.9%, its highest level in five months.This was in line with expectations, suggesting that U.S. President Donald Trump’s sweeping tariffs were not filtering excessively into consumer prices, despite a recent upside surprise in producer inflation.\"You can check this off as one more risk to potentially derailing a cut in September. The inflation part of it, at least in this measure, is not going to do anything to reduce odds of a cut in September,\" said Michael Lorizio at Manulife Investment Management.The Fed lowered its policy rate by a full percentage point last year, but has held rates steady this year, citing worries that Trump’s higher tariffs could reignite inflation that is still running above the Fed’s 2% goal.Bets on a September cut grew sharply after Fed Chair Jerome Powell acknowledged such a possibility, citing some recent cooling in the labor market. But Powell still remained largely non-committal towards future rate cuts, citing uncertainty over the inflation impact of President Donald Trump’s trade tariffs. In the corporate sector, Dell Technologies (NYSE:DELL) fell as weak current-quarter guidance largely overshadowed strong earnings.Amazon.com chip partner Marvell Technology (NASDAQ:MRVL) dropped sharply after posting disappointing guidance for the current quarter. Caterpillar  (NYSE:CAT) stock fell after the heavy-equipment maker forecast higher tariff-related expenses for 2025, as companies scramble to assess the impact of shifting U.S. trade policy. On the other hand, Autodesk (NASDAQ:ADSK) soared after the software developer clocked strong quarterly earnings. Ulta Beauty (NASDAQ:ULTA) stock rose after the beauty company raised its annual sales and profit forecast after topping quarterly sales estimates, banking on steady demand for makeup and skincare brands at its stores as well as lower inventory losses. Affirm Holdings  (NASDAQ:AFRM) stock soared after the buy-now-pay-later company crushed revenue estimates and delivered an upbeat forecast, boosted by resilient consumer spending.Oil prices slipped lower, but are set for a weekly gain, as traders weigh uncertainty over Russian supply as well as the proximity to the end of the important U.S. summer driving season.At 09:35 ET, Brent futures slipped 0.3% to $67.81 a barrel, and U.S. West Texas Intermediate crude futures fell 0.3% to $64.40 a barrel.Both contracts are on course for weekly gains of just under 1%, with prices gaining after Ukrainian attacks on Russian oil export terminals raised doubts about Russian supply, while the lack of a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky raised doubts about the peace process.However, the end of the U.S. summer driving demand period with the Labor Day holiday on Monday have weighed on prices.On a broader scale, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries.Ambar Warrick contributed to this articleGet an up-to-the-minute summary from WarrenAI, our powerful AI financial researcher. It's just like ChatGPT for investors, but with access to 1,200+ premium metrics spanning 10 years of data to instantly screen fundamentals, summarize breaking news, and reveal what Wall Street analysts are really saying about CAT.      Ask questions in your own language and get insider answers in seconds. Think of it as your experienced investment partner—always ready to help you think through every angle of CAT.", "analysis": 1}, "57": {"title": "US oil production hit record high in June, EIA says", "source": "finance.yahoo", "link": "https://finance.yahoo.com/news/us-oil-production-hit-record-150959936.html", "date": "2025-08-29T15:09:59+00:00", "body": "HOUSTON (Reuters) -U.S. crude oil production hit a record high in June, the Energy Information Administration said on Friday, rising 133,000 barrels per day to 13.58 million bpd.Product supplied of crude and petroleum products in the U.S., a proxy for demand, rose 684,000 bpd in June to its highest since October 2024, at 21 million bpd.Gasoline demand rose 205,000 bpd in June to 9.23 million bpd, its highest since July 2024, while jet fuel demand hit its highest since August 2018 over the same period, gaining 84,000 bpd to 1.85 million bpd.(Reporting by Georgina McCartney in Houston and Shariq Khan in New York; Editing by Ros Russell and Jan Harvey)", "analysis": 2}, "58": {"title": "Oil Futures On Track For Small Weekly Gains", "source": "finance.yahoo", "link": "https://finance.yahoo.com/m/a398b11b-3d6f-3f53-9527-a27681d92578/oil-futures-on-track-for.html", "date": "2025-08-29T14:14:00+00:00", "body": "Oil futures headed for moderate gains in a week of choppy trade marked by speculation over how much India may reduce its Russian oil purchases, wavering expectations for Russia-Ukraine peace talks, and a second straight draw in U.S. crude stockpiles.", "analysis": 1}, "59": {"title": "US oil production hit record high in June, EIA says", "source": "investing", "link": "https://www.investing.com/news/commodities-news/us-oil-production-hit-record-high-in-june-eia-says-4216936", "date": "2025-08-29T15:31:03+00:00", "body": "HOUSTON (Reuters) -U.S. crude oil production hit a record high in June, the Energy Information Administration said on Friday, rising 133,000 barrels per day to 13.58 million bpd.Product supplied of crude and petroleum products in the U.S., a proxy for demand, rose 684,000 bpd in June to its highest since October 2024, at 21 million bpd.Gasoline demand rose 205,000 bpd in June to 9.23 million bpd, its highest since July 2024, while jet fuel demand hit its highest since August 2018 over the same period, gaining 84,000 bpd to 1.85 million bpd.The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 2}, "61": {"title": "European stocks fall; key inflation data in spotlight", "source": "investing", "link": "https://www.investing.com/news/stock-market-news/european-stocks-slip-lower-key-inflation-data-in-spotlight-4215988", "date": "2025-08-29T15:58:47+00:00", "body": "Investing.com - European stocks fell Friday, as investors digested consumer price increases from some of the region’s biggest economies ahead of the release of the Federal Reserve’s preferred inflation gauge. The DAX index in Germany dropped 0.5%, the CAC 40 in France slipped 0.8% and the FTSE 100 in the U.K. fell 0.3%. European, U.S. inflation in spotlight Data released earlier Friday showed that French consumer prices rose slightly less than anticipated in August, with the country’s harmonised inflation rate coming in at +0.8% year-on-year in August, down from a +0.9% rise in July.Spain’s European Union-harmonised 12-month inflation rate remained at 2.7% in August, from the period through July, and the equivalent German data is scheduled for later in the session, ahead of the flash August reading for the euro area next Tuesday.The European Central Bank left its key rate at 2% at its July meeting, and data since then has confirmed the eurozone economy was holding up while inflation hovered at the ECB’s 2% target.ECB policymakers are widely expected to hold rates unchanged again in September, but the minutes from the July meeting showed that they were divided on whether inflation was more likely to come in higher or lower moving forward.The U.S. personal consumption expenditures report, the Fed’s preferred inflation gauge, took center stage later in the day. Data showed that the core PCE price index, the Federal Reserve s preferred gauge of inflation, rose 0.3% on a monthly basis, putting the annual rate at 2.9%, its highest level in five months. In the European corporate sector,  Remy Cointreau  (EPA:RCOP) raised the lower end of its annual guidance after the United States and European Union agreed to cut planned tariffs on European wines and spirits in half, easing pressure on the French cognac maker’s earnings.The revised trade agreement, effective August 1, set tariffs at 15%, down from the initially proposed 30%. Norwegian construction company Af Gruppen (OL:AFGA) reported a sharp rise in profit for the second quarter of 2025, and Swedish property company Sagax (ST:SAGAa) acquired a 10.8% stake in Belgium-based Retail Estates (EBR:RETE).Oil prices slipped lower, but are set for a weekly gain, as traders weigh uncertainty over Russian supply as well as the proximity to the end of the important U.S. summer driving season.At 11:55 ET, Brent futures slipped 0.4% to $67.69 a barrel, and U.S. West Texas Intermediate crude futures fell 0.5% to $64.28 a barrel.Both contracts are on course for weekly gains of just under 1%, with prices gaining after Ukrainian attacks on Russian oil export terminals raised doubts about Russian supply, while the lack of a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelensky raised doubts about the peace process.However, the end of the U.S. summer driving demand period with the Labor Day holiday on Monday have weighed on prices.On a broader scale, both contracts are set for monthly losses of over 6%, dragged by steady production hikes by the Organization of the Petroleum Exporting Countries.Get an up-to-the-minute summary from WarrenAI, our powerful AI financial researcher. It's just like ChatGPT for investors, but with access to 1,200+ premium metrics spanning 10 years of data to instantly screen fundamentals, summarize breaking news, and reveal what Wall Street analysts are really saying about RCOP.      Ask questions in your own language and get insider answers in seconds. Think of it as your experienced investment partner—always ready to help you think through every angle of RCOP.", "analysis": 2}, "62": {"type": "news", "title": "Does ConocoPhillips Offer Value After Positive Free Cash Flow Projections for 2025?", "source": "finance.yahoo", "news": "2025-08-31T10:11:21.000Z", "body": "Trying to size up ConocoPhillips can feel like standing at the crossroads of opportunity and uncertainty. Whether you are debating a new buy, holding steady, or even considering trimming your stake, the stock’s latest action has likely caught your attention. After a choppy start to the year, ConocoPhillips closed at $98.97 recently and has put together a modest 2.3% gain over the last week, alongside a 6.7% lift in the past month. The broader outlook is more nuanced, with shares slipping 1.1% year to date and down 10.2% over the last year, yet up an impressive 231.4% across five years. Some of these moves can be traced to shifting oil prices and new optimism over global demand, as markets keep recalibrating their expectations for energy producers like ConocoPhillips.Valuation matters, and ConocoPhillips currently earns a value score of 4 out of 6, which indicates it is undervalued in four different assessment checks. But what does that really mean for your portfolio? Here is a closer look at each of the major ways stocks like this are valued, followed by a consideration of whether there might be an even smarter approach waiting at the end.Why ConocoPhillips is lagging behind its peersThe Discounted Cash Flow (DCF) model estimates a company's intrinsic value by projecting its future cash flows and discounting them back to today’s dollar value. This approach aims to gauge what the business is truly worth on a standalone basis, regardless of temporary market ups and downs.For ConocoPhillips, the current Free Cash Flow sits at $8.64 Billion. Analysts forecast the company’s annual cash flows to grow, with projections reaching $9.98 Billion by 2029. Looking further ahead, extended estimates suggest that by 2035, ConocoPhillips could be generating over $12.75 Billion a year in free cash. These projections are based on both analyst estimates for the next five years as well as automated extrapolations beyond that. All of these figures feed into the company’s DCF valuation.Taking these numbers into account, the DCF model calculates ConocoPhillips’ intrinsic value at $193.21 per share. With the stock trading at $98.97, this model suggests the shares are trading at a 48.8% discount to their underlying value.Result: UNDERVALUEDHead to the Valuation section of our Company Report for more details on how we arrive at this Fair Value for ConocoPhillips.Our Discounted Cash Flow (DCF) analysis suggests ConocoPhillips is undervalued by 48.8%. Track this in your watchlist or portfolio, or discover more undervalued stocks.", "analysis": 1}, "63": {"type": "news", "title": "Does Analyst Caution and Digital Investment Signal a Shift in Schlumberger's Strategy Outlook (SLB)?", "source": "finance.yahoo", "news": "2025-08-31T10:08:33.000Z", "body": "In recent days, Schlumberger has faced heightened analyst caution ahead of its latest earnings report, as consensus forecasts point to a year-over-year decline in both earnings per share and revenue, amid broad industry challenges and weaker oil prices.Despite this negative sentiment, the company continues to invest in digital and AI-driven solutions, underscored by its acquisition of Stimline Digital AS to enhance operational efficiency.We'll examine how increased analyst pessimism and sector headwinds could reshape Schlumberger's investment outlook moving forward.We've found 19 US stocks that are forecast to pay a dividend yield of over 6% next year. See the full list for free.To own Schlumberger shares, I believe you have to trust in the company's ability to benefit from digital transformation and rising international energy demand, even during sector slumps. Recent analyst caution tied to weaker oil prices and predicted earnings declines adds pressure to near-term share price expectations; however, these concerns do not materially change the core long-term catalyst, Schlumberger’s international and technology-driven business expansion, or the most significant risk, which remains exposure to global upstream spending cuts.Among recent announcements, Schlumberger’s acquisition of Stimline Digital AS stands out, as it directly supports the company’s digital and AI ambitions. While this move aligns with the company’s focus on building a more resilient, higher-margin revenue base, especially amid industry volatility, the most immediate catalysts for the stock will still hinge on macro energy demand and the trajectory of operator spending in key markets.By contrast, investors should also keep in mind the ongoing and potentially compounding risk if international operator spending...Read the full narrative on Schlumberger (it's free!)Schlumberger's outlook anticipates $38.7 billion in revenue and $4.9 billion in earnings by 2028. This is based on a projected annual revenue growth rate of 2.9% and an increase in earnings of $0.8 billion from current earnings of $4.1 billion.Uncover how Schlumberger's forecasts yield a $45.43 fair value, a 23% upside to its current price.Simply Wall St Community members calculated fair values for Schlumberger ranging from US$35 to US$66.34 across 13 different views. These diverse opinions reflect differing expectations about demand for digital solutions and the impact of energy spending, encouraging you to compare several perspectives before making decisions.", "analysis": 1}, "64": {"type": "news", "title": "How Recent Oil Price Swings Could Affect Cenovus Energy Shares in 2025", "source": "finance.yahoo", "news": "2025-08-31T10:07:56.000Z", "body": "If you are trying to decide what to do with Cenovus Energy stock, you are definitely not alone. While this Canadian energy giant traded at $22.84 at the last close, the real question is whether those shares are actually a bargain or not. The stock has experienced its share of ups and downs recently, rising 0.7% in the last week and 11.8% over the past month. Long-term investors who have held Cenovus for the past five years are up 317.0%. However, those who started investing just one year ago may feel less enthusiastic, as the stock is down 5.2% over that period. Part of this volatility appears tied to shifting market perceptions around oil prices and the broader energy sector, with investors reacting to global supply changes and hints of future demand. There is a sense that the risk profile for Canadian energy players like Cenovus is evolving, contributing to some of these rapid moves both up and down. Is Cenovus actually undervalued? After running the company through six key valuation checks, it receives a value score of 3. This means it appears undervalued in three out of six major categories, which may be considered a solid result for bargain hunters, though not definitive. To better understand what this score means for your Cenovus holding, it is helpful to look more closely at these valuation methods, examine what they indicate about the stock today, and consider a more comprehensive approach to valuation that goes beyond the numbers. Why Cenovus Energy is lagging behind its peersA Discounted Cash Flow (DCF) model attempts to estimate a company's intrinsic value by projecting its future cash flows and discounting those figures back to their value in today's terms. This helps investors determine what a company may truly be worth, beyond the day-to-day movement in its share price.For Cenovus Energy, the most recent reported Free Cash Flow is CA$3.77 billion. Analysts project steady FCF growth over time, with forecasts reaching CA$5.82 billion by 2028. Looking further out, extrapolated estimates suggest FCF could surpass CA$12.15 billion by 2035. These longer-term projections rely on a blend of analyst insights and calculated growth rates provided by financial platforms, including Simply Wall St.Based on the DCF model used, the estimated intrinsic value for Cenovus shares is CA$134.07. With the stock currently trading at CA$22.84, this implies a substantial 83.0% discount to fair value. Such a gap suggests the stock appears heavily undervalued according to this valuation approach.", "analysis": 1}, "65": {"type": "news", "title": "If You'd Invested $1,000 in ExxonMobil Stock 5 Years Ago, Here's How Much You'd Have Today", "source": "finance.yahoo", "news": "2025-08-31T09:21:00.000Z", "body": "Exxon Mobil stock traded sideways for years.The past five years, however, Exxon stock crushed the S&P 500.10 stocks we like better than ExxonMobil ›For years, ExxonMobil Corp (NYSE: XOM) was stuck in limbo. In 2007, for instance, Exxon stock traded at roughly $85 per share. In 2016, nearly a decade later, shares still traded at roughly $85 per share.The past five years, however, have been very different. Exxon shareholders have crushed the market. You may be surprised to learn just how much a $1,000 investment would have become since the summer of 2020.As one of the largest oil stocks in the world, Exxon is heavily dependent on the prevailing price of oil. Five years ago arguably marks the nadir of the oil price collapse that occurred due to uncertainty surrounding the ongoing global pandemic. In April of 2020, oil prices fell as low as $20 per barrel! By August of that year, prices had already rebounded to around $40 per barrel, but that was still one-third below pre-pandemic levels.Today, oil prices hover just above $60 per barrel due to rising costs and geopolitical tensions. Today's price level is roughly 50% higher than it was five years ago, but Exxon's stock price has risen significantly more.If you had invested $1,000 into Exxon stock in August 2020, you'd have around $3,460 today. That figure includes dividend income -- an important consideration given Exxon currently pays a dividend yield of 3.5%. Over the same time period, a $1,000 investment in the S&P 500 would have grown into just $2,000.Much of this outperformance stems from Exxon's continued investments throughout the last bear market. With greater access to capital, the company was able to invest at rock bottom prices, highlighting the company's capital advantage and savvy leadership. Exxon's CEO called these strategic moves \"counter-cyclical investments\" -- an appropriate term for a business that can deploy capital at every stage of a cyclical industry.Before you buy stock in ExxonMobil, consider this:The Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and ExxonMobil wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.Consider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $651,599!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,067,639!*", "analysis": 1}, "66": {"type": "news", "title": "Oil rig parts maker to close 80pc of UK arm over Labour ‘cult of carbon’", "source": "finance.yahoo", "news": "2025-08-31T07:00:00.000Z", "body": "Labour’s “cult of carbon” has forced one of Britain’s oldest oil companies to shed dozens of staff and shut down 80pc of its UK operations, according to its chief executive.Jim Johnson, the chief executive of 150-year-old oil and gas group Hunting, said he was being forced to close four of the company’s five UK centres including its main Scottish site because the Government had destroyed the North Sea offshore oil industry.He said the closures were directly linked to government windfall taxes and over-zealous regulations imposed on the industry to reach net zero.“Carbon reduction has become a religion for the UK – but even if Britain cuts its emissions to zero, it won’t make any difference to global CO2 levels,” he said.“Your politicians have sacrificed Britain’s future to the cult of carbon and it’s set to become a poorer, weaker country.”Hunting, one of the London Stock Exchange’s oldest listed companies, uses advanced engineering to make high pressure pipes for subsea oil and gas wells as well as for warplanes and spacecraft. It is best known for building the fuselages and trail frames for Britain’s Lancaster Bomber to help win the Second World War.Mr Johnson, an American, said swingeing tax raids on the oil and gas sector by successive UK governments over the past four years had crippled the North Sea.“Both your main parties [Labour and Conservative] have been hugely negligent for the UK’s future energy supplies. They have made some utterly ridiculous decisions,” he said.“Aberdeen was a global centre for oil and gas but it is being flushed down the toilet. I went to Norway recently – they have the same geology as the UK – and the attitude was ‘drill, baby, drill’, because there’s still lots of oil out there.”Hunting’s main loss will be its Fordoun facility in Scotland, which will be consolidated into its Badentoy site in Portlethen, near Aberdeen, with the loss of 40 jobs.Mr Johnson’s comments are directed partly at the previous Conservative government – which imposed an oil windfall tax in 2022 – but his main criticisms are aimed at Labour which raised total taxes to 78pc, cut some tax breaks and put a ban on drilling for new oil and gas.Like many other oil and gas companies, he is concerned about rapid changes in fiscal and regulatory policy. Such uncertainty makes it harder to raise money for investment and typically leads to higher borrowing rates, he said.", "analysis": 2}, "67": {"type": "news", "title": "Goldman Sachs sees Scandinavian currencies strengthening against dollar", "source": "investing", "news": "2025-08-31T10:22:44+00:00", "body": "Investing.com - Goldman Sachs expects both Norwegian krone (NOK) and Swedish krona (SEK) to strengthen against the U.S. dollar in coming months, with a slight preference for SEK, according to a recent research note.The investment bank views the current market environment as supportive for Scandinavian currencies, citing ongoing dollar hedging programs and global reallocations away from U.S. assets as beneficial trends. Goldman Sachs also anticipates both EUR/NOK and EUR/SEK exchange rates to gradually decline toward the firm’s three-month targets.The bank’s outlook is tempered by potential risks, noting that both currencies, particularly NOK, could underperform significantly during periods of reduced risk appetite or continued U.S. economic slowdown. For the Norwegian krone, these cyclical risks are further complicated by Goldman’s bearish outlook on oil prices in the coming months.Goldman Sachs identifies the Norwegian general election on September 8 as a key risk event for NOK. The firm highlights that the most significant currency impact could come from the success of parties advocating for looser restrictions on channeling foreign currency revenues from Norway’s sovereign wealth fund back into NOK and the domestic economy.The Progress Party in Norway has been campaigning on this platform, which could create upside potential for the currency if successful. However, Goldman considers significant wealth fund reform a low-probability outcome, citing historical resistance to changing the fund’s mandate and current polling that suggests no single party is likely to achieve a majority.This article was generated with the support of AI and reviewed by an editor. For more information see our T&C.The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 1}, "68": {"type": "news", "title": "Oil Weakens as Putin and Modi Huddle in China After US Tariff", "source": "finance.yahoo", "link": "finance.yahoo", "date": "2025-09-01T05:27:31.000Z", "body": "(Bloomberg) -- Oil declined following a monthly drop in August, with traders focused on concerns over a potential glut and signals over Russian supply.Brent fell toward $67 a barrel, while West Texas Intermediate was below $64. With Washington seeking to force India to halt imports of Russian oil by ratcheting up secondary tariffs, Indian Prime Minister Narendra Modi met with Vladimir Putin at a regional summit in China. In social-media comments, Modi said it was “always a delight” to meet with the Russian president.Most Read from BloombergSydney’s New Airport Will Take Travelers Into the WildAmtrak Debuts New High-Speed Acela Trains After Years of DelaysTrump Signs Order to ‘Make Federal Architecture Beautiful Again’NY Penn Station’s Long-Awaited Revamp to Start Work in 2027Parents Mobilize to Protect School Commutes Amid Trump Deployment in DCHeading into the meeting, New Delhi has defended its ties with Russia, calling Washington’s actions “unfair, unjustified and unreasonable.” At the same time, local refiners have not stopped taking Moscow’s crude, although there have been some opportunistic purchases of cargoes from the US.The global oil benchmark has shed about 10% this year, hurt by a deluge of additional supply from OPEC+, as well as concerns the US-led trade war will crimp energy demand. The producer group, which includes Russia, is scheduled to hold a virtual meeting on Sept. 7 to discuss its next move, with the International Energy Agency forecasting the market faces a record glut next year.“Attention now is on the upcoming OPEC+ meeting, where discussions will focus on the potential restoration of the remaining 1.65 million barrels a day of voluntary production cuts.” said Gao Mingyu, chief energy analyst at SDIC Essence Futures Co. “After the peak season is over, the pressure of oversupply in the oil market will become more pronounced.”In the US, hedge funds winnowed their bullish position on US crude to the lowest in about 18 years as uncertainty over economic policy compounded growing concerns about oversupply.The US measures against India are part of a wider drive to broker an end to the war in Ukraine, although Washington hasn’t targeted China with similar moves. At the weekend, White House trade adviser Peter Navarro kept up the pressure, telling Fox News Sunday that New Delhi was fueling “the Russian war machine” and “nothing but a laundromat” for the Kremlin.“If there are no further geopolitical disruptions, downward pressure on prices will increase,” said Gao.Most Read from Bloomberg Businessweek", "analysis": 2}, "69": {"type": "news", "title": "Oil Falls on Higher Supply Outlook", "source": "finance.yahoo", "link": "finance.yahoo", "date": "2025-09-01T01:02:00.000Z", "body": "Oil fell in early Asian trade. Investors are anticipating a rise in supply as OPEC+ unwinds their production cuts, UOB said.", "analysis": 1}, "70": {"type": "news", "title": "Oil holds in tight range as rising output offsets Russia supply disruptions", "source": "finance.yahoo", "link": "finance.yahoo", "date": "2025-09-01T00:55:41.000Z", "body": "By Florence TanSINGAPORE (Reuters) -Oil prices traded in a tight range on Monday as worries about rising output and the impact of U.S. tariffs on demand offset supply disruptions stemming from intensified Russia-Ukraine airstrikes.Brent crude fell 30 cents, or 0.44%, to $67.18 a barrel by 0500 GMT, while U.S. West Texas Intermediate crude was at $63.73 a barrel, down 28 cents, or 0.44%. Trading is expected to be muted due to a U.S. bank holiday.Ukrainian President Volodymyr Zelenskiy vowed on Sunday to retaliate by ordering more strikes deep inside Russia after Russian drone attacks on power facilities in northern and southern Ukraine. Both countries have intensified airstrikes in recent weeks, targeting energy infrastructure and disrupting Russian oil exports.Markets remained concerned about Russian oil flows, with weekly shipments from its ports dropping to a four-week low of 2.72 million barrels per day, according to tanker tracker data cited by ANZ analysts in a note.However, Russian oil exports to India are set to rise in September, traders said, despite secondary tariffs imposed on New Delhi by the U.S. for buying oil from Moscow.\"Modi’s meeting with Putin in China will be closely watched, particularly in light of U.S. pressures,\" Michael McCarthy, CEO of Moomoo Australia, said, referring to the Indian and Russian presidents who are attending the Shanghai Cooperation Organisation regional security bloc in China.A Reuters poll on Friday showed that oil prices are unlikely to gain much traction from current levels this year, as rising output from top producers adds to the risk of a surplus and U.S. tariff threats weigh on demand growth.The week started with a slew of manufacturing and export data from China, Japan and South Korea, among the world's biggest crude oil importers.Factory activity in China unexpectedly grew in August but weakened for other Asian economies as companies began to feel the pain from U.S. tariffs, private surveys showed on Monday, clouding the outlook for the region's fragile recovery.Brent and WTI crude posted their first decline in four months in August, down 6% or more on OPEC+ supply concerns.Investors are eyeing the September 7 meeting between members of the Organization of the Petroleum Exporting Countries and their allies for further supply cues.Meanwhile, U.S. crude oil production hit a record high in June, rising 133,000 barrels per day to 13.58 million bpd, according to data released by the Energy Information Administration on Friday.A U.S. labor market report this week will give a crucial read into the economy's health and test investors' confidence that interest rate cuts are coming soon, a view that has lifted their appetite for riskier assets such as commodities.(Reporting by Florence Tan; Editing by Himani Sarkar and Lincoln Feast.)", "analysis": 2}, "71": {"type": "news", "title": "Wall Street Forecasts Oil in the $50s Next Year", "source": "finance.yahoo", "link": "finance.yahoo", "date": "2025-08-31T23:00:00.000Z", "body": "The U.S. shale patch is trimming capital expenditure budgets to preserve cash amid the lower oil prices. American producers could further cut back on spending and activity if the prevailing forecasts of a global oversupply materialize in the coming months.Efficiency gains allow companies to pump more or equal volumes of crude with the same or reduced expenses.The pullback in activity – the number of operating rigs and frac crews has crumbled in recent months – is not showing yet in the U.S. oil production figures. The shale patch is now in the lag window of a few months before the price decline shows up in output.Efficiency gains are also pushing back production declines, but if the glut hits the global market and prices plunge in the $50s per barrel, the U.S. shale industry will likely curb drilling activity and cut capital budgets even more.The market consensus appears to be that the strong summer demand is at its peak, and come the fourth quarter, global oil consumption will slow, and rising supply will overwhelm the market.Growing supply from OPEC+ and higher output from South America will tip the market balance into oversupply toward the end of the year, analysts say.Despite geopolitical risks, Wall Street banks have lowered their oil price forecasts for later this year and the first quarter of 2026, expecting the glut to depress prices.Related: Oil Industry Gains Ground in California Regulatory BattleMajor investment banks, including Goldman Sachs, Morgan Stanley, and JPMorgan, see Brent Crude prices averaging $63.57 per barrel in the fourth quarter, a survey compiled by The Wall Street Journal showed this week. The projection is down from $64.13 expected in July and down from the Friday prompt price of about $68 a barrel.For WTI Crude, the banks expect the price to average just above $60 per barrel, at $60.30, in the fourth quarter, down from last month’s $61.11 a barrel and down compared to the current price of about $64 a barrel.Oil prices are set to further drop in the first quarter of 2026, with Brent at $62.73 and WTI at $59.65 per barrel, according to the Journal’s survey.The glut will diminish by the third quarter of 2026, the banks reckon, as excess supply shocks are absorbed during next summer’s peak demand period.But banks, analysts, and market participants expect oil supply to outstrip demand over the next six months, putting additional downward pressure on prices. This would make U.S. shale producers even more cautious with spending and budgets because a dip below $60 per barrel is threatening breakevens for drilling new wells.", "analysis": 2}, "72": {"type": "news", "title": "Oil holds in tight range as rising output offsets Russia supply disruptions", "source": "investing", "link": "investing", "date": "2025-09-01T05:12:33+00:00", "body": "By Florence TanSINGAPORE (Reuters) -Oil prices traded in a tight range on Monday as worries about rising output and the impact of U.S. tariffs on demand offset supply disruptions stemming from intensified Russia-Ukraine airstrikes.Brent crude fell 30 cents, or 0.44%, to $67.18 a barrel by 0500 GMT, while U.S. West Texas Intermediate crude was at $63.73 a barrel, down 28 cents, or 0.44%. Trading is expected to be muted due to a U.S. bank holiday.Ukrainian President Volodymyr Zelenskiy vowed on Sunday to retaliate by ordering more strikes deep inside Russia after Russian drone attacks on power facilities in northern and southern Ukraine. Both countries have intensified airstrikes in recent weeks, targeting energy infrastructure and disrupting Russian oil exports.Markets remained concerned about Russian oil flows, with weekly shipments from its ports dropping to a four-week low of 2.72 million barrels per day, according to tanker tracker data cited by ANZ analysts in a note.However, Russian oil exports to India are set to rise in September, traders said, despite secondary tariffs imposed on New Delhi by the U.S. for buying oil from Moscow.\"Modi’s meeting with Putin in China will be closely watched, particularly in light of U.S. pressures,\" Michael McCarthy, CEO of Moomoo Australia, said, referring to the Indian and Russian presidents who are attending the Shanghai Cooperation Organisation regional security bloc in China.A Reuters poll on Friday showed that oil prices are unlikely to gain much traction from current levels this year, as rising output from top producers adds to the risk of a surplus and U.S. tariff threats weigh on demand growth.The week started with a slew of manufacturing and export data from China, Japan and South Korea, among the world’s biggest crude oil importers.Factory activity in China unexpectedly grew in August but weakened for other Asian economies as companies began to feel the pain from U.S. tariffs, private surveys showed on Monday, clouding the outlook for the region’s fragile recovery.Brent and WTI crude posted their first decline in four months in August, down 6% or more on OPEC+ supply concerns.Investors are eyeing the September 7 meeting between members of the Organization of the Petroleum Exporting Countries and their allies for further supply cues.Meanwhile, U.S. crude oil production hit a record high in June, rising 133,000 barrels per day to 13.58 million bpd, according to data released by the Energy Information Administration on Friday.A U.S. labor market report this week will give a crucial read into the economy’s health and test investors’ confidence that interest rate cuts are coming soon, a view that has lifted their appetite for riskier assets such as commodities.AI computing powers are changing the stock market. Investing.com's ProPicks AI includes dozens of winning stock portfolios chosen by our advanced AI.      Year to date, 3 out of 4 global portfolios are beating their benchmark indexes, with 98% in the green. Our flagship Tech Titans strategy doubled the S&P 500 within 18 months, including notable winners like Super Micro Computer (+185%) and AppLovin (+157%).      Which stock will be the next to soar?", "analysis": 2}, "73": {"type": "news", "title": "Oil prices extend losses as traders downplay Russia sanction risks", "source": "investing", "link": "investing", "date": "2025-09-01T03:16:08+00:00", "body": "Investing.com-- Oil prices fell in Asian trading on Monday after recording monthly losses for August, as investors discounted the risk of immediate supply disruptions from potential secondary sanctions on Russian crude and focused on fresh Chinese factory data for demand signals.As of 23:01 ET (03:01 GMT), Brent Oil Futures expiring in October fell 0.4% to $67.21 per barrel, while West Texas Intermediate (WTI) crude futures also declined 0.4% to $63.78 per barrel.Both contracts dropped more than 7% in August, dragged by supply glut fears from steady OPEC+ production hikes.Russia-Ukraine peace hopes have dimmed after U.S. President Donald Trump last month urged Ukrainian President Volodymyr Zelenskyy and Russian President Vladimir Putin to hold direct talks before considering a trilateral summit hosted by Washington. Despite this, supply disruption fears from possible sanctions on Russian oil buyers have eased.“Oil prices settled lower last week despite growing European calls for secondary sanctions on buyers of Russian oil and gas.The mild reaction may suggest the market is becoming increasingly numb towards sanction risks,” ING analysts said in a note.“And that to be effective, sanctions would likely need US backing. Up until now, the US has only imposed secondary tariffs on India for its purchases of Russian oil, not other key players like China,” they added.In a move tied to India’s aggression in buying Russian crude, an additional 25% U.S. tariff on Indian imports took effect last week, doubling the total duty to 50% starting August 27. Traders also assessed seasonal factors, with U.S. fuel demand expected to soften as the summer driving season ends. Rising OPEC+ output in the coming months is likely to add further supply, raising concerns that inventories could build if economic growth stays subdued.The demand outlook remained uncertain after mixed economic readings from China. The official manufacturing purchasing managers’ index (PMI) contracted again in August, while a private RatigDog survey showed that factory activity rebounded at the fastest pace in five months.The best opportunities often hide in plain sight—buried among thousands of stocks you'd never have time to research individually.      That's why smart investors use our Stock Screener with 50+ predefined screens and 160+ customizable filters to surface hidden gems instantly.     For example, the Piotroski's Picks method averages 23% annual returns by focusing on financial strength, and you can get it as a standalone screen. Momentum Masters catches stocks gaining serious traction, while Blue-Chip Bargains finds undervalued giants.      With screens for dividends, growth, value, and more, you'll discover opportunities others miss. Our current favorite screen is Under $10/share, which is great for discovering stocks trading under $10 with recent price momentum showing some very impressive returns!", "analysis": 1}, "74": {"type": "news", "title": "Oil Steadies as Putin and Modi Huddle in China After US Tariff", "source": "finance.yahoo", "link": "finance.yahoo", "date": "2025-09-01T06:50:16.000Z", "body": "(Bloomberg) -- Oil steadied following a monthly drop in August, with traders focused on concerns over a potential glut and signals over Russian supply.Brent traded above $67 a barrel, while West Texas Intermediate was near $64. With Washington seeking to force India to halt imports of Russian oil by ratcheting up secondary tariffs, Prime Minister Narendra Modi met with Vladimir Putin at a regional summit in China. In social-media comments, Modi said it was “always a delight” to meet with the Russian president.Most Read from BloombergSydney’s New Airport Will Take Travelers Into the WildAmtrak Debuts New High-Speed Acela Trains After Years of DelaysTrump Signs Order to ‘Make Federal Architecture Beautiful Again’NY Penn Station’s Long-Awaited Revamp to Start Work in 2027Parents Mobilize to Protect School Commutes Amid Trump Deployment in DCHeading into the meeting, New Delhi defended its ties with Russia, with Oil Minister Hardeep Puri arguing in a column in The Hindu newspaper that the flows had helped to shield the global economy from a price spike. At the same time, local refiners have not stopped taking Moscow’s crude, although there have been some opportunistic purchases of cargoes from the US.The global oil benchmark has shed about 10% this year, hurt by a deluge of additional supply from OPEC+, as well as concerns the US-led trade war will crimp energy demand. The producer group, which includes Russia, is scheduled to hold a virtual meeting on Sept. 7 to discuss its next move, with the International Energy Agency forecasting the market faces a record glut next year.“Attention now is on the upcoming OPEC+ meeting, where discussions will focus on the potential restoration of the remaining 1.65 million barrels a day of voluntary production cuts.” said Gao Mingyu, chief energy analyst at SDIC Essence Futures Co. “After the peak season is over, the pressure of oversupply in the oil market will become more pronounced.”In the US, hedge funds winnowed their bullish position on US crude to the lowest in about 18 years as uncertainty over economic policy compounded growing concerns about oversupply.The US measures against India are part of a wider drive to broker an end to the war in Ukraine, although Washington hasn’t targeted China with similar moves. At the weekend, White House trade adviser Peter Navarro kept up the pressure, telling Fox News Sunday that New Delhi was fueling “the Russian war machine” and “nothing but a laundromat” for the Kremlin.At their meeting in Tianjin, China, Modi and Putin embraced before riding together to their bilateral meeting, underscoring their deep ties.  “Conversations with him are always insightful,” Modi said in a post on X, referring to the Russian leader.", "analysis": 2}}, "analysis": {"1": {"p_short": 0, "p_medium": 0, "summary": "The oil market is currently facing mixed signals. On the bullish side, there's a decline in US crude inventories indicating strong demand, and continued attacks on Russian energy infrastructure are disrupting supply. However, these factors are offset by concerns about the end of the US summer driving season which could lead to a drop in demand and increased tariffs on Indian imports of Russian oil. Additionally, Russia has restarted oil supply to Hungary and Slovakia. Considering these opposing forces, a neutral outlook for both the short and medium term is appropriate.", "date": "2025-08-28T15:35:28.883747+00:00", "close": 0.7, "hesitation": 1}, "2": {"p_short": -1, "p_medium": -1, "summary": "Based on the provided news items, the short-term and medium-term outlook for oil prices is negative. Several factors contribute to this assessment: rising oil production from OPEC+ and non-OPEC+ countries, concerns about a supply glut, and potential weakening demand due to the end of the US summer driving season. Geopolitical risks, such as the Russia-Ukraine conflict and US tariffs on India, add further uncertainty but are not expected to significantly offset the downward pressure on prices. Multiple sources indicate expectations of lower oil prices in the coming months. The Reuters poll suggests that analysts expect the price of Brent Crude to average $67.65 per barrel this year, with WTI Crude averaging $64.65 per barrel. Major investment banks also anticipate a slide in Brent and WTI prices in the fourth quarter of 2025 and the first quarter of 2026. Although there are some bullish factors that could lend to a potential buy, such as the potential for an over-corrected bearish sentiment, the overall sentiment of the data indicates that a sell is more appropriate.", "date": "2025-08-29T14:57:53.301533+00:00", "close": -0.91, "hesitation": -1}, "3": {"p_short": -1, "p_medium": -1, "summary": "The oil market faces downward pressure due to rising production from OPEC+ and non-OPEC+ nations, coupled with concerns about demand. Specifically, the end of the US summer driving season is expected to contribute to decreased consumption. Geopolitical factors, such as the US imposing tariffs on India for purchasing Russian oil and the uncertainties surrounding a Russia-Ukraine peace deal, add further complexity to the market dynamics. Technical data on WTI and Brent futures show a stable but slightly decreasing tendency. Considering all, there is a Sell recommendation for both the short and medium term.", "date": "2025-08-29T16:02:10.703922+00:00", "close": -0.91, "hesitation": -1}, "4": {"p_short": "-1", "p_medium": "-1", "summary": "WTI crude oil prices are expected to decline slightly in both the short and medium term. Several factors contribute to this outlook: rising output from OPEC+ and other producers, concerns about a potential supply glut, and uncertainties surrounding global demand due to trade policies and geopolitical tensions. While there are geopolitical risks that could provide some support, the overall sentiment points towards downward pressure on prices. The end of the U.S. summer driving season also contributes to the expectation of lower demand.", "date": "2025-08-29T21:18:30.628139+00:00", "close": -0.91, "hesitation": -1}, "5": {"p_short": "-1", "p_medium": "-1", "summary": "WTI crude oil prices are expected to decrease slightly in the short and medium term. This forecast is based on the following factors: concerns about a looming supply glut due to rising output from OPEC+ and non-OPEC+ producers, the end of the peak summer demand season in the U.S., and uncertainties about demand stemming from U.S. trade policies. Geopolitical risks and potential disruptions to Russian supplies are providing some support, but the overall trend appears bearish.", "date": "2025-08-29T21:22:33.191436+00:00", "close": -0.91, "hesitation": -1}, "6": {"p_short": "-1", "p_medium": "-1", "summary": "Several factors point to a slightly bearish outlook for WTI crude oil prices in both the short and medium term. News items indicate a potential supply glut due to rising output from OPEC+ and non-OPEC+ producers. Concerns about global demand, especially with the end of the U.S. summer driving season, and geopolitical uncertainties (tariffs on India, the Russia-Ukraine conflict) further contribute to the downward pressure. Recent data also shows U.S. oil production hitting a record high. While some news suggests a slight weekly gain, the overall sentiment leans towards prices remaining subdued around current levels or potentially decreasing.", "date": "2025-08-29T21:36:27.325177+00:00", "close": -0.91, "hesitation": -1}, "7": {"p_short": "-1", "p_medium": "-1", "summary": "In the short term, WTI crude oil prices are likely to experience downward pressure due to concerns about a looming supply glut, rising output from OPEC+, and the end of the U.S. summer driving season. Geopolitical tensions and potential disruptions to Russian supplies provide some support, but are insufficient to offset the bearish factors. The medium-term outlook also suggests a downward trend, influenced by continued supply increases and uncertainties surrounding global demand, including potential impacts from tariffs and trade policies. Analysts' forecasts generally point to lower average prices in the coming quarters.", "date": "2025-08-29T21:45:49.915135+00:00", "close": -0.91, "hesitation": -1}, "8": {"p_short": "-1", "p_medium": "0", "summary": "WTI crude oil prices have shown mixed performance recently. While there were gains in mid-August, the trend has been mostly negative for the rest of the month, including a slight decrease on the most recent day. Given this recent negative trend, a slight downward pressure is expected in the short term. Medium term is more uncertain as the data shows volatility with no clear trend.", "date": "2025-08-29T22:00:25.969874+00:00", "close": -0.91, "hesitation": -1}, "9": {"p_short": "-1", "p_medium": "0", "summary": "Recent WTI crude oil prices have shown mixed signals. While there were some positive gains earlier in the month, the last few days have shown a slight decline. Overall, the trend seems slightly negative in the very short term and neutral in the medium term.", "date": "2025-08-29T22:02:41.000855+00:00", "close": -0.91, "hesitation": -1}, "10": {"p_short": "0", "p_medium": "0", "summary": "The WTI crude oil price has shown mixed signals over the past few weeks, with no clear upward or downward trend. Recent daily changes fluctuate between positive and negative values, making it difficult to determine a consistent direction. Therefore, a neutral forecast is appropriate for both the short and medium term.", "date": "2025-08-30T12:40:55.057756+00:00"}, "11": {"p_short": "-1", "p_medium": "0", "summary": "Recent WTI crude oil price data shows mixed signals. While there were several days of positive price movement earlier in August, the most recent day shows a negative price change. Overall, there is no clear trend. Therefore, the short-term forecast is slightly negative. The medium-term trend is neutral, given the mixed signals over the past month.", "date": "2025-08-31T11:33:37.610435+00:00"}}}